#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CopyPose1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_CopyPose1.ABP_CopyPose1_C
// 0x01E0 (0x0550 - 0x0370)
class UABP_CopyPose1_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x03A8(0x0158)(ContainsInstancedReference)
	class USkeletalMeshComponent*                 Master_Mesh;                                       // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWillie_BP_C*                           Character;                                         // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Spawned_Limb_Location;                             // 0x0518(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Spawned_Limb_Rotation;                             // 0x0530(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         Spawned_Bone_Int;                                  // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintBeginPlay();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_CopyPose1(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_CopyPose1_C">();
	}
	static class UABP_CopyPose1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_CopyPose1_C>();
	}
};
static_assert(alignof(UABP_CopyPose1_C) == 0x000010, "Wrong alignment on UABP_CopyPose1_C");
static_assert(sizeof(UABP_CopyPose1_C) == 0x000550, "Wrong size on UABP_CopyPose1_C");
static_assert(offsetof(UABP_CopyPose1_C, UberGraphFrame) == 0x000370, "Member 'UABP_CopyPose1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_CopyPose1_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_CopyPose1_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_CopyPose1_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_CopyPose1_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_CopyPose1_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_CopyPose1_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_CopyPose1_C, AnimGraphNode_CopyPoseFromMesh) == 0x0003A8, "Member 'UABP_CopyPose1_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UABP_CopyPose1_C, Master_Mesh) == 0x000500, "Member 'UABP_CopyPose1_C::Master_Mesh' has a wrong offset!");
static_assert(offsetof(UABP_CopyPose1_C, NewVar) == 0x000508, "Member 'UABP_CopyPose1_C::NewVar' has a wrong offset!");
static_assert(offsetof(UABP_CopyPose1_C, Character) == 0x000510, "Member 'UABP_CopyPose1_C::Character' has a wrong offset!");
static_assert(offsetof(UABP_CopyPose1_C, Spawned_Limb_Location) == 0x000518, "Member 'UABP_CopyPose1_C::Spawned_Limb_Location' has a wrong offset!");
static_assert(offsetof(UABP_CopyPose1_C, Spawned_Limb_Rotation) == 0x000530, "Member 'UABP_CopyPose1_C::Spawned_Limb_Rotation' has a wrong offset!");
static_assert(offsetof(UABP_CopyPose1_C, Spawned_Bone_Int) == 0x000548, "Member 'UABP_CopyPose1_C::Spawned_Bone_Int' has a wrong offset!");

}

