#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Parts

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Parts.ABP_Parts_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Parts_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Parts_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Parts_C_AnimGraph");
static_assert(sizeof(ABP_Parts_C_AnimGraph) == 0x000010, "Wrong size on ABP_Parts_C_AnimGraph");
static_assert(offsetof(ABP_Parts_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Parts_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Parts.ABP_Parts_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Parts_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Parts_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Parts_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Parts_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Parts_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Parts_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Parts_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Parts.ABP_Parts_C.ExecuteUbergraph_ABP_Parts
// 0x0050 (0x0050 - 0x0000)
struct ABP_Parts_C_ExecuteUbergraph_ABP_Parts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWillie_Torso_BP_C*                     K2Node_DynamicCast_AsWillie_Torso_BP;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWillie_BP_C*                           K2Node_DynamicCast_AsWillie_BP;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts) == 0x000008, "Wrong alignment on ABP_Parts_C_ExecuteUbergraph_ABP_Parts");
static_assert(sizeof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts) == 0x000050, "Wrong size on ABP_Parts_C_ExecuteUbergraph_ABP_Parts");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, EntryPoint) == 0x000000, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000008, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, K2Node_Event_DeltaTimeX) == 0x000014, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, CallFunc_Conv_BoolToDouble_ReturnValue_1) == 0x000018, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::CallFunc_Conv_BoolToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, CallFunc_GetOwningActor_ReturnValue) == 0x000020, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, K2Node_DynamicCast_AsWillie_Torso_BP) == 0x000028, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::K2Node_DynamicCast_AsWillie_Torso_BP' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, K2Node_DynamicCast_AsWillie_BP) == 0x000038, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::K2Node_DynamicCast_AsWillie_BP' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, K2Node_SwitchName_CmpSuccess) == 0x000042, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, K2Node_StructMemberSet_Alpha_ImplicitCast) == 0x000044, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::K2Node_StructMemberSet_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Parts_C_ExecuteUbergraph_ABP_Parts, K2Node_StructMemberSet_Alpha_ImplicitCast_1) == 0x000048, "Member 'ABP_Parts_C_ExecuteUbergraph_ABP_Parts::K2Node_StructMemberSet_Alpha_ImplicitCast_1' has a wrong offset!");

}

