#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Attached_Transform_Str

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Attached_Transform_Str.Attached_Transform_Str
// 0x0068 (0x0068 - 0x0000)
struct FAttached_Transform_Str final
{
public:
	class UPrimitiveComponent*                    Attachto_26_AF0408B346906C4EBA020EA366EEAE46;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   Bone_7_2F42570242588B6BF6ADCDBA18A7351A;           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_10_985EAE4C4031F49C1113748716647022;      // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_15_4874E135472C35879FDAC5BDBD8B0716;      // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale_14_E837D8A44EAC4853D66E9CAAC20166AD;         // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal_20_52C2A8A1460E1AD4FDC120BB2EDADB24;         // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ParticleEmitter_32_25BFC1104FF3AB1468C9B890BD786B4C; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAttached_Transform_Str) == 0x000008, "Wrong alignment on FAttached_Transform_Str");
static_assert(sizeof(FAttached_Transform_Str) == 0x000068, "Wrong size on FAttached_Transform_Str");
static_assert(offsetof(FAttached_Transform_Str, Attachto_26_AF0408B346906C4EBA020EA366EEAE46) == 0x000000, "Member 'FAttached_Transform_Str::Attachto_26_AF0408B346906C4EBA020EA366EEAE46' has a wrong offset!");
static_assert(offsetof(FAttached_Transform_Str, Bone_7_2F42570242588B6BF6ADCDBA18A7351A) == 0x000008, "Member 'FAttached_Transform_Str::Bone_7_2F42570242588B6BF6ADCDBA18A7351A' has a wrong offset!");
static_assert(offsetof(FAttached_Transform_Str, Location_10_985EAE4C4031F49C1113748716647022) == 0x000010, "Member 'FAttached_Transform_Str::Location_10_985EAE4C4031F49C1113748716647022' has a wrong offset!");
static_assert(offsetof(FAttached_Transform_Str, Rotation_15_4874E135472C35879FDAC5BDBD8B0716) == 0x000028, "Member 'FAttached_Transform_Str::Rotation_15_4874E135472C35879FDAC5BDBD8B0716' has a wrong offset!");
static_assert(offsetof(FAttached_Transform_Str, Scale_14_E837D8A44EAC4853D66E9CAAC20166AD) == 0x000040, "Member 'FAttached_Transform_Str::Scale_14_E837D8A44EAC4853D66E9CAAC20166AD' has a wrong offset!");
static_assert(offsetof(FAttached_Transform_Str, Decal_20_52C2A8A1460E1AD4FDC120BB2EDADB24) == 0x000058, "Member 'FAttached_Transform_Str::Decal_20_52C2A8A1460E1AD4FDC120BB2EDADB24' has a wrong offset!");
static_assert(offsetof(FAttached_Transform_Str, ParticleEmitter_32_25BFC1104FF3AB1468C9B890BD786B4C) == 0x000060, "Member 'FAttached_Transform_Str::ParticleEmitter_32_25BFC1104FF3AB1468C9B890BD786B4C' has a wrong offset!");

}

