#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Armor_Master

#include "Basic.hpp"

#include "Enum_Clothing_Material_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Str_ArmorElements_structs.hpp"
#include "Enum_Tiers_structs.hpp"
#include "SkeletalMerging_structs.hpp"


namespace SDK::Params
{

// Function BP_Armor_Master.BP_Armor_Master_C.BndEvt__BP_Armor_Master_Armor Mesh Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_Static_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Armor_Master.BP_Armor_Master_C.BndEvt__BP_Armor_Master_Armor Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_Armor_Master_C_BndEvt__BP_Armor_Master_Armor_Mesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Armor_Master.BP_Armor_Master_C.ExecuteUbergraph_BP_Armor_Master
// 0x0670 (0x0670 - 0x0000)
struct BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0028(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent_1;         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse_1;        // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit_1;                  // 0x0168(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343[0x5];                                      // 0x0343(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Tiers                                    Temp_byte_Variable;                                // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0368(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x03F0(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x04EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EB[0x1];                                      // 0x04EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x04F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0568(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0590(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x05A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue_1;     // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C3[0x5];                                      // 0x05C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_1;      // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMesh*>                  K2Node_Select_Default;                             // 0x05F8(0x0010)(ReferenceParm)
	struct FSkeletalMeshMergeParams               K2Node_MakeStruct_SkeletalMeshMergeParams;         // 0x0608(0x0040)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_MergeMeshes_ReturnValue;                  // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D[0x3];                                      // 0x065D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetAllMassScale_InMassScale_ImplicitCast; // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast; // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_1; // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master) == 0x000008, "Wrong alignment on BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master");
static_assert(sizeof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master) == 0x000670, "Wrong size on BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, EntryPoint) == 0x000000, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Greater_IntInt_ReturnValue) == 0x000025, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000028, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, Temp_int_Array_Index_Variable_1) == 0x000120, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_IsValid_ReturnValue) == 0x000124, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Array_Get_Item) == 0x000128, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x000130, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_ComponentBoundEvent_HitComponent_1) == 0x000138, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_ComponentBoundEvent_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000140, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000148, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_ComponentBoundEvent_NormalImpulse_1) == 0x000150, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_ComponentBoundEvent_NormalImpulse_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_ComponentBoundEvent_Hit_1) == 0x000168, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_ComponentBoundEvent_Hit_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_bBlockingHit) == 0x000260, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_bInitialOverlap) == 0x000261, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_Time) == 0x000264, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_Distance) == 0x000268, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_Location) == 0x000270, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_ImpactPoint) == 0x000288, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_Normal) == 0x0002A0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_ImpactNormal) == 0x0002B8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_PhysMat) == 0x0002D0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_HitActor) == 0x0002D8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_HitComponent) == 0x0002E0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_HitBoneName) == 0x0002E8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_BoneName) == 0x0002F0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_HitItem) == 0x0002F8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_ElementIndex) == 0x0002FC, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_FaceIndex) == 0x000300, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_TraceStart) == 0x000308, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_TraceEnd) == 0x000320, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_VSize_ReturnValue) == 0x000338, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_GetCollisionObjectType_ReturnValue) == 0x000340, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000341, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000342, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000348, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, Temp_byte_Variable) == 0x000350, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_FClamp_ReturnValue) == 0x000358, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000360, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000368, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Array_Get_Item_1) == 0x000378, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Array_Length_ReturnValue_2) == 0x000380, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Conv_NameToString_ReturnValue) == 0x000388, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Less_IntInt_ReturnValue_1) == 0x000398, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_LeftChop_ReturnValue) == 0x0003A0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Conv_StringToName_ReturnValue) == 0x0003B0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0003B8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_ComponentBoundEvent_HitComponent) == 0x0003C0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_ComponentBoundEvent_OtherActor) == 0x0003C8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_ComponentBoundEvent_OtherComp) == 0x0003D0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0003D8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_ComponentBoundEvent_Hit) == 0x0003F0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_IsValid_ReturnValue_1) == 0x0004E8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0004E9, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0004EA, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_Time_1) == 0x0004EC, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_Distance_1) == 0x0004F0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_Location_1) == 0x0004F8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000510, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_Normal_1) == 0x000528, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000540, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_PhysMat_1) == 0x000558, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_HitActor_1) == 0x000560, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_HitComponent_1) == 0x000568, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_HitBoneName_1) == 0x000570, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_BoneName_1) == 0x000578, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_HitItem_1) == 0x000580, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_ElementIndex_1) == 0x000584, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_FaceIndex_1) == 0x000588, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_TraceStart_1) == 0x000590, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_BreakHitResult_TraceEnd_1) == 0x0005A8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_GetCollisionObjectType_ReturnValue_1) == 0x0005C0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_GetCollisionObjectType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0005C1, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_IsValid_ReturnValue_2) == 0x0005C2, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_VSize_ReturnValue_1) == 0x0005C8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0005D0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0005D8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_FClamp_ReturnValue_1) == 0x0005E0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_GetGlobalTimeDilation_ReturnValue_1) == 0x0005E8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_GetGlobalTimeDilation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0005F0, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_Select_Default) == 0x0005F8, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, K2Node_MakeStruct_SkeletalMeshMergeParams) == 0x000608, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::K2Node_MakeStruct_SkeletalMeshMergeParams' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_IsValid_ReturnValue_3) == 0x000648, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_MergeMeshes_ReturnValue) == 0x000650, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_MergeMeshes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Array_Length_ReturnValue_3) == 0x000658, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00065C, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_SetAllMassScale_InMassScale_ImplicitCast) == 0x000660, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_SetAllMassScale_InMassScale_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast) == 0x000664, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master, CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_1) == 0x000668, "Member 'BP_Armor_Master_C_ExecuteUbergraph_BP_Armor_Master::CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_1' has a wrong offset!");

// Function BP_Armor_Master.BP_Armor_Master_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Armor_Master_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armor_Master_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Armor_Master_C_ReceiveTick");
static_assert(sizeof(BP_Armor_Master_C_ReceiveTick) == 0x000004, "Wrong size on BP_Armor_Master_C_ReceiveTick");
static_assert(offsetof(BP_Armor_Master_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Armor_Master_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Armor_Master.BP_Armor_Master_C.UserConstructionScript
// 0x0468 (0x0468 - 0x0000)
struct BP_Armor_Master_C_UserConstructionScript final
{
public:
	class UMaterialFunctionInterface*             Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_1;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_2;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_3;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_Clothing_Material                        Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialFunctionInterface*             Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_6;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_7;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_Clothing_Material                        Temp_byte_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialFunctionInterface*             Temp_object_Variable_8;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_9;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_10;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_11;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_Clothing_Material                        Temp_byte_Variable_2;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialFunctionInterface*             Temp_object_Variable_12;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_13;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_14;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_15;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_Clothing_Material                        Temp_byte_Variable_3;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialFunctionInterface*             Temp_object_Variable_16;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_17;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_18;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_19;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_Clothing_Material                        Temp_byte_Variable_4;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialFunctionInterface*             Temp_object_Variable_20;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_21;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_22;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialFunctionInterface*             Temp_object_Variable_23;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
