#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prop_Training_Dummy_001

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Prop_Training_Dummy_001.BP_Prop_Training_Dummy_001_C.BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_Prop_Training_Dummy_001_C_BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Prop_Training_Dummy_001.BP_Prop_Training_Dummy_001_C.ExecuteUbergraph_BP_Prop_Training_Dummy_001
// 0x0268 (0x0268 - 0x0000)
struct BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0050(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlaySoundAtLocation_VolumeMultiplier_ImplicitCast; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001) == 0x000008, "Wrong alignment on BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001");
static_assert(sizeof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001) == 0x000268, "Wrong size on BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, EntryPoint) == 0x000000, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, Temp_bool_Variable) == 0x000004, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, Temp_object_Variable) == 0x000008, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, Temp_object_Variable_1) == 0x000010, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, Temp_bool_IsClosed_Variable) == 0x000019, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, K2Node_ComponentBoundEvent_HitComponent) == 0x000020, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, K2Node_ComponentBoundEvent_OtherActor) == 0x000028, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, K2Node_ComponentBoundEvent_OtherComp) == 0x000030, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000038, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, K2Node_ComponentBoundEvent_Hit) == 0x000050, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x000148, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_bBlockingHit) == 0x00014C, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_bInitialOverlap) == 0x00014D, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_Time) == 0x000150, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_Distance) == 0x000154, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_Location) == 0x000158, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_ImpactPoint) == 0x000170, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_Normal) == 0x000188, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A0, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_PhysMat) == 0x0001B8, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_HitActor) == 0x0001C0, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_HitComponent) == 0x0001C8, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_HitBoneName) == 0x0001D0, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_BoneName) == 0x0001D8, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_ElementIndex) == 0x0001E4, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_FaceIndex) == 0x0001E8, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_VSize_ReturnValue) == 0x000220, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_ComponentHasTag_ReturnValue) == 0x000228, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000229, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_SelectFloat_ReturnValue) == 0x000230, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000238, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000240, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_FClamp_ReturnValue) == 0x000248, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000250, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, K2Node_Select_Default) == 0x000258, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001, CallFunc_PlaySoundAtLocation_VolumeMultiplier_ImplicitCast) == 0x000260, "Member 'BP_Prop_Training_Dummy_001_C_ExecuteUbergraph_BP_Prop_Training_Dummy_001::CallFunc_PlaySoundAtLocation_VolumeMultiplier_ImplicitCast' has a wrong offset!");

}

