#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prop_Training_Dummy_001

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Prop_Training_Dummy_001.BP_Prop_Training_Dummy_001_C
// 0x0040 (0x02D0 - 0x0290)
class ABP_Prop_Training_Dummy_001_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPhysicsConstraintComponent*            PhysicsConstraint2;                                // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            PhysicsConstraint1;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            PhysicsConstraint;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Helm;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Shield;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Dummy;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Barrel_BP_SM_Barrel_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_Prop_Training_Dummy_001(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Prop_Training_Dummy_001_C">();
	}
	static class ABP_Prop_Training_Dummy_001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Prop_Training_Dummy_001_C>();
	}
};
static_assert(alignof(ABP_Prop_Training_Dummy_001_C) == 0x000008, "Wrong alignment on ABP_Prop_Training_Dummy_001_C");
static_assert(sizeof(ABP_Prop_Training_Dummy_001_C) == 0x0002D0, "Wrong size on ABP_Prop_Training_Dummy_001_C");
static_assert(offsetof(ABP_Prop_Training_Dummy_001_C, UberGraphFrame) == 0x000290, "Member 'ABP_Prop_Training_Dummy_001_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Training_Dummy_001_C, PhysicsConstraint2) == 0x000298, "Member 'ABP_Prop_Training_Dummy_001_C::PhysicsConstraint2' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Training_Dummy_001_C, PhysicsConstraint1) == 0x0002A0, "Member 'ABP_Prop_Training_Dummy_001_C::PhysicsConstraint1' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Training_Dummy_001_C, PhysicsConstraint) == 0x0002A8, "Member 'ABP_Prop_Training_Dummy_001_C::PhysicsConstraint' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Training_Dummy_001_C, SM_Helm) == 0x0002B0, "Member 'ABP_Prop_Training_Dummy_001_C::SM_Helm' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Training_Dummy_001_C, SM_Shield) == 0x0002B8, "Member 'ABP_Prop_Training_Dummy_001_C::SM_Shield' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Training_Dummy_001_C, SM_Dummy) == 0x0002C0, "Member 'ABP_Prop_Training_Dummy_001_C::SM_Dummy' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Training_Dummy_001_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_Prop_Training_Dummy_001_C::DefaultSceneRoot' has a wrong offset!");

}

