#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScreenshotManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ScreenshotManager.BP_ScreenshotManager_C.ExecuteUbergraph_BP_ScreenshotManager
// 0x00D0 (0x00D0 - 0x0000)
struct BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_CustomEvent_Size;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Path;                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Filename;                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0050(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               CallFunc_AddComponent_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_FOVAngle_ImplicitCast;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager) == 0x000010, "Wrong alignment on BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager");
static_assert(sizeof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager) == 0x0000D0, "Wrong size on BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, EntryPoint) == 0x000000, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, Temp_bool_Variable) == 0x000004, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, K2Node_CustomEvent_Size) == 0x000010, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::K2Node_CustomEvent_Size' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, K2Node_CustomEvent_Path) == 0x000018, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::K2Node_CustomEvent_Path' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, K2Node_CustomEvent_Filename) == 0x000028, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::K2Node_CustomEvent_Filename' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000040, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, Temp_struct_Variable) == 0x000050, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, CallFunc_AddComponent_ReturnValue) == 0x0000B0, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, CallFunc_MakeLiteralDouble_ReturnValue) == 0x0000B8, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, K2Node_VariableSet_FOVAngle_ImplicitCast) == 0x0000C0, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::K2Node_VariableSet_FOVAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, CallFunc_Delay_Duration_ImplicitCast) == 0x0000C4, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager, CallFunc_Delay_Duration_ImplicitCast_1) == 0x0000C8, "Member 'BP_ScreenshotManager_C_ExecuteUbergraph_BP_ScreenshotManager::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");

// Function BP_ScreenshotManager.BP_ScreenshotManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ScreenshotManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScreenshotManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ScreenshotManager_C_ReceiveTick");
static_assert(sizeof(BP_ScreenshotManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_ScreenshotManager_C_ReceiveTick");
static_assert(offsetof(BP_ScreenshotManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ScreenshotManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ScreenshotManager.BP_ScreenshotManager_C.TakeScreenshot
// 0x0028 (0x0028 - 0x0000)
struct BP_ScreenshotManager_C_TakeScreenshot final
{
public:
	struct FIntPoint                              Size;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Path;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Filename;                                          // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScreenshotManager_C_TakeScreenshot) == 0x000008, "Wrong alignment on BP_ScreenshotManager_C_TakeScreenshot");
static_assert(sizeof(BP_ScreenshotManager_C_TakeScreenshot) == 0x000028, "Wrong size on BP_ScreenshotManager_C_TakeScreenshot");
static_assert(offsetof(BP_ScreenshotManager_C_TakeScreenshot, Size) == 0x000000, "Member 'BP_ScreenshotManager_C_TakeScreenshot::Size' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_TakeScreenshot, Path) == 0x000008, "Member 'BP_ScreenshotManager_C_TakeScreenshot::Path' has a wrong offset!");
static_assert(offsetof(BP_ScreenshotManager_C_TakeScreenshot, Filename) == 0x000018, "Member 'BP_ScreenshotManager_C_TakeScreenshot::Filename' has a wrong offset!");

}

