#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScreenshotManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ScreenshotManager.BP_ScreenshotManager_C
// 0x0720 (0x09B0 - 0x0290)
class ABP_ScreenshotManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   CurrentPostProcess;                                // 0x02A0(0x06F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        CurrentFOV;                                        // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTargetTexture;                               // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentTimeDilation;                               // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUI_PhotoMode_C*                        PhotoModeWidgetRef;                                // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ScreenshotManager(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void TakeScreenshot(const struct FIntPoint& Size, const class FString& Path, const class FString& Filename);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ScreenshotManager_C">();
	}
	static class ABP_ScreenshotManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ScreenshotManager_C>();
	}
};
static_assert(alignof(ABP_ScreenshotManager_C) == 0x000010, "Wrong alignment on ABP_ScreenshotManager_C");
static_assert(sizeof(ABP_ScreenshotManager_C) == 0x0009B0, "Wrong size on ABP_ScreenshotManager_C");
static_assert(offsetof(ABP_ScreenshotManager_C, UberGraphFrame) == 0x000290, "Member 'ABP_ScreenshotManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ScreenshotManager_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_ScreenshotManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ScreenshotManager_C, CurrentPostProcess) == 0x0002A0, "Member 'ABP_ScreenshotManager_C::CurrentPostProcess' has a wrong offset!");
static_assert(offsetof(ABP_ScreenshotManager_C, CurrentFOV) == 0x000990, "Member 'ABP_ScreenshotManager_C::CurrentFOV' has a wrong offset!");
static_assert(offsetof(ABP_ScreenshotManager_C, RenderTargetTexture) == 0x000998, "Member 'ABP_ScreenshotManager_C::RenderTargetTexture' has a wrong offset!");
static_assert(offsetof(ABP_ScreenshotManager_C, CurrentTimeDilation) == 0x0009A0, "Member 'ABP_ScreenshotManager_C::CurrentTimeDilation' has a wrong offset!");
static_assert(offsetof(ABP_ScreenshotManager_C, PhotoModeWidgetRef) == 0x0009A8, "Member 'ABP_ScreenshotManager_C::PhotoModeWidgetRef' has a wrong offset!");

}

