#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Improv_CandleStick_Big

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Weapon_Improv_CandleStick_Big.BP_Weapon_Improv_CandleStick_Big_C.BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_Weapon_Improv_CandleStick_Big_C_BndEvt__BP_Weapon_Improv_CandleStick_Big_Candle_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Weapon_Improv_CandleStick_Big.BP_Weapon_Improv_CandleStick_Big_C.BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_Weapon_Improv_CandleStick_Big_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Weapon_Improv_CandleStick_Big.BP_Weapon_Improv_CandleStick_Big_C.ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big
// 0x0270 (0x0270 - 0x0000)
struct BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent_1;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse_1;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit_1;                  // 0x0038(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0168(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big) == 0x000008, "Wrong alignment on BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big");
static_assert(sizeof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big) == 0x000270, "Wrong size on BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, EntryPoint) == 0x000000, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_ComponentBoundEvent_HitComponent_1) == 0x000008, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_ComponentBoundEvent_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_ComponentBoundEvent_NormalImpulse_1) == 0x000020, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_ComponentBoundEvent_NormalImpulse_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_ComponentBoundEvent_Hit_1) == 0x000038, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_ComponentBoundEvent_Hit_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_Event_DeltaSeconds) == 0x000130, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_ComponentBoundEvent_HitComponent) == 0x000138, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_ComponentBoundEvent_OtherActor) == 0x000140, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_ComponentBoundEvent_OtherComp) == 0x000148, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000150, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, K2Node_ComponentBoundEvent_Hit) == 0x000168, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, CallFunc_VSize_ReturnValue) == 0x000260, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000268, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, CallFunc_IsValid_ReturnValue) == 0x000269, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big, CallFunc_IsValid_ReturnValue_1) == 0x00026A, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ExecuteUbergraph_BP_Weapon_Improv_CandleStick_Big::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_Weapon_Improv_CandleStick_Big.BP_Weapon_Improv_CandleStick_Big_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Weapon_Improv_CandleStick_Big_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_Improv_CandleStick_Big_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Weapon_Improv_CandleStick_Big_C_ReceiveTick");
static_assert(sizeof(BP_Weapon_Improv_CandleStick_Big_C_ReceiveTick) == 0x000004, "Wrong size on BP_Weapon_Improv_CandleStick_Big_C_ReceiveTick");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Weapon_Improv_CandleStick_Big_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Weapon_Improv_CandleStick_Big.BP_Weapon_Improv_CandleStick_Big_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct BP_Weapon_Improv_CandleStick_Big_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_Improv_CandleStick_Big_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Weapon_Improv_CandleStick_Big_C_UserConstructionScript");
static_assert(sizeof(BP_Weapon_Improv_CandleStick_Big_C_UserConstructionScript) == 0x000004, "Wrong size on BP_Weapon_Improv_CandleStick_Big_C_UserConstructionScript");
static_assert(offsetof(BP_Weapon_Improv_CandleStick_Big_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue) == 0x000000, "Member 'BP_Weapon_Improv_CandleStick_Big_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

}

