#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Tool_Scissors

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Weapon_Tool_Scissors.BP_Weapon_Tool_Scissors_C.BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_Weapon_Tool_Scissors_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Weapon_Tool_Scissors.BP_Weapon_Tool_Scissors_C.ExecuteUbergraph_BP_Weapon_Tool_Scissors
// 0x01B0 (0x01B0 - 0x0000)
struct BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x00A8(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors) == 0x000010, "Wrong alignment on BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors");
static_assert(sizeof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors) == 0x0001B0, "Wrong size on BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors, EntryPoint) == 0x000000, "Member 'BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors, K2Node_ComponentBoundEvent_HitComponent) == 0x000078, "Member 'BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors, K2Node_ComponentBoundEvent_OtherActor) == 0x000080, "Member 'BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors, K2Node_ComponentBoundEvent_OtherComp) == 0x000088, "Member 'BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000090, "Member 'BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors, K2Node_ComponentBoundEvent_Hit) == 0x0000A8, "Member 'BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors, CallFunc_SetStaticMesh_ReturnValue) == 0x0001A0, "Member 'BP_Weapon_Tool_Scissors_C_ExecuteUbergraph_BP_Weapon_Tool_Scissors::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_Weapon_Tool_Scissors.BP_Weapon_Tool_Scissors_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct BP_Weapon_Tool_Scissors_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_Tool_Scissors_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Weapon_Tool_Scissors_C_UserConstructionScript");
static_assert(sizeof(BP_Weapon_Tool_Scissors_C_UserConstructionScript) == 0x000004, "Wrong size on BP_Weapon_Tool_Scissors_C_UserConstructionScript");
static_assert(offsetof(BP_Weapon_Tool_Scissors_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue) == 0x000000, "Member 'BP_Weapon_Tool_Scissors_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

}

