#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Improv_Stool

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModularWeaponBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_Improv_Stool.BP_Weapon_Improv_Stool_C
// 0x0020 (0x0B50 - 0x0B30)
class ABP_Weapon_Improv_Stool_C final : public AModularWeaponBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Weapon_Improv_Stool_C;           // 0x0B30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Base1_0;                                           // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1;                                              // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lid;                                               // 0x0B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_Weapon_Improv_Stool(int32 EntryPoint);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Weapon_Improv_Stool_C">();
	}
	static class ABP_Weapon_Improv_Stool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapon_Improv_Stool_C>();
	}
};
static_assert(alignof(ABP_Weapon_Improv_Stool_C) == 0x000008, "Wrong alignment on ABP_Weapon_Improv_Stool_C");
static_assert(sizeof(ABP_Weapon_Improv_Stool_C) == 0x000B50, "Wrong size on ABP_Weapon_Improv_Stool_C");
static_assert(offsetof(ABP_Weapon_Improv_Stool_C, UberGraphFrame_BP_Weapon_Improv_Stool_C) == 0x000B30, "Member 'ABP_Weapon_Improv_Stool_C::UberGraphFrame_BP_Weapon_Improv_Stool_C' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Improv_Stool_C, Base1_0) == 0x000B38, "Member 'ABP_Weapon_Improv_Stool_C::Base1_0' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Improv_Stool_C, Tip1) == 0x000B40, "Member 'ABP_Weapon_Improv_Stool_C::Tip1' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Improv_Stool_C, Lid) == 0x000B48, "Member 'ABP_Weapon_Improv_Stool_C::Lid' has a wrong offset!");

}

