#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Tool_Scissors

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModularWeaponBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_Tool_Scissors.BP_Weapon_Tool_Scissors_C
// 0x0038 (0x0B68 - 0x0B30)
class ABP_Weapon_Tool_Scissors_C final : public AModularWeaponBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Weapon_Tool_Scissors_C;          // 0x0B30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Tip3;                                              // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip2;                                              // 0x0B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Base1_0;                                           // 0x0B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1;                                              // 0x0B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Weapon;                                            // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_Weapon_Tool_Scissors(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Weapon_Tool_Scissors_C">();
	}
	static class ABP_Weapon_Tool_Scissors_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapon_Tool_Scissors_C>();
	}
};
static_assert(alignof(ABP_Weapon_Tool_Scissors_C) == 0x000008, "Wrong alignment on ABP_Weapon_Tool_Scissors_C");
static_assert(sizeof(ABP_Weapon_Tool_Scissors_C) == 0x000B68, "Wrong size on ABP_Weapon_Tool_Scissors_C");
static_assert(offsetof(ABP_Weapon_Tool_Scissors_C, UberGraphFrame_BP_Weapon_Tool_Scissors_C) == 0x000B30, "Member 'ABP_Weapon_Tool_Scissors_C::UberGraphFrame_BP_Weapon_Tool_Scissors_C' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Tool_Scissors_C, Tip3) == 0x000B38, "Member 'ABP_Weapon_Tool_Scissors_C::Tip3' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Tool_Scissors_C, Box) == 0x000B40, "Member 'ABP_Weapon_Tool_Scissors_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Tool_Scissors_C, Tip2) == 0x000B48, "Member 'ABP_Weapon_Tool_Scissors_C::Tip2' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Tool_Scissors_C, Base1_0) == 0x000B50, "Member 'ABP_Weapon_Tool_Scissors_C::Base1_0' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Tool_Scissors_C, Tip1) == 0x000B58, "Member 'ABP_Weapon_Tool_Scissors_C::Tip1' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Tool_Scissors_C, Weapon) == 0x000B60, "Member 'ABP_Weapon_Tool_Scissors_C::Weapon' has a wrong offset!");

}

