#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_PhotoModeUtilities

#include "Basic.hpp"

#include "E_ScreenshotMethod_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "S_PhotosData_structs.hpp"
#include "E_SaveSort_structs.hpp"


namespace SDK::Params
{

// Function BPFL_PhotoModeUtilities.BPFL_PhotoModeUtilities_C.Directory Path Correction
// 0x00A8 (0x00A8 - 0x0000)
struct BPFL_PhotoModeUtilities_C_Directory_Path_Correction final
{
public:
	bool                                          Use_Custom_Path_;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Custom_Path;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Corrected_Path;                                    // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ProjectDir_ReturnValue;                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_NormalizeDirectoryName_OutPath;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RemoveDuplicateSlashes_OutPath;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction) == 0x000008, "Wrong alignment on BPFL_PhotoModeUtilities_C_Directory_Path_Correction");
static_assert(sizeof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction) == 0x0000A8, "Wrong size on BPFL_PhotoModeUtilities_C_Directory_Path_Correction");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, Use_Custom_Path_) == 0x000000, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::Use_Custom_Path_' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, Custom_Path) == 0x000008, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::Custom_Path' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, __WorldContext) == 0x000018, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, Corrected_Path) == 0x000020, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::Corrected_Path' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, CallFunc_ProjectDir_ReturnValue) == 0x000030, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::CallFunc_ProjectDir_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, CallFunc_TextIsEmpty_ReturnValue) == 0x000060, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, CallFunc_NormalizeDirectoryName_OutPath) == 0x000068, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::CallFunc_NormalizeDirectoryName_OutPath' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, CallFunc_Not_PreBool_ReturnValue) == 0x000078, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, CallFunc_RemoveDuplicateSlashes_OutPath) == 0x000080, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::CallFunc_RemoveDuplicateSlashes_OutPath' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, CallFunc_BooleanAND_ReturnValue) == 0x000090, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Directory_Path_Correction, CallFunc_SelectString_ReturnValue) == 0x000098, "Member 'BPFL_PhotoModeUtilities_C_Directory_Path_Correction::CallFunc_SelectString_ReturnValue' has a wrong offset!");

// Function BPFL_PhotoModeUtilities.BPFL_PhotoModeUtilities_C.Get Default Screen Resolution
// 0x0058 (0x0058 - 0x0000)
struct BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              Resolution__X_and_Y_;                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Vector2DVector2D_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Conv_Vector2DToIntPoint_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution) == 0x000008, "Wrong alignment on BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution");
static_assert(sizeof(BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution) == 0x000058, "Wrong size on BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution, __WorldContext) == 0x000000, "Member 'BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution, Resolution__X_and_Y_) == 0x000008, "Member 'BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution::Resolution__X_and_Y_' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution, Temp_bool_Variable) == 0x000010, "Member 'BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution, CallFunc_GetViewportSize_ReturnValue) == 0x000018, "Member 'BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution, Temp_struct_Variable) == 0x000028, "Member 'BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution, CallFunc_EqualEqual_Vector2DVector2D_ReturnValue) == 0x000038, "Member 'BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution::CallFunc_EqualEqual_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution, K2Node_Select_Default) == 0x000040, "Member 'BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution, CallFunc_Conv_Vector2DToIntPoint_ReturnValue) == 0x000050, "Member 'BPFL_PhotoModeUtilities_C_Get_Default_Screen_Resolution::CallFunc_Conv_Vector2DToIntPoint_ReturnValue' has a wrong offset!");

// Function BPFL_PhotoModeUtilities.BPFL_PhotoModeUtilities_C.Get Screenshot File
// 0x0078 (0x0078 - 0x0000)
struct BPFL_PhotoModeUtilities_C_Get_Screenshot_File final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 FullFilePath;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid_;                                          // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             TwoD_Image;                                        // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Base_Filename;                                     // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Full_File_Path;                                    // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_FileExists_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_ImportFileAsTexture2D_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File) == 0x000008, "Wrong alignment on BPFL_PhotoModeUtilities_C_Get_Screenshot_File");
static_assert(sizeof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File) == 0x000078, "Wrong size on BPFL_PhotoModeUtilities_C_Get_Screenshot_File");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, WorldContextObject) == 0x000000, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::WorldContextObject' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, FullFilePath) == 0x000008, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::FullFilePath' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, __WorldContext) == 0x000018, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, IsValid_) == 0x000020, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::IsValid_' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, TwoD_Image) == 0x000028, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::TwoD_Image' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, Base_Filename) == 0x000030, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::Base_Filename' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, Full_File_Path) == 0x000040, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::Full_File_Path' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, CallFunc_FileExists_ReturnValue) == 0x000050, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::CallFunc_FileExists_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, CallFunc_GetBaseFilename_ReturnValue) == 0x000058, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, CallFunc_ImportFileAsTexture2D_ReturnValue) == 0x000068, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::CallFunc_ImportFileAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Get_Screenshot_File, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BPFL_PhotoModeUtilities_C_Get_Screenshot_File::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPFL_PhotoModeUtilities.BPFL_PhotoModeUtilities_C.GetAllImersedPostProcess
// 0x03D0 (0x03D0 - 0x0000)
struct BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraLocation;                                    // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class APostProcessVolume*, struct FTransform> VolumesTransforms;                                 // 0x0028(0x0050)(Parm, OutParm)
	TMap<class APostProcessVolume*, struct FVector> VolumesExtent;                                     // 0x0078(0x0050)(Parm, OutParm)
	TArray<double>                                PriorityArray;                                     // 0x00C8(0x0010)(Edit, BlueprintVisible)
	int32                                         LastIndex;                                         // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostProcessVolume*>             PostProcessVolumes;                                // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FVector                                BoxExtent;                                         // 0x00F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoxTransform;                                      // 0x0110(0x0060)(Edit, BlueprintVisible, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CurrentPostProcessRotation;                        // 0x0170(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CameraLoc;                                         // 0x0188(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class APostProcessVolume*, struct FVector> BlendedVolumesExtent;                              // 0x01A0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<class APostProcessVolume*, struct FTransform> BlendedPostProcessVolumes;                         // 0x01F0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0240(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item;                           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     CallFunc_Array_Get_Item_1;                         // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorFloat_ReturnValue;              // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_2;                         // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x2];                                      // 0x031A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInBoxWithTransform_ReturnValue;    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0323(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0xC];                                      // 0x0324(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0330(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     CallFunc_Array_Get_Item_3;                         // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_VectorFloat_B_ImplicitCast;           // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Add_NewItem_ImplicitCast;           // 0x03C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess) == 0x000010, "Wrong alignment on BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess");
static_assert(sizeof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess) == 0x0003D0, "Wrong size on BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, PlayerController) == 0x000000, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::PlayerController' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, __WorldContext) == 0x000008, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CameraLocation) == 0x000010, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CameraLocation' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, VolumesTransforms) == 0x000028, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::VolumesTransforms' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, VolumesExtent) == 0x000078, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::VolumesExtent' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, PriorityArray) == 0x0000C8, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::PriorityArray' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, LastIndex) == 0x0000D8, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::LastIndex' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, PostProcessVolumes) == 0x0000E0, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::PostProcessVolumes' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, BoxExtent) == 0x0000F0, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::BoxExtent' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, BoxTransform) == 0x000110, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::BoxTransform' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CurrentPostProcessRotation) == 0x000170, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CurrentPostProcessRotation' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CameraLoc) == 0x000188, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CameraLoc' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, BlendedVolumesExtent) == 0x0001A0, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::BlendedVolumesExtent' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, BlendedPostProcessVolumes) == 0x0001F0, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::BlendedPostProcessVolumes' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_GetAllActorsOfClass_OutActors) == 0x000240, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000250, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, Temp_int_Loop_Counter_Variable) == 0x000268, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Add_IntInt_ReturnValue) == 0x00026C, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, Temp_int_Loop_Counter_Variable_1) == 0x000270, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Add_IntInt_ReturnValue_1) == 0x000274, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, Temp_int_Array_Index_Variable) == 0x000278, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, Temp_int_Variable) == 0x00027C, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Add_IntInt_ReturnValue_2) == 0x000280, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Subtract_IntInt_ReturnValue) == 0x000284, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, Temp_int_Variable_1) == 0x000288, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Array_Get_Item) == 0x000290, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Array_Get_Item_1) == 0x000298, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Array_Length_ReturnValue) == 0x0002A0, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Less_IntInt_ReturnValue) == 0x0002A4, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0002A5, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_GetActorBounds_Origin) == 0x0002A8, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_GetActorBounds_BoxExtent) == 0x0002C0, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0002D8, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Add_VectorFloat_ReturnValue) == 0x0002F0, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Add_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Add_IntInt_ReturnValue_3) == 0x000308, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Array_Get_Item_2) == 0x000310, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000318, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000319, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Add_IntInt_ReturnValue_4) == 0x00031C, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_IsPointInBoxWithTransform_ReturnValue) == 0x000320, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_IsPointInBoxWithTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x000321, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_BooleanOR_ReturnValue) == 0x000322, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_BooleanAND_ReturnValue) == 0x000323, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_MakeTransform_ReturnValue) == 0x000330, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, Temp_int_Array_Index_Variable_1) == 0x000390, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Array_Get_Item_3) == 0x000398, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0003A0, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Array_Add_ReturnValue) == 0x0003A4, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Array_Length_ReturnValue_1) == 0x0003A8, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Array_LastIndex_ReturnValue) == 0x0003AC, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003B0, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Add_VectorFloat_B_ImplicitCast) == 0x0003B8, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Add_VectorFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess, CallFunc_Array_Add_NewItem_ImplicitCast) == 0x0003C0, "Member 'BPFL_PhotoModeUtilities_C_GetAllImersedPostProcess::CallFunc_Array_Add_NewItem_ImplicitCast' has a wrong offset!");

// Function BPFL_PhotoModeUtilities.BPFL_PhotoModeUtilities_C.Hide HUD When Using Photo Mode
// 0x0020 (0x0020 - 0x0000)
struct BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode final
{
public:
	ESlateVisibility                              If_Not_Using_Photo_Mode_Set_This_Widget_As;        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PhotoMode_C*                       PhotoModeComponent;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Visibility;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Using_Photo_Mode_or_Gallery_;                      // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode) == 0x000008, "Wrong alignment on BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode");
static_assert(sizeof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode) == 0x000020, "Wrong size on BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode, If_Not_Using_Photo_Mode_Set_This_Widget_As) == 0x000000, "Member 'BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode::If_Not_Using_Photo_Mode_Set_This_Widget_As' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode, PhotoModeComponent) == 0x000008, "Member 'BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode::PhotoModeComponent' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode, __WorldContext) == 0x000010, "Member 'BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode, Visibility) == 0x000018, "Member 'BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode::Visibility' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode, Using_Photo_Mode_or_Gallery_) == 0x000019, "Member 'BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode::Using_Photo_Mode_or_Gallery_' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode, Temp_bool_Variable) == 0x00001A, "Member 'BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode, CallFunc_IsValid_ReturnValue) == 0x00001B, "Member 'BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode, Temp_byte_Variable) == 0x00001D, "Member 'BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode, K2Node_Select_Default) == 0x00001E, "Member 'BPFL_PhotoModeUtilities_C_Hide_HUD_When_Using_Photo_Mode::K2Node_Select_Default' has a wrong offset!");

// Function BPFL_PhotoModeUtilities.BPFL_PhotoModeUtilities_C.HighResScreenshot (without UI)
// 0x02D8 (0x02D8 - 0x0000)
struct BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_ final
{
public:
	class UObject*                                World_Context_Object__Self_;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      Player_Controller;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Screenshot_Folder_Path;                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FIntPoint                              Resolution__X_and_Y_;                              // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ScreenshotMethod                            ScreenshotMethod;                                  // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ScreenshotManager_C*                ScreenshotManager;                                 // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Full_Photo_Path;                                   // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Photo_Name;                                        // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Resolution;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FullFilePath;                                      // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                WorldContextObject;                                // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 FolderPath;                                        // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_NormalizeDirectoryName_OutPath;           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndsWith_ReturnValue;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_6;           // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_7;           // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_13;             // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_14;             // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_15;             // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_16;             // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_17;             // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_18;             // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_19;             // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_20;             // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_21;             // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_) == 0x000008, "Wrong alignment on BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_");
static_assert(sizeof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_) == 0x0002D8, "Wrong size on BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, World_Context_Object__Self_) == 0x000000, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::World_Context_Object__Self_' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, Player_Controller) == 0x000008, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::Player_Controller' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, Screenshot_Folder_Path) == 0x000010, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::Screenshot_Folder_Path' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, Resolution__X_and_Y_) == 0x000020, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::Resolution__X_and_Y_' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, ScreenshotMethod) == 0x000028, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::ScreenshotMethod' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, ScreenshotManager) == 0x000030, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::ScreenshotManager' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, __WorldContext) == 0x000038, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, Full_Photo_Path) == 0x000040, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::Full_Photo_Path' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, Photo_Name) == 0x000050, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::Photo_Name' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, Resolution) == 0x000060, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::Resolution' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, FullFilePath) == 0x000070, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::FullFilePath' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, WorldContextObject) == 0x000080, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::WorldContextObject' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, FolderPath) == 0x000088, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::FolderPath' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, PlayerController) == 0x000098, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::PlayerController' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, CallFunc_GetBaseFilename_ReturnValue) == 0x0000A0, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_, CallFunc_Conv_IntToString_ReturnValue) == 0x0000B0, "Member 'BPFL_PhotoModeUtilities_C_HighResScreenshot__without_UI_::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
