#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CanParry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_CanParry.BPI_CanParry_C.Send Threat Location R
// 0x0038 (0x0038 - 0x0000)
struct BPI_CanParry_C_Send_Threat_Location_R final
{
public:
	struct FVector                                Threat_Location;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Immediate;                                         // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Nul;                                               // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CanParry_C_Send_Threat_Location_R) == 0x000008, "Wrong alignment on BPI_CanParry_C_Send_Threat_Location_R");
static_assert(sizeof(BPI_CanParry_C_Send_Threat_Location_R) == 0x000038, "Wrong size on BPI_CanParry_C_Send_Threat_Location_R");
static_assert(offsetof(BPI_CanParry_C_Send_Threat_Location_R, Threat_Location) == 0x000000, "Member 'BPI_CanParry_C_Send_Threat_Location_R::Threat_Location' has a wrong offset!");
static_assert(offsetof(BPI_CanParry_C_Send_Threat_Location_R, Offset) == 0x000018, "Member 'BPI_CanParry_C_Send_Threat_Location_R::Offset' has a wrong offset!");
static_assert(offsetof(BPI_CanParry_C_Send_Threat_Location_R, Immediate) == 0x000030, "Member 'BPI_CanParry_C_Send_Threat_Location_R::Immediate' has a wrong offset!");
static_assert(offsetof(BPI_CanParry_C_Send_Threat_Location_R, Nul) == 0x000031, "Member 'BPI_CanParry_C_Send_Threat_Location_R::Nul' has a wrong offset!");

}

