#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Constraint_Zero

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Constraint_Zero.Constraint_Zero_C
// 0x0038 (0x02C8 - 0x0290)
class AConstraint_Zero_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPhysicsConstraintComponent*            PhysicsConstraint;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component_1;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component_2;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   Bone_Name_1;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   Bone_Name_2;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Destroy_Distance;                                  // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Destroy_Self();
	void ExecuteUbergraph_Constraint_Zero(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Constraint_Zero_C">();
	}
	static class AConstraint_Zero_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AConstraint_Zero_C>();
	}
};
static_assert(alignof(AConstraint_Zero_C) == 0x000008, "Wrong alignment on AConstraint_Zero_C");
static_assert(sizeof(AConstraint_Zero_C) == 0x0002C8, "Wrong size on AConstraint_Zero_C");
static_assert(offsetof(AConstraint_Zero_C, UberGraphFrame) == 0x000290, "Member 'AConstraint_Zero_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AConstraint_Zero_C, PhysicsConstraint) == 0x000298, "Member 'AConstraint_Zero_C::PhysicsConstraint' has a wrong offset!");
static_assert(offsetof(AConstraint_Zero_C, Component_1) == 0x0002A0, "Member 'AConstraint_Zero_C::Component_1' has a wrong offset!");
static_assert(offsetof(AConstraint_Zero_C, Component_2) == 0x0002A8, "Member 'AConstraint_Zero_C::Component_2' has a wrong offset!");
static_assert(offsetof(AConstraint_Zero_C, Bone_Name_1) == 0x0002B0, "Member 'AConstraint_Zero_C::Bone_Name_1' has a wrong offset!");
static_assert(offsetof(AConstraint_Zero_C, Bone_Name_2) == 0x0002B8, "Member 'AConstraint_Zero_C::Bone_Name_2' has a wrong offset!");
static_assert(offsetof(AConstraint_Zero_C, Destroy_Distance) == 0x0002C0, "Member 'AConstraint_Zero_C::Destroy_Distance' has a wrong offset!");

}

