#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Constraint_Zero

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Constraint_Zero.Constraint_Zero_C.ExecuteUbergraph_Constraint_Zero
// 0x0050 (0x0050 - 0x0000)
struct Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero) == 0x000008, "Wrong alignment on Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero");
static_assert(sizeof(Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero) == 0x000050, "Wrong size on Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero");
static_assert(offsetof(Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero, EntryPoint) == 0x000000, "Member 'Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero::EntryPoint' has a wrong offset!");
static_assert(offsetof(Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero, CallFunc_GetSocketLocation_ReturnValue) == 0x000010, "Member 'Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000028, "Member 'Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero, CallFunc_Vector_Distance_ReturnValue) == 0x000040, "Member 'Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000048, "Member 'Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'Constraint_Zero_C_ExecuteUbergraph_Constraint_Zero::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function Constraint_Zero.Constraint_Zero_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Constraint_Zero_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Constraint_Zero_C_ReceiveTick) == 0x000004, "Wrong alignment on Constraint_Zero_C_ReceiveTick");
static_assert(sizeof(Constraint_Zero_C_ReceiveTick) == 0x000004, "Wrong size on Constraint_Zero_C_ReceiveTick");
static_assert(offsetof(Constraint_Zero_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Constraint_Zero_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

