#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreditWid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreditWid.CreditWid_C
// 0x0038 (0x0318 - 0x02E0)
class UCreditWid_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverBack;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BackButton;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NakedCover;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 LastOpenedWidget;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CreditWid_BackButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CreditWid_BackButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__CreditWid_BackButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_CreditWid(int32 EntryPoint);
	void GetLastOpenedWidget();
	void SetLastOpenedWidget(class UClass* UW);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreditWid_C">();
	}
	static class UCreditWid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreditWid_C>();
	}
};
static_assert(alignof(UCreditWid_C) == 0x000008, "Wrong alignment on UCreditWid_C");
static_assert(sizeof(UCreditWid_C) == 0x000318, "Wrong size on UCreditWid_C");
static_assert(offsetof(UCreditWid_C, UberGraphFrame) == 0x0002E0, "Member 'UCreditWid_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreditWid_C, HoverBack) == 0x0002E8, "Member 'UCreditWid_C::HoverBack' has a wrong offset!");
static_assert(offsetof(UCreditWid_C, BackButton) == 0x0002F0, "Member 'UCreditWid_C::BackButton' has a wrong offset!");
static_assert(offsetof(UCreditWid_C, Image_2) == 0x0002F8, "Member 'UCreditWid_C::Image_2' has a wrong offset!");
static_assert(offsetof(UCreditWid_C, Image_5) == 0x000300, "Member 'UCreditWid_C::Image_5' has a wrong offset!");
static_assert(offsetof(UCreditWid_C, NakedCover) == 0x000308, "Member 'UCreditWid_C::NakedCover' has a wrong offset!");
static_assert(offsetof(UCreditWid_C, LastOpenedWidget) == 0x000310, "Member 'UCreditWid_C::LastOpenedWidget' has a wrong offset!");

}

