#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GI_Settings

#include "Basic.hpp"


namespace SDK::Params
{

// Function GI_Settings.GI_Settings_C.ExecuteUbergraph_GI_Settings
// 0x0048 (0x0048 - 0x0000)
struct GI_Settings_C_ExecuteUbergraph_GI_Settings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         K2Node_DynamicCast_AsSG_Settings;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_1; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Voice_Volume_ImplicitCast;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_Settings_C_ExecuteUbergraph_GI_Settings) == 0x000008, "Wrong alignment on GI_Settings_C_ExecuteUbergraph_GI_Settings");
static_assert(sizeof(GI_Settings_C_ExecuteUbergraph_GI_Settings) == 0x000048, "Wrong size on GI_Settings_C_ExecuteUbergraph_GI_Settings");
static_assert(offsetof(GI_Settings_C_ExecuteUbergraph_GI_Settings, EntryPoint) == 0x000000, "Member 'GI_Settings_C_ExecuteUbergraph_GI_Settings::EntryPoint' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_ExecuteUbergraph_GI_Settings, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000008, "Member 'GI_Settings_C_ExecuteUbergraph_GI_Settings::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_ExecuteUbergraph_GI_Settings, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000010, "Member 'GI_Settings_C_ExecuteUbergraph_GI_Settings::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_ExecuteUbergraph_GI_Settings, K2Node_DynamicCast_AsSG_Settings) == 0x000018, "Member 'GI_Settings_C_ExecuteUbergraph_GI_Settings::K2Node_DynamicCast_AsSG_Settings' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_ExecuteUbergraph_GI_Settings, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GI_Settings_C_ExecuteUbergraph_GI_Settings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_ExecuteUbergraph_GI_Settings, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000028, "Member 'GI_Settings_C_ExecuteUbergraph_GI_Settings::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_ExecuteUbergraph_GI_Settings, CallFunc_SaveGameToSlot_ReturnValue) == 0x000030, "Member 'GI_Settings_C_ExecuteUbergraph_GI_Settings::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_ExecuteUbergraph_GI_Settings, CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast) == 0x000034, "Member 'GI_Settings_C_ExecuteUbergraph_GI_Settings::CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_ExecuteUbergraph_GI_Settings, CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_1) == 0x000038, "Member 'GI_Settings_C_ExecuteUbergraph_GI_Settings::CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_ExecuteUbergraph_GI_Settings, K2Node_VariableSet_Voice_Volume_ImplicitCast) == 0x000040, "Member 'GI_Settings_C_ExecuteUbergraph_GI_Settings::K2Node_VariableSet_Voice_Volume_ImplicitCast' has a wrong offset!");

// Function GI_Settings.GI_Settings_C.Play Music
// 0x0018 (0x0018 - 0x0000)
struct GI_Settings_C_Play_Music final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         VolumeMultiplier;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPersistAcrossLevelTransition;                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_CreateSound2D_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_Settings_C_Play_Music) == 0x000008, "Wrong alignment on GI_Settings_C_Play_Music");
static_assert(sizeof(GI_Settings_C_Play_Music) == 0x000018, "Wrong size on GI_Settings_C_Play_Music");
static_assert(offsetof(GI_Settings_C_Play_Music, Sound) == 0x000000, "Member 'GI_Settings_C_Play_Music::Sound' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_Play_Music, VolumeMultiplier) == 0x000008, "Member 'GI_Settings_C_Play_Music::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_Play_Music, bPersistAcrossLevelTransition) == 0x00000C, "Member 'GI_Settings_C_Play_Music::bPersistAcrossLevelTransition' has a wrong offset!");
static_assert(offsetof(GI_Settings_C_Play_Music, CallFunc_CreateSound2D_ReturnValue) == 0x000010, "Member 'GI_Settings_C_Play_Music::CallFunc_CreateSound2D_ReturnValue' has a wrong offset!");

// Function GI_Settings.GI_Settings_C.Stop Music
// 0x0001 (0x0001 - 0x0000)
struct GI_Settings_C_Stop_Music final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_Settings_C_Stop_Music) == 0x000001, "Wrong alignment on GI_Settings_C_Stop_Music");
static_assert(sizeof(GI_Settings_C_Stop_Music) == 0x000001, "Wrong size on GI_Settings_C_Stop_Music");
static_assert(offsetof(GI_Settings_C_Stop_Music, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GI_Settings_C_Stop_Music::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

