#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_Sword_Blade_Master

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_MaterialQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_MaterialLayer_structs.hpp"


namespace SDK::Params
{

// Function Modular_Sword_Blade_Master.Modular_Sword_Blade_Master_C.ExecuteUbergraph_Modular_Sword_Blade_Master
// 0x0070 (0x0070 - 0x0000)
struct Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master) == 0x000008, "Wrong alignment on Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master");
static_assert(sizeof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master) == 0x000070, "Wrong size on Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master");
static_assert(offsetof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master, EntryPoint) == 0x000000, "Member 'Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000008, "Member 'Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000028, "Member 'Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000058, "Member 'Modular_Sword_Blade_Master_C_ExecuteUbergraph_Modular_Sword_Blade_Master::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");

// Function Modular_Sword_Blade_Master.Modular_Sword_Blade_Master_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Modular_Sword_Blade_Master_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Sword_Blade_Master_C_ReceiveTick) == 0x000004, "Wrong alignment on Modular_Sword_Blade_Master_C_ReceiveTick");
static_assert(sizeof(Modular_Sword_Blade_Master_C_ReceiveTick) == 0x000004, "Wrong size on Modular_Sword_Blade_Master_C_ReceiveTick");
static_assert(offsetof(Modular_Sword_Blade_Master_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Modular_Sword_Blade_Master_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Modular_Sword_Blade_Master.Modular_Sword_Blade_Master_C.UserConstructionScript
// 0x0410 (0x0410 - 0x0000)
struct Modular_Sword_Blade_Master_C_UserConstructionScript final
{
public:
	Enum_MaterialQuality                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialQuality                          Temp_byte_Variable_4;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00E0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0220(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue_1;       // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_9;      // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_10;     // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_11;     // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast; // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast_1; // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Sword_Blade_Master_C_UserConstructionScript) == 0x000008, "Wrong alignment on Modular_Sword_Blade_Master_C_UserConstructionScript");
static_assert(sizeof(Modular_Sword_Blade_Master_C_UserConstructionScript) == 0x000410, "Wrong size on Modular_Sword_Blade_Master_C_UserConstructionScript");
static_assert(offsetof(Modular_Sword_Blade_Master_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'Modular_Sword_Blade_Master_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Blade_Master_C_UserConstructionScript, Temp_byte_Variable_1) == 0x000001, "Member 'Modular_Sword_Blade_Master_C_UserConstructionScript::Temp_byte_Variable_1' has a wrong offset!");
