#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModularWeaponBP_Billhook_B

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ModularWeaponBP_Billhook_B.ModularWeaponBP_Billhook_B_C.BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function ModularWeaponBP_Billhook_B.ModularWeaponBP_Billhook_B_C.BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'ModularWeaponBP_Billhook_B_C_BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function ModularWeaponBP_Billhook_B.ModularWeaponBP_Billhook_B_C.ExecuteUbergraph_ModularWeaponBP_Billhook_B
// 0x0258 (0x0258 - 0x0000)
struct ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0038(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent_1;         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse_1;        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit_1;                  // 0x0160(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B) == 0x000008, "Wrong alignment on ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B");
static_assert(sizeof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B) == 0x000258, "Wrong size on ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, EntryPoint) == 0x000000, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::EntryPoint' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, K2Node_ComponentBoundEvent_HitComponent) == 0x000008, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000020, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, K2Node_ComponentBoundEvent_Hit) == 0x000038, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, K2Node_ComponentBoundEvent_HitComponent_1) == 0x000130, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::K2Node_ComponentBoundEvent_HitComponent_1' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000138, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000140, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, K2Node_ComponentBoundEvent_NormalImpulse_1) == 0x000148, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::K2Node_ComponentBoundEvent_NormalImpulse_1' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B, K2Node_ComponentBoundEvent_Hit_1) == 0x000160, "Member 'ModularWeaponBP_Billhook_B_C_ExecuteUbergraph_ModularWeaponBP_Billhook_B::K2Node_ComponentBoundEvent_Hit_1' has a wrong offset!");

// Function ModularWeaponBP_Billhook_B.ModularWeaponBP_Billhook_B_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct ModularWeaponBP_Billhook_B_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModularWeaponBP_Billhook_B_C_UserConstructionScript) == 0x000004, "Wrong alignment on ModularWeaponBP_Billhook_B_C_UserConstructionScript");
static_assert(sizeof(ModularWeaponBP_Billhook_B_C_UserConstructionScript) == 0x000008, "Wrong size on ModularWeaponBP_Billhook_B_C_UserConstructionScript");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue) == 0x000000, "Member 'ModularWeaponBP_Billhook_B_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Billhook_B_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000004, "Member 'ModularWeaponBP_Billhook_B_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

}

