#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_Sword_Guard_Master

#include "Basic.hpp"

#include "Enum_MaterialLayer_structs.hpp"
#include "Engine_structs.hpp"
#include "Modular_Weapon_Module_classes.hpp"
#include "Enum_MaterialQuality_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Modular_Sword_Guard_Master.Modular_Sword_Guard_Master_C
// 0x0028 (0x0528 - 0x0500)
class AModular_Sword_Guard_Master_C : public AModular_Weapon_Module_C
{
public:
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Modular_Sword_Guard_Master_C;       // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMesh*                            New_Mesh;                                          // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Mass;                                              // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Materian_Int_Min;                                  // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Materian_Int_Max;                                  // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Squash_Scale__Temp_;                               // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Modular_Sword_Guard_Master(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Modular_Sword_Guard_Master_C">();
	}
	static class AModular_Sword_Guard_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AModular_Sword_Guard_Master_C>();
	}
};
static_assert(alignof(AModular_Sword_Guard_Master_C) == 0x000008, "Wrong alignment on AModular_Sword_Guard_Master_C");
static_assert(sizeof(AModular_Sword_Guard_Master_C) == 0x000528, "Wrong size on AModular_Sword_Guard_Master_C");
static_assert(offsetof(AModular_Sword_Guard_Master_C, UberGraphFrame_Modular_Sword_Guard_Master_C) == 0x000500, "Member 'AModular_Sword_Guard_Master_C::UberGraphFrame_Modular_Sword_Guard_Master_C' has a wrong offset!");
static_assert(offsetof(AModular_Sword_Guard_Master_C, New_Mesh) == 0x000508, "Member 'AModular_Sword_Guard_Master_C::New_Mesh' has a wrong offset!");
static_assert(offsetof(AModular_Sword_Guard_Master_C, Mass) == 0x000510, "Member 'AModular_Sword_Guard_Master_C::Mass' has a wrong offset!");
static_assert(offsetof(AModular_Sword_Guard_Master_C, Materian_Int_Min) == 0x000518, "Member 'AModular_Sword_Guard_Master_C::Materian_Int_Min' has a wrong offset!");
static_assert(offsetof(AModular_Sword_Guard_Master_C, Materian_Int_Max) == 0x00051C, "Member 'AModular_Sword_Guard_Master_C::Materian_Int_Max' has a wrong offset!");
static_assert(offsetof(AModular_Sword_Guard_Master_C, Squash_Scale__Temp_) == 0x000520, "Member 'AModular_Sword_Guard_Master_C::Squash_Scale__Temp_' has a wrong offset!");

}

