#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModularWeaponBP_Polearm_Mid_Tier

#include "Basic.hpp"


namespace SDK::Params
{

// Function ModularWeaponBP_Polearm_Mid_Tier.ModularWeaponBP_Polearm_Mid_Tier_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript) == 0x000008, "Wrong alignment on ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript");
static_assert(sizeof(ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript) == 0x000030, "Wrong size on ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript");
static_assert(offsetof(ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript, Temp_class_Variable) == 0x000008, "Member 'ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript, Temp_class_Variable_1) == 0x000010, "Member 'ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript, Temp_class_Variable_2) == 0x000018, "Member 'ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000020, "Member 'ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript, K2Node_Select_Default) == 0x000028, "Member 'ModularWeaponBP_Polearm_Mid_Tier_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");

}

