#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_Weapon_Grip

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Modular_Weapon_Grip.Modular_Weapon_Grip_C.ExecuteUbergraph_Modular_Weapon_Grip
// 0x0058 (0x0058 - 0x0000)
struct Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Random_OutItem;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Random_OutItem_1;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Random_OutItem_2;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_2;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default_2;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip) == 0x000008, "Wrong alignment on Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip");
static_assert(sizeof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip) == 0x000058, "Wrong size on Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, EntryPoint) == 0x000000, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::EntryPoint' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, Temp_bool_Variable) == 0x000004, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, CallFunc_IsValidClass_ReturnValue) == 0x000005, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, Temp_bool_Variable_1) == 0x000006, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, Temp_bool_Variable_2) == 0x000007, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, CallFunc_Array_Random_OutItem) == 0x000008, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, CallFunc_Array_Random_OutIndex) == 0x000010, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, CallFunc_Array_Random_OutItem_1) == 0x000018, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::CallFunc_Array_Random_OutItem_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, CallFunc_Array_Random_OutIndex_1) == 0x000020, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::CallFunc_Array_Random_OutIndex_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, CallFunc_Array_Random_OutItem_2) == 0x000028, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::CallFunc_Array_Random_OutItem_2' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, CallFunc_Array_Random_OutIndex_2) == 0x000030, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::CallFunc_Array_Random_OutIndex_2' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, CallFunc_IsValidClass_ReturnValue_1) == 0x000034, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, K2Node_Select_Default) == 0x000038, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, K2Node_Select_Default_1) == 0x000040, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, CallFunc_IsValidClass_ReturnValue_2) == 0x000048, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::CallFunc_IsValidClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip, K2Node_Select_Default_2) == 0x000050, "Member 'Modular_Weapon_Grip_C_ExecuteUbergraph_Modular_Weapon_Grip::K2Node_Select_Default_2' has a wrong offset!");

// Function Modular_Weapon_Grip.Modular_Weapon_Grip_C.UserConstructionScript
// 0x0188 (0x0188 - 0x0000)
struct Modular_Weapon_Grip_C_UserConstructionScript final
{
public:
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_3;                      // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast_1;               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast_2;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast_3;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Weapon_Grip_C_UserConstructionScript) == 0x000008, "Wrong alignment on Modular_Weapon_Grip_C_UserConstructionScript");
static_assert(sizeof(Modular_Weapon_Grip_C_UserConstructionScript) == 0x000188, "Wrong size on Modular_Weapon_Grip_C_UserConstructionScript");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000020, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000038, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_Conv_DoubleToVector_ReturnValue_3) == 0x000050, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_Conv_DoubleToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000080, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000088, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_VLerp_ReturnValue) == 0x000090, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000A8, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_VLerp_ReturnValue_1) == 0x0000C0, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0000D8, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000E0, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0000F8, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_VLerp_ReturnValue_2) == 0x000100, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000118, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_VLerp_ReturnValue_3) == 0x000130, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_VLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000148, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x000160, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_VLerp_Alpha_ImplicitCast) == 0x000178, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_VLerp_Alpha_ImplicitCast_1) == 0x00017C, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_VLerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_VLerp_Alpha_ImplicitCast_2) == 0x000180, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_VLerp_Alpha_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Grip_C_UserConstructionScript, CallFunc_VLerp_Alpha_ImplicitCast_3) == 0x000184, "Member 'Modular_Weapon_Grip_C_UserConstructionScript::CallFunc_VLerp_Alpha_ImplicitCast_3' has a wrong offset!");

}

