#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_Weapon_Module

#include "Basic.hpp"


namespace SDK::Params
{

// Function Modular_Weapon_Module.Modular_Weapon_Module_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct Modular_Weapon_Module_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Random_OutItem;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Random_OutItem_1;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Weapon_Module_C_UserConstructionScript) == 0x000008, "Wrong alignment on Modular_Weapon_Module_C_UserConstructionScript");
static_assert(sizeof(Modular_Weapon_Module_C_UserConstructionScript) == 0x000038, "Wrong size on Modular_Weapon_Module_C_UserConstructionScript");
static_assert(offsetof(Modular_Weapon_Module_C_UserConstructionScript, CallFunc_IsValidClass_ReturnValue) == 0x000000, "Member 'Modular_Weapon_Module_C_UserConstructionScript::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Module_C_UserConstructionScript, CallFunc_IsValidClass_ReturnValue_1) == 0x000001, "Member 'Modular_Weapon_Module_C_UserConstructionScript::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Module_C_UserConstructionScript, Temp_bool_Variable) == 0x000002, "Member 'Modular_Weapon_Module_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Module_C_UserConstructionScript, Temp_bool_Variable_1) == 0x000003, "Member 'Modular_Weapon_Module_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Module_C_UserConstructionScript, CallFunc_Array_Random_OutItem) == 0x000008, "Member 'Modular_Weapon_Module_C_UserConstructionScript::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Module_C_UserConstructionScript, CallFunc_Array_Random_OutIndex) == 0x000010, "Member 'Modular_Weapon_Module_C_UserConstructionScript::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Module_C_UserConstructionScript, K2Node_Select_Default) == 0x000018, "Member 'Modular_Weapon_Module_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Module_C_UserConstructionScript, CallFunc_Array_Random_OutItem_1) == 0x000020, "Member 'Modular_Weapon_Module_C_UserConstructionScript::CallFunc_Array_Random_OutItem_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Module_C_UserConstructionScript, CallFunc_Array_Random_OutIndex_1) == 0x000028, "Member 'Modular_Weapon_Module_C_UserConstructionScript::CallFunc_Array_Random_OutIndex_1' has a wrong offset!");
static_assert(offsetof(Modular_Weapon_Module_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000030, "Member 'Modular_Weapon_Module_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");

}

