#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_Falchion_Blade_Master

#include "Basic.hpp"

#include "Enum_MaterialLayer_structs.hpp"
#include "Engine_structs.hpp"
#include "Modular_Weapon_Module_classes.hpp"
#include "Enum_MaterialQuality_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Modular_Falchion_Blade_Master.Modular_Falchion_Blade_Master_C
// 0x0030 (0x0530 - 0x0500)
class AModular_Falchion_Blade_Master_C : public AModular_Weapon_Module_C
{
public:
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Modular_Falchion_Blade_Master_C;    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Tip1;                                              // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Length_SB;                                         // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mass_Rate_SB;                                      // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Dism_Sharp;                                        // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Xx100;                                             // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Yx100;                                             // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Mesh;                                              // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Modular_Falchion_Blade_Master(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Modular_Falchion_Blade_Master_C">();
	}
	static class AModular_Falchion_Blade_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AModular_Falchion_Blade_Master_C>();
	}
};
static_assert(alignof(AModular_Falchion_Blade_Master_C) == 0x000008, "Wrong alignment on AModular_Falchion_Blade_Master_C");
static_assert(sizeof(AModular_Falchion_Blade_Master_C) == 0x000530, "Wrong size on AModular_Falchion_Blade_Master_C");
static_assert(offsetof(AModular_Falchion_Blade_Master_C, UberGraphFrame_Modular_Falchion_Blade_Master_C) == 0x000500, "Member 'AModular_Falchion_Blade_Master_C::UberGraphFrame_Modular_Falchion_Blade_Master_C' has a wrong offset!");
static_assert(offsetof(AModular_Falchion_Blade_Master_C, Tip1) == 0x000508, "Member 'AModular_Falchion_Blade_Master_C::Tip1' has a wrong offset!");
static_assert(offsetof(AModular_Falchion_Blade_Master_C, Length_SB) == 0x000510, "Member 'AModular_Falchion_Blade_Master_C::Length_SB' has a wrong offset!");
static_assert(offsetof(AModular_Falchion_Blade_Master_C, Mass_Rate_SB) == 0x000514, "Member 'AModular_Falchion_Blade_Master_C::Mass_Rate_SB' has a wrong offset!");
static_assert(offsetof(AModular_Falchion_Blade_Master_C, Dism_Sharp) == 0x000518, "Member 'AModular_Falchion_Blade_Master_C::Dism_Sharp' has a wrong offset!");
static_assert(offsetof(AModular_Falchion_Blade_Master_C, Xx100) == 0x00051C, "Member 'AModular_Falchion_Blade_Master_C::Xx100' has a wrong offset!");
static_assert(offsetof(AModular_Falchion_Blade_Master_C, Yx100) == 0x000520, "Member 'AModular_Falchion_Blade_Master_C::Yx100' has a wrong offset!");
static_assert(offsetof(AModular_Falchion_Blade_Master_C, Mesh) == 0x000528, "Member 'AModular_Falchion_Blade_Master_C::Mesh' has a wrong offset!");

}

