#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModularWeaponBP_Rondel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModularWeaponBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ModularWeaponBP_Rondel.ModularWeaponBP_Rondel_C
// 0x0040 (0x0B70 - 0x0B30)
class AModularWeaponBP_Rondel_C final : public AModularWeaponBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ModularWeaponBP_Rondel_C;           // 0x0B30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Tip2;                                              // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Base1_1;                                           // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Base1_0;                                           // 0x0B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1;                                              // 0x0B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow3;                                            // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Blade;                                             // 0x0B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_ModularWeaponBP_Rondel(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ModularWeaponBP_Rondel_C">();
	}
	static class AModularWeaponBP_Rondel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AModularWeaponBP_Rondel_C>();
	}
};
static_assert(alignof(AModularWeaponBP_Rondel_C) == 0x000008, "Wrong alignment on AModularWeaponBP_Rondel_C");
static_assert(sizeof(AModularWeaponBP_Rondel_C) == 0x000B70, "Wrong size on AModularWeaponBP_Rondel_C");
static_assert(offsetof(AModularWeaponBP_Rondel_C, UberGraphFrame_ModularWeaponBP_Rondel_C) == 0x000B30, "Member 'AModularWeaponBP_Rondel_C::UberGraphFrame_ModularWeaponBP_Rondel_C' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Rondel_C, Tip2) == 0x000B38, "Member 'AModularWeaponBP_Rondel_C::Tip2' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Rondel_C, Base1_1) == 0x000B40, "Member 'AModularWeaponBP_Rondel_C::Base1_1' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Rondel_C, Box) == 0x000B48, "Member 'AModularWeaponBP_Rondel_C::Box' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Rondel_C, Base1_0) == 0x000B50, "Member 'AModularWeaponBP_Rondel_C::Base1_0' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Rondel_C, Tip1) == 0x000B58, "Member 'AModularWeaponBP_Rondel_C::Tip1' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Rondel_C, Arrow3) == 0x000B60, "Member 'AModularWeaponBP_Rondel_C::Arrow3' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Rondel_C, Blade) == 0x000B68, "Member 'AModularWeaponBP_Rondel_C::Blade' has a wrong offset!");

}

