#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModularWeaponBP_Halberd_B

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModularWeaponBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ModularWeaponBP_Halberd_B.ModularWeaponBP_Halberd_B_C
// 0x0058 (0x0B88 - 0x0B30)
class AModularWeaponBP_Halberd_B_C final : public AModularWeaponBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ModularWeaponBP_Halberd_B_C;        // 0x0B30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Tip4;                                              // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip3;                                              // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip2;                                              // 0x0B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Base1_1;                                           // 0x0B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Base1_0;                                           // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1;                                              // 0x0B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow3;                                            // 0x0B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Blade;                                             // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Grip_0;                                            // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ModularWeaponBP_Axe_Blade_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__ModularWeaponBP_Axe_Grip_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_ModularWeaponBP_Halberd_B(int32 EntryPoint);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ModularWeaponBP_Halberd_B_C">();
	}
	static class AModularWeaponBP_Halberd_B_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AModularWeaponBP_Halberd_B_C>();
	}
};
static_assert(alignof(AModularWeaponBP_Halberd_B_C) == 0x000008, "Wrong alignment on AModularWeaponBP_Halberd_B_C");
static_assert(sizeof(AModularWeaponBP_Halberd_B_C) == 0x000B88, "Wrong size on AModularWeaponBP_Halberd_B_C");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, UberGraphFrame_ModularWeaponBP_Halberd_B_C) == 0x000B30, "Member 'AModularWeaponBP_Halberd_B_C::UberGraphFrame_ModularWeaponBP_Halberd_B_C' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, Tip4) == 0x000B38, "Member 'AModularWeaponBP_Halberd_B_C::Tip4' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, Tip3) == 0x000B40, "Member 'AModularWeaponBP_Halberd_B_C::Tip3' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, Tip2) == 0x000B48, "Member 'AModularWeaponBP_Halberd_B_C::Tip2' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, Base1_1) == 0x000B50, "Member 'AModularWeaponBP_Halberd_B_C::Base1_1' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, Box) == 0x000B58, "Member 'AModularWeaponBP_Halberd_B_C::Box' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, Base1_0) == 0x000B60, "Member 'AModularWeaponBP_Halberd_B_C::Base1_0' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, Tip1) == 0x000B68, "Member 'AModularWeaponBP_Halberd_B_C::Tip1' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, Arrow3) == 0x000B70, "Member 'AModularWeaponBP_Halberd_B_C::Arrow3' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, Blade) == 0x000B78, "Member 'AModularWeaponBP_Halberd_B_C::Blade' has a wrong offset!");
static_assert(offsetof(AModularWeaponBP_Halberd_B_C, Grip_0) == 0x000B80, "Member 'AModularWeaponBP_Halberd_B_C::Grip_0' has a wrong offset!");

}

