#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_Falchion_Blade_Master

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_MaterialQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_MaterialLayer_structs.hpp"


namespace SDK::Params
{

// Function Modular_Falchion_Blade_Master.Modular_Falchion_Blade_Master_C.ExecuteUbergraph_Modular_Falchion_Blade_Master
// 0x0070 (0x0070 - 0x0000)
struct Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master) == 0x000008, "Wrong alignment on Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master");
static_assert(sizeof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master) == 0x000070, "Wrong size on Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master, EntryPoint) == 0x000000, "Member 'Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000008, "Member 'Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000028, "Member 'Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000058, "Member 'Modular_Falchion_Blade_Master_C_ExecuteUbergraph_Modular_Falchion_Blade_Master::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");

// Function Modular_Falchion_Blade_Master.Modular_Falchion_Blade_Master_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Modular_Falchion_Blade_Master_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Falchion_Blade_Master_C_ReceiveTick) == 0x000004, "Wrong alignment on Modular_Falchion_Blade_Master_C_ReceiveTick");
static_assert(sizeof(Modular_Falchion_Blade_Master_C_ReceiveTick) == 0x000004, "Wrong size on Modular_Falchion_Blade_Master_C_ReceiveTick");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Modular_Falchion_Blade_Master_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Modular_Falchion_Blade_Master.Modular_Falchion_Blade_Master_C.UserConstructionScript
// 0x0380 (0x0380 - 0x0000)
struct Modular_Falchion_Blade_Master_C_UserConstructionScript final
{
public:
	Enum_MaterialQuality                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0098(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x01D8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue_1;       // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            K2Node_Select_Default;                             // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_2;                          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_9;      // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_10;     // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_11;     // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast_1; // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Falchion_Blade_Master_C_UserConstructionScript) == 0x000008, "Wrong alignment on Modular_Falchion_Blade_Master_C_UserConstructionScript");
static_assert(sizeof(Modular_Falchion_Blade_Master_C_UserConstructionScript) == 0x000380, "Wrong size on Modular_Falchion_Blade_Master_C_UserConstructionScript");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, Temp_byte_Variable_1) == 0x000001, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, Temp_byte_Variable_2) == 0x000002, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, Temp_byte_Variable_3) == 0x000003, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000010, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000028, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000030, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000038, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000040, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x000068, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000080, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000098, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000190, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000198, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x0001A0, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x0001A8, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x0001B0, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x0001B8, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0001D0, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0001D8, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_K2_GetComponentScale_ReturnValue_1) == 0x0002D0, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_K2_GetComponentScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, K2Node_Select_Default) == 0x0002E8, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x0002F0, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x0002F8, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x000300, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000308, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000310, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000318, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000320, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000328, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000330, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000338, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x000340, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000348, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000350, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_8) == 0x000358, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_9) == 0x000360, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_10) == 0x000368, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_11) == 0x000370, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast) == 0x000378, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Modular_Falchion_Blade_Master_C_UserConstructionScript, CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast_1) == 0x00037C, "Member 'Modular_Falchion_Blade_Master_C_UserConstructionScript::CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast_1' has a wrong offset!");

}

