#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_Sword_Guard_Master

#include "Basic.hpp"

#include "Enum_MaterialQuality_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_MaterialLayer_structs.hpp"


namespace SDK::Params
{

// Function Modular_Sword_Guard_Master.Modular_Sword_Guard_Master_C.ExecuteUbergraph_Modular_Sword_Guard_Master
// 0x0008 (0x0008 - 0x0000)
struct Modular_Sword_Guard_Master_C_ExecuteUbergraph_Modular_Sword_Guard_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Sword_Guard_Master_C_ExecuteUbergraph_Modular_Sword_Guard_Master) == 0x000004, "Wrong alignment on Modular_Sword_Guard_Master_C_ExecuteUbergraph_Modular_Sword_Guard_Master");
static_assert(sizeof(Modular_Sword_Guard_Master_C_ExecuteUbergraph_Modular_Sword_Guard_Master) == 0x000008, "Wrong size on Modular_Sword_Guard_Master_C_ExecuteUbergraph_Modular_Sword_Guard_Master");
static_assert(offsetof(Modular_Sword_Guard_Master_C_ExecuteUbergraph_Modular_Sword_Guard_Master, EntryPoint) == 0x000000, "Member 'Modular_Sword_Guard_Master_C_ExecuteUbergraph_Modular_Sword_Guard_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_ExecuteUbergraph_Modular_Sword_Guard_Master, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Modular_Sword_Guard_Master_C_ExecuteUbergraph_Modular_Sword_Guard_Master::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Modular_Sword_Guard_Master.Modular_Sword_Guard_Master_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Modular_Sword_Guard_Master_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Sword_Guard_Master_C_ReceiveTick) == 0x000004, "Wrong alignment on Modular_Sword_Guard_Master_C_ReceiveTick");
static_assert(sizeof(Modular_Sword_Guard_Master_C_ReceiveTick) == 0x000004, "Wrong size on Modular_Sword_Guard_Master_C_ReceiveTick");
static_assert(offsetof(Modular_Sword_Guard_Master_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Modular_Sword_Guard_Master_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Modular_Sword_Guard_Master.Modular_Sword_Guard_Master_C.UserConstructionScript
// 0x0130 (0x0130 - 0x0000)
struct Modular_Sword_Guard_Master_C_UserConstructionScript final
{
public:
	Enum_MaterialLayer                            Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_6;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_7;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_8;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_9;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_10;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_11;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_12;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_13;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_14;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_15;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialQuality                          Temp_byte_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_2;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_3;                              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_4;                              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_5;                              // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_6;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_7;                              // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            K2Node_Select_Default_2;                           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_Sword_Guard_Master_C_UserConstructionScript) == 0x000008, "Wrong alignment on Modular_Sword_Guard_Master_C_UserConstructionScript");
static_assert(sizeof(Modular_Sword_Guard_Master_C_UserConstructionScript) == 0x000130, "Wrong size on Modular_Sword_Guard_Master_C_UserConstructionScript");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_1) == 0x000010, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_2) == 0x000018, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_3) == 0x000020, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_4) == 0x000028, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_5) == 0x000030, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_6) == 0x000038, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_7) == 0x000040, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_8) == 0x000048, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_9) == 0x000050, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_10) == 0x000058, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_11) == 0x000060, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_12) == 0x000068, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_13) == 0x000070, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_14) == 0x000078, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_object_Variable_15) == 0x000080, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_byte_Variable_1) == 0x000088, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_int_Variable) == 0x00008C, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_int_Variable_1) == 0x000090, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_int_Variable_2) == 0x000094, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_byte_Variable_2) == 0x000098, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_byte_Variable_3) == 0x000099, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_byte_Variable_4) == 0x00009A, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_byte_Variable_5) == 0x00009B, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_byte_Variable_6) == 0x00009C, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, Temp_byte_Variable_7) == 0x00009D, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x0000A0, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, K2Node_Select_Default) == 0x0000B8, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000C0, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000C8, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, K2Node_Select_Default_1) == 0x0000CC, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, K2Node_Select_Default_2) == 0x0000D0, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000D1, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_K2_GetComponentScale_ReturnValue) == 0x0000D8, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x0000F0, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x0000F8, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000100, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000108, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000110, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000118, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000120, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Modular_Sword_Guard_Master_C_UserConstructionScript, CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast) == 0x000128, "Member 'Modular_Sword_Guard_Master_C_UserConstructionScript::CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast' has a wrong offset!");

}

