#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_MaceHead_Master

#include "Basic.hpp"

#include "Enum_MaterialQuality_structs.hpp"
#include "Enum_MaterialLayer_structs.hpp"


namespace SDK::Params
{

// Function Modular_MaceHead_Master.Modular_MaceHead_Master_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct Modular_MaceHead_Master_C_UserConstructionScript final
{
public:
	Enum_MaterialQuality                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_4;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_5;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_6;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_7;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_8;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            K2Node_Select_Default_1;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Modular_MaceHead_Master_C_UserConstructionScript) == 0x000004, "Wrong alignment on Modular_MaceHead_Master_C_UserConstructionScript");
static_assert(sizeof(Modular_MaceHead_Master_C_UserConstructionScript) == 0x000018, "Wrong size on Modular_MaceHead_Master_C_UserConstructionScript");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, Temp_byte_Variable_1) == 0x000001, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, Temp_byte_Variable_2) == 0x000002, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, Temp_int_Variable) == 0x000004, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, Temp_byte_Variable_3) == 0x000008, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, Temp_byte_Variable_4) == 0x000009, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, Temp_byte_Variable_5) == 0x00000A, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, Temp_byte_Variable_6) == 0x00000B, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, Temp_byte_Variable_7) == 0x00000C, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, Temp_byte_Variable_8) == 0x00000D, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000010, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, K2Node_Select_Default) == 0x000014, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Modular_MaceHead_Master_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000015, "Member 'Modular_MaceHead_Master_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");

}

