#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_PA_Guard_Master

#include "Basic.hpp"

#include "Modular_Weapon_Module_classes.hpp"
#include "Enum_MaterialLayer_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Modular_PA_Guard_Master.Modular_PA_Guard_Master_C
// 0x0010 (0x0510 - 0x0500)
class AModular_PA_Guard_Master_C : public AModular_Weapon_Module_C
{
public:
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Materian_Int_Min;                                  // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Materian_Int_Max;                                  // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Sub_Module;                                        // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Modular_PA_Guard_Master_C">();
	}
	static class AModular_PA_Guard_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AModular_PA_Guard_Master_C>();
	}
};
static_assert(alignof(AModular_PA_Guard_Master_C) == 0x000008, "Wrong alignment on AModular_PA_Guard_Master_C");
static_assert(sizeof(AModular_PA_Guard_Master_C) == 0x000510, "Wrong size on AModular_PA_Guard_Master_C");
static_assert(offsetof(AModular_PA_Guard_Master_C, Materian_Int_Min) == 0x0004FC, "Member 'AModular_PA_Guard_Master_C::Materian_Int_Min' has a wrong offset!");
static_assert(offsetof(AModular_PA_Guard_Master_C, Materian_Int_Max) == 0x000500, "Member 'AModular_PA_Guard_Master_C::Materian_Int_Max' has a wrong offset!");
static_assert(offsetof(AModular_PA_Guard_Master_C, Sub_Module) == 0x000508, "Member 'AModular_PA_Guard_Master_C::Sub_Module' has a wrong offset!");

}

