#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NaniteDisplacedMesh

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class NaniteDisplacedMesh.NaniteDisplacedMesh
// 0x0050 (0x0078 - 0x0028)
class UNaniteDisplacedMesh final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NaniteDisplacedMesh">();
	}
	static class UNaniteDisplacedMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNaniteDisplacedMesh>();
	}
};
static_assert(alignof(UNaniteDisplacedMesh) == 0x000008, "Wrong alignment on UNaniteDisplacedMesh");
static_assert(sizeof(UNaniteDisplacedMesh) == 0x000078, "Wrong size on UNaniteDisplacedMesh");

// Class NaniteDisplacedMesh.NaniteDisplacedMeshComponent
// 0x0000 (0x05E0 - 0x05E0)
class UNaniteDisplacedMeshComponent final : public UStaticMeshComponent
{
public:
	class UNaniteDisplacedMesh*                   DisplacedMesh;                                     // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NaniteDisplacedMeshComponent">();
	}
	static class UNaniteDisplacedMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNaniteDisplacedMeshComponent>();
	}
};
static_assert(alignof(UNaniteDisplacedMeshComponent) == 0x000010, "Wrong alignment on UNaniteDisplacedMeshComponent");
static_assert(sizeof(UNaniteDisplacedMeshComponent) == 0x0005E0, "Wrong size on UNaniteDisplacedMeshComponent");
static_assert(offsetof(UNaniteDisplacedMeshComponent, DisplacedMesh) == 0x0005D8, "Member 'UNaniteDisplacedMeshComponent::DisplacedMesh' has a wrong offset!");

}

