#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RunningBlood_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "VertexPaintDetectionPlugin_structs.hpp"


namespace SDK::Params
{

// Function RunningBlood_BP.RunningBlood_BP_C.ExecuteUbergraph_RunningBlood_BP
// 0x0D70 (0x0D70 - 0x0000)
struct RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition; // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal;  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue; // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPApplyColorsUsingVertexChannelSettings K2Node_MakeStruct_RVPDPApplyColorsUsingVertexChannelSettings; // 0x0100(0x00A8)(ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRVPDPApplyColorSettings               K2Node_MakeStruct_RVPDPApplyColorSettings;         // 0x01C0(0x02D0)(ContainsInstancedReference)
	struct FRVPDPAtLocationTasksSettings          K2Node_MakeStruct_RVPDPAtLocationTasksSettings;    // 0x0490(0x0060)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0540(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0550(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x0568(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0592(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0593(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0594(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_595[0x3];                                      // 0x0595(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D[0x3];                                      // 0x059D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AA[0x6];                                      // 0x05AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x05B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x05D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition_1; // 0x05E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal_1; // 0x0600(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName_1; // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance_1; // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue_1; // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0625(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_626[0x2];                                      // 0x0626(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0640(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody_1; // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue_1; // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x0678(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0690(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_AddComponent_ReturnValue;                 // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_701[0x3];                                      // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_5;    // 0x0710(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_2;            // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731[0x3];                                      // 0x0731(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0739(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73A[0x6];                                      // 0x073A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x074C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74D[0x3];                                      // 0x074D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0754(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_755[0x3];                                      // 0x0755(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x075C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75D[0x3];                                      // 0x075D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x0768(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0771(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_772[0x6];                                      // 0x0772(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0778(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0788(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWillie_BP_C*                           K2Node_DynamicCast_AsWillie_BP;                    // 0x0790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_2;           // 0x0799(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRVPDPMultiThreadSettings              K2Node_MakeStruct_RVPDPMultiThreadSettings;        // 0x079A(0x0001)(NoDestructor)
	uint8                                         Pad_79B[0x1];                                      // 0x079B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x07A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x07A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x07B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B2[0x2];                                      // 0x07B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x07B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRVPDPPaintAtLocationAreaOfEffectSettings K2Node_MakeStruct_RVPDPPaintAtLocationAreaOfEffectSettings; // 0x07D0(0x0048)()
	struct FRVPDPPaintAtLocationSettings          K2Node_MakeStruct_RVPDPPaintAtLocationSettings;    // 0x0818(0x0548)(ContainsInstancedReference)
	float                                         K2Node_MakeStruct_AreaOfEffectRangeEnd_ImplicitCast; // 0x0D60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP) == 0x000010, "Wrong alignment on RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP");
static_assert(sizeof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP) == 0x000D70, "Wrong size on RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, EntryPoint) == 0x000000, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000058, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition) == 0x000088, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal) == 0x0000A0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName) == 0x0000B8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance) == 0x0000C0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue) == 0x0000C4, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000C8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000E0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Length_ReturnValue_2) == 0x0000F8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPApplyColorsUsingVertexChannelSettings) == 0x000100, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPApplyColorsUsingVertexChannelSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001A8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPApplyColorSettings) == 0x0001C0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPApplyColorSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPAtLocationTasksSettings) == 0x000490, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPAtLocationTasksSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Greater_IntInt_ReturnValue) == 0x0004F0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Length_ReturnValue_3) == 0x0004F4, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0004F8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000500, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Array_Index_Variable) == 0x000518, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x000520, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x000538, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Get_Item) == 0x000540, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue) == 0x000548, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000550, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x000568, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Vector_Distance_ReturnValue) == 0x000580, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Dot_VectorVector_ReturnValue) == 0x000588, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000590, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000591, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_BooleanAND_ReturnValue) == 0x000592, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_RemoveItem_ReturnValue) == 0x000593, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_1) == 0x000594, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Array_Index_Variable_1) == 0x000598, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00059C, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Get_Item_1) == 0x0005A0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_2) == 0x0005A8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x0005A9, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x0005B0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_bool_True_if_break_was_hit_Variable) == 0x0005C8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0005D0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition_1) == 0x0005E8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_ClosestWorldPosition_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal_1) == 0x000600, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_Normal_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName_1) == 0x000618, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_BoneName_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance_1) == 0x000620, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_Distance_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue_1) == 0x000624, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetClosestPointOnPhysicsAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000625, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000628, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000640, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetClosestPointOnCollision_OutPointOnBody_1) == 0x000658, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetClosestPointOnCollision_OutPointOnBody_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetClosestPointOnCollision_ReturnValue_1) == 0x000670, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetClosestPointOnCollision_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x000678, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000690, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_AddComponent_ReturnValue) == 0x0006F0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Vector_Distance_ReturnValue_1) == 0x0006F8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000700, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_AddUnique_ReturnValue) == 0x000704, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000708, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_K2_GetComponentLocation_ReturnValue_5) == 0x000710, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_K2_GetComponentLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Vector_Distance_ReturnValue_2) == 0x000728, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Vector_Distance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000730, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Variable) == 0x000734, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_3) == 0x000738, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_4) == 0x000739, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000740, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Loop_Counter_Variable_1) == 0x000748, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x00074C, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000750, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_BooleanAND_ReturnValue_1) == 0x000754, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Subtract_IntInt_ReturnValue) == 0x000758, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_5) == 0x00075C, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Array_Index_Variable_2) == 0x000760, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Get_Item_2) == 0x000768, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_6) == 0x000770, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_Contains_ReturnValue) == 0x000771, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetOwner_ReturnValue) == 0x000778, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_IsValid_ReturnValue_7) == 0x000780, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetOwner_ReturnValue_1) == 0x000788, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_DynamicCast_AsWillie_BP) == 0x000790, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_DynamicCast_AsWillie_BP' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_DynamicCast_bSuccess) == 0x000798, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Array_RemoveItem_ReturnValue_2) == 0x000799, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Array_RemoveItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPMultiThreadSettings) == 0x00079A, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPMultiThreadSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, Temp_int_Loop_Counter_Variable_2) == 0x00079C, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_GetGameInstance_ReturnValue) == 0x0007A0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_DynamicCast_AsGI_Settings) == 0x0007A8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_DynamicCast_bSuccess_1) == 0x0007B0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x0007B1, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x0007B4, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x0007B8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0007C0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0007C8, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPPaintAtLocationAreaOfEffectSettings) == 0x0007D0, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPPaintAtLocationAreaOfEffectSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_RVPDPPaintAtLocationSettings) == 0x000818, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_RVPDPPaintAtLocationSettings' has a wrong offset!");
static_assert(offsetof(RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP, K2Node_MakeStruct_AreaOfEffectRangeEnd_ImplicitCast) == 0x000D60, "Member 'RunningBlood_BP_C_ExecuteUbergraph_RunningBlood_BP::K2Node_MakeStruct_AreaOfEffectRangeEnd_ImplicitCast' has a wrong offset!");

// Function RunningBlood_BP.RunningBlood_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct RunningBlood_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RunningBlood_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on RunningBlood_BP_C_ReceiveTick");
static_assert(sizeof(RunningBlood_BP_C_ReceiveTick) == 0x000004, "Wrong size on RunningBlood_BP_C_ReceiveTick");
static_assert(offsetof(RunningBlood_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'RunningBlood_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function RunningBlood_BP.RunningBlood_BP_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct RunningBlood_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RunningBlood_BP_C_UserConstructionScript) == 0x000001, "Wrong alignment on RunningBlood_BP_C_UserConstructionScript");
static_assert(sizeof(RunningBlood_BP_C_UserConstructionScript) == 0x000001, "Wrong size on RunningBlood_BP_C_UserConstructionScript");
static_assert(offsetof(RunningBlood_BP_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'RunningBlood_BP_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

