#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RVPDPRapidJson

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct RVPDPRapidJson.RVPDPRapidJsonCustomStructSerialization
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FRVPDPRapidJsonCustomStructSerialization
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRVPDPRapidJsonCustomStructSerialization) == 0x000008, "Wrong alignment on FRVPDPRapidJsonCustomStructSerialization");
static_assert(sizeof(FRVPDPRapidJsonCustomStructSerialization) == 0x000008, "Wrong size on FRVPDPRapidJsonCustomStructSerialization");

// ScriptStruct RVPDPRapidJson.RVPDPRapidJsonMyCustomStructSerializationExample
// 0x0018 (0x0020 - 0x0008)
struct FRVPDPRapidJsonMyCustomStructSerializationExample final : public FRVPDPRapidJsonCustomStructSerialization
{
public:
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Age;                                               // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRVPDPRapidJsonMyCustomStructSerializationExample) == 0x000008, "Wrong alignment on FRVPDPRapidJsonMyCustomStructSerializationExample");
static_assert(sizeof(FRVPDPRapidJsonMyCustomStructSerializationExample) == 0x000020, "Wrong size on FRVPDPRapidJsonMyCustomStructSerializationExample");
static_assert(offsetof(FRVPDPRapidJsonMyCustomStructSerializationExample, Name) == 0x000008, "Member 'FRVPDPRapidJsonMyCustomStructSerializationExample::Name' has a wrong offset!");
static_assert(offsetof(FRVPDPRapidJsonMyCustomStructSerializationExample, Age) == 0x000018, "Member 'FRVPDPRapidJsonMyCustomStructSerializationExample::Age' has a wrong offset!");

}

