#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_InputIcons

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_InputIcons.S_InputIcons
// 0x0020 (0x0020 - 0x0000)
struct FS_InputIcons final
{
public:
	class UTexture2D*                             Index0Keyboard_13_4AF1554F40D9FAF05214B7A6A7E39D76; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Index1PS_14_BB97E52D4CC9FACC72BB219D87315EDE;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Index2XB_15_95DF82BF47C249D4F1F7829212817E3C;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Index3Other_16_859EF95D4EDAF52402A7158463A31EFF;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_InputIcons) == 0x000008, "Wrong alignment on FS_InputIcons");
static_assert(sizeof(FS_InputIcons) == 0x000020, "Wrong size on FS_InputIcons");
static_assert(offsetof(FS_InputIcons, Index0Keyboard_13_4AF1554F40D9FAF05214B7A6A7E39D76) == 0x000000, "Member 'FS_InputIcons::Index0Keyboard_13_4AF1554F40D9FAF05214B7A6A7E39D76' has a wrong offset!");
static_assert(offsetof(FS_InputIcons, Index1PS_14_BB97E52D4CC9FACC72BB219D87315EDE) == 0x000008, "Member 'FS_InputIcons::Index1PS_14_BB97E52D4CC9FACC72BB219D87315EDE' has a wrong offset!");
static_assert(offsetof(FS_InputIcons, Index2XB_15_95DF82BF47C249D4F1F7829212817E3C) == 0x000010, "Member 'FS_InputIcons::Index2XB_15_95DF82BF47C249D4F1F7829212817E3C' has a wrong offset!");
static_assert(offsetof(FS_InputIcons, Index3Other_16_859EF95D4EDAF52402A7158463A31EFF) == 0x000018, "Member 'FS_InputIcons::Index3Other_16_859EF95D4EDAF52402A7158463A31EFF' has a wrong offset!");

}

