#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Logos

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Logos.S_Logos
// 0x0028 (0x0028 - 0x0000)
struct FS_Logos final
{
public:
	class FText                                   Title_21_DD173AAF45968A633BBE06A3D3C47922;         // 0x0000(0x0010)(Edit, BlueprintVisible)
	class UTexture2D*                             Image_19_9C96722A4CBCAE19C9C1189C517B3A7F;         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size_20_1395B5E0448F1D5F61E722B131807AD7;          // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Logos) == 0x000008, "Wrong alignment on FS_Logos");
static_assert(sizeof(FS_Logos) == 0x000028, "Wrong size on FS_Logos");
static_assert(offsetof(FS_Logos, Title_21_DD173AAF45968A633BBE06A3D3C47922) == 0x000000, "Member 'FS_Logos::Title_21_DD173AAF45968A633BBE06A3D3C47922' has a wrong offset!");
static_assert(offsetof(FS_Logos, Image_19_9C96722A4CBCAE19C9C1189C517B3A7F) == 0x000010, "Member 'FS_Logos::Image_19_9C96722A4CBCAE19C9C1189C517B3A7F' has a wrong offset!");
static_assert(offsetof(FS_Logos, Size_20_1395B5E0448F1D5F61E722B131807AD7) == 0x000018, "Member 'FS_Logos::Size_20_1395B5E0448F1D5F61E722B131807AD7' has a wrong offset!");

}

