#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_Equipment

#include "Basic.hpp"

#include "Str_ArmorElements_structs.hpp"
#include "Engine_classes.hpp"
#include "Str_Loadout_Equipment_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SG_Equipment.SG_Equipment_C
// 0x08E0 (0x0908 - 0x0028)
class USG_Equipment_C final : public USaveGame
{
public:
	struct FStr_ArmorElements                     Armor_Colors;                                      // 0x0028(0x0038)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FStr_Loadout_Equipment                 Equipment_Struct;                                  // 0x0060(0x08A0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Rank;                                              // 0x0900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Team;                                              // 0x0904(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SG_Equipment_C">();
	}
	static class USG_Equipment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USG_Equipment_C>();
	}
};
static_assert(alignof(USG_Equipment_C) == 0x000008, "Wrong alignment on USG_Equipment_C");
static_assert(sizeof(USG_Equipment_C) == 0x000908, "Wrong size on USG_Equipment_C");
static_assert(offsetof(USG_Equipment_C, Armor_Colors) == 0x000028, "Member 'USG_Equipment_C::Armor_Colors' has a wrong offset!");
static_assert(offsetof(USG_Equipment_C, Equipment_Struct) == 0x000060, "Member 'USG_Equipment_C::Equipment_Struct' has a wrong offset!");
static_assert(offsetof(USG_Equipment_C, Rank) == 0x000900, "Member 'USG_Equipment_C::Rank' has a wrong offset!");
static_assert(offsetof(USG_Equipment_C, Team) == 0x000904, "Member 'USG_Equipment_C::Team' has a wrong offset!");

}

