#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_Settings

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SG_Settings.SG_Settings_C
// 0x0070 (0x0098 - 0x0028)
class USG_Settings_C final : public USaveGame
{
public:
	double                                        Sound_Volume;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Music_Volume;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mouse_Sensitivity;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FOV;                                               // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HUD_Opacity;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blood_Rate;                                        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Gore_Rate;                                         // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lock_On_Strength;                                  // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Damage_to_Player;                                  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Damage_to_NPC;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Bone_Snapping;                                     // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Invert_Mouse;                                      // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Center_Crosshair;                                  // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Voice_Volume;                                      // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Tutorial;                                          // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SG_Settings_C">();
	}
	static class USG_Settings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USG_Settings_C>();
	}
};
static_assert(alignof(USG_Settings_C) == 0x000008, "Wrong alignment on USG_Settings_C");
static_assert(sizeof(USG_Settings_C) == 0x000098, "Wrong size on USG_Settings_C");
static_assert(offsetof(USG_Settings_C, Sound_Volume) == 0x000028, "Member 'USG_Settings_C::Sound_Volume' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Music_Volume) == 0x000030, "Member 'USG_Settings_C::Music_Volume' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Mouse_Sensitivity) == 0x000038, "Member 'USG_Settings_C::Mouse_Sensitivity' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, FOV) == 0x000040, "Member 'USG_Settings_C::FOV' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, HUD_Opacity) == 0x000048, "Member 'USG_Settings_C::HUD_Opacity' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Blood_Rate) == 0x000050, "Member 'USG_Settings_C::Blood_Rate' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Gore_Rate) == 0x000058, "Member 'USG_Settings_C::Gore_Rate' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Lock_On_Strength) == 0x000060, "Member 'USG_Settings_C::Lock_On_Strength' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Damage_to_Player) == 0x000068, "Member 'USG_Settings_C::Damage_to_Player' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Damage_to_NPC) == 0x000070, "Member 'USG_Settings_C::Damage_to_NPC' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Bone_Snapping) == 0x000078, "Member 'USG_Settings_C::Bone_Snapping' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Invert_Mouse) == 0x000080, "Member 'USG_Settings_C::Invert_Mouse' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Center_Crosshair) == 0x000081, "Member 'USG_Settings_C::Center_Crosshair' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Voice_Volume) == 0x000088, "Member 'USG_Settings_C::Voice_Volume' has a wrong offset!");
static_assert(offsetof(USG_Settings_C, Tutorial) == 0x000090, "Member 'USG_Settings_C::Tutorial' has a wrong offset!");

}

