#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shield_BossGrip

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Shield_BossGrip.Shield_BossGrip_C.BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'Shield_BossGrip_C_BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function Shield_BossGrip.Shield_BossGrip_C.ExecuteUbergraph_Shield_BossGrip
// 0x0130 (0x0130 - 0x0000)
struct Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0038(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip) == 0x000008, "Wrong alignment on Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip");
static_assert(sizeof(Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip) == 0x000130, "Wrong size on Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip");
static_assert(offsetof(Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip, EntryPoint) == 0x000000, "Member 'Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip::EntryPoint' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip, K2Node_ComponentBoundEvent_HitComponent) == 0x000008, "Member 'Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000020, "Member 'Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip, K2Node_ComponentBoundEvent_Hit) == 0x000038, "Member 'Shield_BossGrip_C_ExecuteUbergraph_Shield_BossGrip::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");

// Function Shield_BossGrip.Shield_BossGrip_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct Shield_BossGrip_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shield_BossGrip_C_UserConstructionScript) == 0x000008, "Wrong alignment on Shield_BossGrip_C_UserConstructionScript");
static_assert(sizeof(Shield_BossGrip_C_UserConstructionScript) == 0x000050, "Wrong size on Shield_BossGrip_C_UserConstructionScript");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'Shield_BossGrip_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'Shield_BossGrip_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, Temp_object_Variable_1) == 0x000010, "Member 'Shield_BossGrip_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, Temp_object_Variable_2) == 0x000018, "Member 'Shield_BossGrip_C_UserConstructionScript::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, Temp_object_Variable_3) == 0x000020, "Member 'Shield_BossGrip_C_UserConstructionScript::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'Shield_BossGrip_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, CallFunc_Clamp_ReturnValue) == 0x00002C, "Member 'Shield_BossGrip_C_UserConstructionScript::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, K2Node_Select_Default) == 0x000030, "Member 'Shield_BossGrip_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000038, "Member 'Shield_BossGrip_C_UserConstructionScript::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, CallFunc_IsValidClass_ReturnValue) == 0x000039, "Member 'Shield_BossGrip_C_UserConstructionScript::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue) == 0x00003C, "Member 'Shield_BossGrip_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000040, "Member 'Shield_BossGrip_C_UserConstructionScript::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, CallFunc_SelectInt_ReturnValue) == 0x000044, "Member 'Shield_BossGrip_C_UserConstructionScript::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shield_BossGrip_C_UserConstructionScript, CallFunc_SelectInt_ReturnValue_1) == 0x000048, "Member 'Shield_BossGrip_C_UserConstructionScript::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");

}

