#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_WeaponParts

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_Weapon_Material_Type_structs.hpp"
#include "Enum_MaterialLayer_structs.hpp"


namespace SDK
{

// UserDefinedStruct Str_WeaponParts.Str_WeaponParts
// 0x0130 (0x0130 - 0x0000)
struct FStr_WeaponParts final
{
public:
	class UClass*                                 WeaponBPClass_51_5C40F9BE43F7897FB12AACA75C2AD066; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            GripMesh_39_EDA3307B485303C5BF981B82D8462D0A;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GripModule_38_15B14C3F4E9701389A9B35A3B0909867;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HeadModule_19_B043442745EED9AD1BE7929F0A06DB8F;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GuardModule_21_774015784EB0300D2671C894D57ED144;   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PommelModule_22_4F6D0ABC4AA88CF780EE1C9649F96984;  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HeadSize_23_5DF30AE0493E534BD92D5B95E31E13CA;      // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GuardSize_24_7EB9BB3F4B7B54DD51CE529FEEA9A98D;     // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PommelPommelSize_26_5B37388746A83FCB7A7833891C1C5524; // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HeadSubModule1_28_EA08538346D6DADCE01E8B8B7B50A9A0; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HeadSubModule2_29_491313E24CE70DD60B5A6D88ED4B5980; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<Enum_Weapon_Material_Type, Enum_MaterialLayer> MemberVar_40_43_0B501E224AC2292FC03A999C237C2C81;  // 0x0088(0x0050)(Edit, BlueprintVisible)
	TMap<Enum_Weapon_Material_Type, struct FLinearColor> MemberVar_44_45_FF627FBE4FE882E7D295BFA0BB6716C0;  // 0x00D8(0x0050)(Edit, BlueprintVisible)
	int32                                         COAInt_63_593665BE4EF020F95F7D1A92564C1239;        // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStr_WeaponParts) == 0x000008, "Wrong alignment on FStr_WeaponParts");
static_assert(sizeof(FStr_WeaponParts) == 0x000130, "Wrong size on FStr_WeaponParts");
static_assert(offsetof(FStr_WeaponParts, WeaponBPClass_51_5C40F9BE43F7897FB12AACA75C2AD066) == 0x000000, "Member 'FStr_WeaponParts::WeaponBPClass_51_5C40F9BE43F7897FB12AACA75C2AD066' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, GripMesh_39_EDA3307B485303C5BF981B82D8462D0A) == 0x000008, "Member 'FStr_WeaponParts::GripMesh_39_EDA3307B485303C5BF981B82D8462D0A' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, GripModule_38_15B14C3F4E9701389A9B35A3B0909867) == 0x000010, "Member 'FStr_WeaponParts::GripModule_38_15B14C3F4E9701389A9B35A3B0909867' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, HeadModule_19_B043442745EED9AD1BE7929F0A06DB8F) == 0x000018, "Member 'FStr_WeaponParts::HeadModule_19_B043442745EED9AD1BE7929F0A06DB8F' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, GuardModule_21_774015784EB0300D2671C894D57ED144) == 0x000020, "Member 'FStr_WeaponParts::GuardModule_21_774015784EB0300D2671C894D57ED144' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, PommelModule_22_4F6D0ABC4AA88CF780EE1C9649F96984) == 0x000028, "Member 'FStr_WeaponParts::PommelModule_22_4F6D0ABC4AA88CF780EE1C9649F96984' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, HeadSize_23_5DF30AE0493E534BD92D5B95E31E13CA) == 0x000030, "Member 'FStr_WeaponParts::HeadSize_23_5DF30AE0493E534BD92D5B95E31E13CA' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, GuardSize_24_7EB9BB3F4B7B54DD51CE529FEEA9A98D) == 0x000048, "Member 'FStr_WeaponParts::GuardSize_24_7EB9BB3F4B7B54DD51CE529FEEA9A98D' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, PommelPommelSize_26_5B37388746A83FCB7A7833891C1C5524) == 0x000060, "Member 'FStr_WeaponParts::PommelPommelSize_26_5B37388746A83FCB7A7833891C1C5524' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, HeadSubModule1_28_EA08538346D6DADCE01E8B8B7B50A9A0) == 0x000078, "Member 'FStr_WeaponParts::HeadSubModule1_28_EA08538346D6DADCE01E8B8B7B50A9A0' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, HeadSubModule2_29_491313E24CE70DD60B5A6D88ED4B5980) == 0x000080, "Member 'FStr_WeaponParts::HeadSubModule2_29_491313E24CE70DD60B5A6D88ED4B5980' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, MemberVar_40_43_0B501E224AC2292FC03A999C237C2C81) == 0x000088, "Member 'FStr_WeaponParts::MemberVar_40_43_0B501E224AC2292FC03A999C237C2C81' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, MemberVar_44_45_FF627FBE4FE882E7D295BFA0BB6716C0) == 0x0000D8, "Member 'FStr_WeaponParts::MemberVar_44_45_FF627FBE4FE882E7D295BFA0BB6716C0' has a wrong offset!");
static_assert(offsetof(FStr_WeaponParts, COAInt_63_593665BE4EF020F95F7D1A92564C1239) == 0x000128, "Member 'FStr_WeaponParts::COAInt_63_593665BE4EF020F95F7D1A92564C1239' has a wrong offset!");

}

