#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_Equipment_Loadout_Old

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Str_Equipment_Loadout_Old.Str_Equipment_Loadout_Old
// 0x0150 (0x0150 - 0x0000)
struct FStr_Equipment_Loadout_Old final
{
public:
	TArray<class UClass*>                         Head_20_FB19E1214F4EB25A403766B8FF8AB28D;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Neck_28_96DE6E32498CA37FCCB04293270A4762;          // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Neck2_74_57AB7D5541FDC4883E2EFB9DD5E7A6E3;         // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Body_22_C8E68CEE47140F7784F93C9B987A82A9;          // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Body2_18_D2B18FC44B336F36B2D1D89EC3F60830;         // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Shoulders_30_5933CC314E176318D1ADA6BAE4F30D46;     // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Arms_32_DF7B42C543B30B2A9815968E7717BC65;          // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Hands_34_4D03F5A44A7B905A714436BB3878D814;         // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Waist_76_AC2461EF4924F15685243587E2C31407;         // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Legs_36_F77EE1BC4CA24592FFD6E896C9DA892A;          // 0x0090(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Legs2_38_6468D6F84A6CF2747DA1ECBB73509D59;         // 0x00A0(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Legs3_80_41277E3A496A514BBD1AA18A5C0DCC89;         // 0x00B0(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Feet_40_05E49A2E4E8A25588867E480AA83EF2B;          // 0x00C0(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         OneHanded_54_B936F35341395251F6EA4C91042FAC9A;     // 0x00D0(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         TwoHanded_51_D3FD5CD5403802CFFD088EAE6C7C8296;     // 0x00E0(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Shield_53_D9D29C3E4970BAE7B741C3BA0A0A51F1;        // 0x00F0(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         SlotR1_60_5696A755439F640049AE4CB63E26BD0B;        // 0x0100(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         SlotR2_62_ACC9AD4A407F6D47DA3F339B2637E1DA;        // 0x0110(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         SlotBack_64_69AF76444E064F27ABA1D1BC3E083AD3;      // 0x0120(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         SlotL1_66_7FDF9CE14664EAF0120DE9BF3E9FADE0;        // 0x0130(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         SlotL2_68_06F076E247B54D0D9942B383323C1968;        // 0x0140(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FStr_Equipment_Loadout_Old) == 0x000008, "Wrong alignment on FStr_Equipment_Loadout_Old");
static_assert(sizeof(FStr_Equipment_Loadout_Old) == 0x000150, "Wrong size on FStr_Equipment_Loadout_Old");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Head_20_FB19E1214F4EB25A403766B8FF8AB28D) == 0x000000, "Member 'FStr_Equipment_Loadout_Old::Head_20_FB19E1214F4EB25A403766B8FF8AB28D' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Neck_28_96DE6E32498CA37FCCB04293270A4762) == 0x000010, "Member 'FStr_Equipment_Loadout_Old::Neck_28_96DE6E32498CA37FCCB04293270A4762' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Neck2_74_57AB7D5541FDC4883E2EFB9DD5E7A6E3) == 0x000020, "Member 'FStr_Equipment_Loadout_Old::Neck2_74_57AB7D5541FDC4883E2EFB9DD5E7A6E3' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Body_22_C8E68CEE47140F7784F93C9B987A82A9) == 0x000030, "Member 'FStr_Equipment_Loadout_Old::Body_22_C8E68CEE47140F7784F93C9B987A82A9' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Body2_18_D2B18FC44B336F36B2D1D89EC3F60830) == 0x000040, "Member 'FStr_Equipment_Loadout_Old::Body2_18_D2B18FC44B336F36B2D1D89EC3F60830' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Shoulders_30_5933CC314E176318D1ADA6BAE4F30D46) == 0x000050, "Member 'FStr_Equipment_Loadout_Old::Shoulders_30_5933CC314E176318D1ADA6BAE4F30D46' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Arms_32_DF7B42C543B30B2A9815968E7717BC65) == 0x000060, "Member 'FStr_Equipment_Loadout_Old::Arms_32_DF7B42C543B30B2A9815968E7717BC65' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Hands_34_4D03F5A44A7B905A714436BB3878D814) == 0x000070, "Member 'FStr_Equipment_Loadout_Old::Hands_34_4D03F5A44A7B905A714436BB3878D814' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Waist_76_AC2461EF4924F15685243587E2C31407) == 0x000080, "Member 'FStr_Equipment_Loadout_Old::Waist_76_AC2461EF4924F15685243587E2C31407' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Legs_36_F77EE1BC4CA24592FFD6E896C9DA892A) == 0x000090, "Member 'FStr_Equipment_Loadout_Old::Legs_36_F77EE1BC4CA24592FFD6E896C9DA892A' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Legs2_38_6468D6F84A6CF2747DA1ECBB73509D59) == 0x0000A0, "Member 'FStr_Equipment_Loadout_Old::Legs2_38_6468D6F84A6CF2747DA1ECBB73509D59' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Legs3_80_41277E3A496A514BBD1AA18A5C0DCC89) == 0x0000B0, "Member 'FStr_Equipment_Loadout_Old::Legs3_80_41277E3A496A514BBD1AA18A5C0DCC89' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Feet_40_05E49A2E4E8A25588867E480AA83EF2B) == 0x0000C0, "Member 'FStr_Equipment_Loadout_Old::Feet_40_05E49A2E4E8A25588867E480AA83EF2B' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, OneHanded_54_B936F35341395251F6EA4C91042FAC9A) == 0x0000D0, "Member 'FStr_Equipment_Loadout_Old::OneHanded_54_B936F35341395251F6EA4C91042FAC9A' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, TwoHanded_51_D3FD5CD5403802CFFD088EAE6C7C8296) == 0x0000E0, "Member 'FStr_Equipment_Loadout_Old::TwoHanded_51_D3FD5CD5403802CFFD088EAE6C7C8296' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, Shield_53_D9D29C3E4970BAE7B741C3BA0A0A51F1) == 0x0000F0, "Member 'FStr_Equipment_Loadout_Old::Shield_53_D9D29C3E4970BAE7B741C3BA0A0A51F1' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, SlotR1_60_5696A755439F640049AE4CB63E26BD0B) == 0x000100, "Member 'FStr_Equipment_Loadout_Old::SlotR1_60_5696A755439F640049AE4CB63E26BD0B' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, SlotR2_62_ACC9AD4A407F6D47DA3F339B2637E1DA) == 0x000110, "Member 'FStr_Equipment_Loadout_Old::SlotR2_62_ACC9AD4A407F6D47DA3F339B2637E1DA' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, SlotBack_64_69AF76444E064F27ABA1D1BC3E083AD3) == 0x000120, "Member 'FStr_Equipment_Loadout_Old::SlotBack_64_69AF76444E064F27ABA1D1BC3E083AD3' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, SlotL1_66_7FDF9CE14664EAF0120DE9BF3E9FADE0) == 0x000130, "Member 'FStr_Equipment_Loadout_Old::SlotL1_66_7FDF9CE14664EAF0120DE9BF3E9FADE0' has a wrong offset!");
static_assert(offsetof(FStr_Equipment_Loadout_Old, SlotL2_68_06F076E247B54D0D9942B383323C1968) == 0x000140, "Member 'FStr_Equipment_Loadout_Old::SlotL2_68_06F076E247B54D0D9942B383323C1968' has a wrong offset!");

}

