#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Dismember

#include "Basic.hpp"

#include "BodyPart_Enum_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Dismember.Struct_Dismember
// 0x0028 (0x0028 - 0x0000)
struct FStruct_Dismember final
{
public:
	class FName                                   BoneName_15_E6BBE8BF496F92632CC1D9B465B320CD;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicsAsset*                          PhysicAsset_9_D46C4A7745BB891833BDC0B03CC3F961;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            GoreUpper_10_C64EBD984CE6DF205EE078B65B3F5391;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            GoreMid_11_958CFA7C417959F19A5D99ADD621D891;       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBodyPart_Enum                                BodyPart_14_C666BC104966A294AA4850B1E62C7F9B;      // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DismembermentLevel_19_1326F3104643D2D1A00948841A1A32BF; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_Dismember) == 0x000008, "Wrong alignment on FStruct_Dismember");
static_assert(sizeof(FStruct_Dismember) == 0x000028, "Wrong size on FStruct_Dismember");
static_assert(offsetof(FStruct_Dismember, BoneName_15_E6BBE8BF496F92632CC1D9B465B320CD) == 0x000000, "Member 'FStruct_Dismember::BoneName_15_E6BBE8BF496F92632CC1D9B465B320CD' has a wrong offset!");
static_assert(offsetof(FStruct_Dismember, PhysicAsset_9_D46C4A7745BB891833BDC0B03CC3F961) == 0x000008, "Member 'FStruct_Dismember::PhysicAsset_9_D46C4A7745BB891833BDC0B03CC3F961' has a wrong offset!");
static_assert(offsetof(FStruct_Dismember, GoreUpper_10_C64EBD984CE6DF205EE078B65B3F5391) == 0x000010, "Member 'FStruct_Dismember::GoreUpper_10_C64EBD984CE6DF205EE078B65B3F5391' has a wrong offset!");
static_assert(offsetof(FStruct_Dismember, GoreMid_11_958CFA7C417959F19A5D99ADD621D891) == 0x000018, "Member 'FStruct_Dismember::GoreMid_11_958CFA7C417959F19A5D99ADD621D891' has a wrong offset!");
static_assert(offsetof(FStruct_Dismember, BodyPart_14_C666BC104966A294AA4850B1E62C7F9B) == 0x000020, "Member 'FStruct_Dismember::BodyPart_14_C666BC104966A294AA4850B1E62C7F9B' has a wrong offset!");
static_assert(offsetof(FStruct_Dismember, DismembermentLevel_19_1326F3104643D2D1A00948841A1A32BF) == 0x000024, "Member 'FStruct_Dismember::DismembermentLevel_19_1326F3104643D2D1A00948841A1A32BF' has a wrong offset!");

}

