#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Attention_NoGore1

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Attention_NoGore1.UI_Attention_NoGore1_C.ExecuteUbergraph_UI_Attention_NoGore1
// 0x00F0 (0x00F0 - 0x0000)
struct UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_MainMenuSNF_C*                      CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         K2Node_DynamicCast_AsSG_Settings;                  // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         CallFunc_CreateSaveGameObject_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOverallScalabilityLevel_ReturnValue;   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1) == 0x000008, "Wrong alignment on UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1");
static_assert(sizeof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1) == 0x0000F0, "Wrong size on UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, EntryPoint) == 0x000000, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, Temp_int_Variable) == 0x000004, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, Temp_real_Variable) == 0x000008, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, Temp_real_Variable_1) == 0x000010, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, Temp_real_Variable_2) == 0x000018, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, Temp_int_Variable_1) == 0x000020, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, Temp_real_Variable_3) == 0x000028, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, Temp_real_Variable_4) == 0x000030, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, Temp_real_Variable_5) == 0x000038, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, Temp_bool_Has_Been_Initd_Variable) == 0x000044, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, Temp_bool_IsClosed_Variable) == 0x000045, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_GetPlayerController_ReturnValue_1) == 0x000050, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_Create_ReturnValue) == 0x000058, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_GetPlayerController_ReturnValue_2) == 0x000068, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, K2Node_Select_Default) == 0x000070, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, K2Node_Select_Default_1) == 0x000078, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_GetGameInstance_ReturnValue) == 0x000080, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000088, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, K2Node_DynamicCast_AsGI_Settings) == 0x000090, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, K2Node_DynamicCast_AsSG_Settings) == 0x0000A0, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::K2Node_DynamicCast_AsSG_Settings' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_DoesSaveGameExist_ReturnValue) == 0x0000A9, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_CreateSaveGameObject_ReturnValue) == 0x0000B0, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_SetGamePaused_ReturnValue) == 0x0000B8, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_GetGameUserSettings_ReturnValue) == 0x0000C0, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_SetGamePaused_ReturnValue_1) == 0x0000C8, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_GetOverallScalabilityLevel_ReturnValue) == 0x0000CC, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_GetOverallScalabilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x0000D0, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_IsGamePaused_ReturnValue) == 0x0000D8, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_IsGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1, CallFunc_Conv_BoolToString_ReturnValue) == 0x0000E0, "Member 'UI_Attention_NoGore1_C_ExecuteUbergraph_UI_Attention_NoGore1::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");

// Function UI_Attention_NoGore1.UI_Attention_NoGore1_C.GetText
// 0x0068 (0x0068 - 0x0000)
struct UI_Attention_NoGore1_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0048(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0010)()
};
static_assert(alignof(UI_Attention_NoGore1_C_GetText) == 0x000008, "Wrong alignment on UI_Attention_NoGore1_C_GetText");
static_assert(sizeof(UI_Attention_NoGore1_C_GetText) == 0x000068, "Wrong size on UI_Attention_NoGore1_C_GetText");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText, ReturnValue) == 0x000000, "Member 'UI_Attention_NoGore1_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText, Temp_int_Variable) == 0x000010, "Member 'UI_Attention_NoGore1_C_GetText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText, Temp_text_Variable) == 0x000018, "Member 'UI_Attention_NoGore1_C_GetText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText, Temp_text_Variable_1) == 0x000028, "Member 'UI_Attention_NoGore1_C_GetText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText, Temp_text_Variable_2) == 0x000038, "Member 'UI_Attention_NoGore1_C_GetText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText, Temp_text_Variable_3) == 0x000048, "Member 'UI_Attention_NoGore1_C_GetText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText, K2Node_Select_Default) == 0x000058, "Member 'UI_Attention_NoGore1_C_GetText::K2Node_Select_Default' has a wrong offset!");

// Function UI_Attention_NoGore1.UI_Attention_NoGore1_C.GetText_0
// 0x0068 (0x0068 - 0x0000)
struct UI_Attention_NoGore1_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0048(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0010)()
};
static_assert(alignof(UI_Attention_NoGore1_C_GetText_0) == 0x000008, "Wrong alignment on UI_Attention_NoGore1_C_GetText_0");
static_assert(sizeof(UI_Attention_NoGore1_C_GetText_0) == 0x000068, "Wrong size on UI_Attention_NoGore1_C_GetText_0");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText_0, ReturnValue) == 0x000000, "Member 'UI_Attention_NoGore1_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText_0, Temp_int_Variable) == 0x000010, "Member 'UI_Attention_NoGore1_C_GetText_0::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText_0, Temp_text_Variable) == 0x000018, "Member 'UI_Attention_NoGore1_C_GetText_0::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText_0, Temp_text_Variable_1) == 0x000028, "Member 'UI_Attention_NoGore1_C_GetText_0::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText_0, Temp_text_Variable_2) == 0x000038, "Member 'UI_Attention_NoGore1_C_GetText_0::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText_0, Temp_text_Variable_3) == 0x000048, "Member 'UI_Attention_NoGore1_C_GetText_0::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Attention_NoGore1_C_GetText_0, K2Node_Select_Default) == 0x000058, "Member 'UI_Attention_NoGore1_C_GetText_0::K2Node_Select_Default' has a wrong offset!");

}

