#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_AudioSettings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_AudioSettings.UI_AudioSettings_C.BndEvt__UI_AudioSettings_SliderVOice_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_AudioSettings_C_BndEvt__UI_AudioSettings_SliderVOice_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_AudioSettings_C_BndEvt__UI_AudioSettings_SliderVOice_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_AudioSettings_C_BndEvt__UI_AudioSettings_SliderVOice_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_AudioSettings_C_BndEvt__UI_AudioSettings_SliderVOice_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_AudioSettings_C_BndEvt__UI_AudioSettings_SliderVOice_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_AudioSettings_C_BndEvt__UI_AudioSettings_SliderVOice_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UI_AudioSettings_C_BndEvt__UI_AudioSettings_SliderVOice_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UI_AudioSettings.UI_AudioSettings_C.BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_AudioSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_AudioSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_AudioSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_AudioSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_AudioSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_AudioSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UI_AudioSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UI_AudioSettings.UI_AudioSettings_C.BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_AudioSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_AudioSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_AudioSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_AudioSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_AudioSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_AudioSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UI_AudioSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UI_AudioSettings.UI_AudioSettings_C.ExecuteUbergraph_UI_AudioSettings
// 0x0148 (0x0148 - 0x0000)
struct UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Controls_C*                         CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_GameSettings_C*                     CallFunc_Create_ReturnValue_1;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_DisplaySettings_C*                  CallFunc_Create_ReturnValue_2;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0040(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_2;             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_3;                     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_4;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         K2Node_DynamicCast_AsSG_Settings;                  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Music_Volume_ImplicitCast;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Sound_Volume_ImplicitCast;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_1; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Voice_Volume_ImplicitCast;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings) == 0x000008, "Wrong alignment on UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings");
static_assert(sizeof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings) == 0x000148, "Wrong size on UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, EntryPoint) == 0x000000, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_Create_ReturnValue) == 0x000010, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_DynamicCast_AsGI_Settings) == 0x000018, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_ComponentBoundEvent_Value_2) == 0x000024, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_ComponentBoundEvent_Value_1) == 0x000028, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_Create_ReturnValue_1) == 0x000030, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_Create_ReturnValue_2) == 0x000038, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_Event_MyGeometry) == 0x000040, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_Event_InDeltaTime) == 0x000078, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_GetPlayerController_ReturnValue_1) == 0x000088, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_IsInputKeyDown_ReturnValue) == 0x000090, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_IsInputKeyDown_ReturnValue_1) == 0x000091, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_IsInputKeyDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_GetPlayerController_ReturnValue_2) == 0x000098, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_BooleanOR_ReturnValue) == 0x0000A0, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_IsInputKeyDown_ReturnValue_2) == 0x0000A1, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_IsInputKeyDown_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_BooleanOR_ReturnValue_1) == 0x0000A2, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000B0, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000B8, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000C0, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000C8, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_PlayAnimation_ReturnValue_5) == 0x0000D0, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_PlayAnimation_ReturnValue_6) == 0x0000D8, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_PlayAnimation_ReturnValue_7) == 0x0000E0, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_Create_ReturnValue_3) == 0x0000E8, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_Create_ReturnValue_4) == 0x0000F0, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_ComponentBoundEvent_Value) == 0x0000F8, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000100, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000108, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_DynamicCast_AsSG_Settings) == 0x000110, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_DynamicCast_AsSG_Settings' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000120, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_VariableSet_Music_Volume_ImplicitCast) == 0x000128, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_VariableSet_Music_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_VariableSet_Sound_Volume_ImplicitCast) == 0x000130, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_VariableSet_Sound_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast) == 0x000138, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_1) == 0x00013C, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings, K2Node_VariableSet_Voice_Volume_ImplicitCast) == 0x000140, "Member 'UI_AudioSettings_C_ExecuteUbergraph_UI_AudioSettings::K2Node_VariableSet_Voice_Volume_ImplicitCast' has a wrong offset!");

// Function UI_AudioSettings.UI_AudioSettings_C.Get_SliderMusic_Value
// 0x0008 (0x0008 - 0x0000)
struct UI_AudioSettings_C_Get_SliderMusic_Value final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_AudioSettings_C_Get_SliderMusic_Value) == 0x000004, "Wrong alignment on UI_AudioSettings_C_Get_SliderMusic_Value");
static_assert(sizeof(UI_AudioSettings_C_Get_SliderMusic_Value) == 0x000008, "Wrong size on UI_AudioSettings_C_Get_SliderMusic_Value");
static_assert(offsetof(UI_AudioSettings_C_Get_SliderMusic_Value, ReturnValue) == 0x000000, "Member 'UI_AudioSettings_C_Get_SliderMusic_Value::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_Get_SliderMusic_Value, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_AudioSettings_C_Get_SliderMusic_Value::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_AudioSettings.UI_AudioSettings_C.Get_SliderSFX_Value
// 0x0008 (0x0008 - 0x0000)
struct UI_AudioSettings_C_Get_SliderSFX_Value final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_AudioSettings_C_Get_SliderSFX_Value) == 0x000004, "Wrong alignment on UI_AudioSettings_C_Get_SliderSFX_Value");
static_assert(sizeof(UI_AudioSettings_C_Get_SliderSFX_Value) == 0x000008, "Wrong size on UI_AudioSettings_C_Get_SliderSFX_Value");
static_assert(offsetof(UI_AudioSettings_C_Get_SliderSFX_Value, ReturnValue) == 0x000000, "Member 'UI_AudioSettings_C_Get_SliderSFX_Value::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_Get_SliderSFX_Value, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_AudioSettings_C_Get_SliderSFX_Value::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_AudioSettings.UI_AudioSettings_C.Get_SliderVOice_Value
// 0x0004 (0x0004 - 0x0000)
struct UI_AudioSettings_C_Get_SliderVOice_Value final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_AudioSettings_C_Get_SliderVOice_Value) == 0x000004, "Wrong alignment on UI_AudioSettings_C_Get_SliderVOice_Value");
static_assert(sizeof(UI_AudioSettings_C_Get_SliderVOice_Value) == 0x000004, "Wrong size on UI_AudioSettings_C_Get_SliderVOice_Value");
static_assert(offsetof(UI_AudioSettings_C_Get_SliderVOice_Value, ReturnValue) == 0x000000, "Member 'UI_AudioSettings_C_Get_SliderVOice_Value::ReturnValue' has a wrong offset!");

// Function UI_AudioSettings.UI_AudioSettings_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_AudioSettings_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_AudioSettings_C_Tick) == 0x000004, "Wrong alignment on UI_AudioSettings_C_Tick");
static_assert(sizeof(UI_AudioSettings_C_Tick) == 0x00003C, "Wrong size on UI_AudioSettings_C_Tick");
static_assert(offsetof(UI_AudioSettings_C_Tick, MyGeometry) == 0x000000, "Member 'UI_AudioSettings_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_AudioSettings_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_AudioSettings_C_Tick::InDeltaTime' has a wrong offset!");

}

