#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Controls

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Controls.UI_Controls_C
// 0x00C0 (0x03A0 - 0x02E0)
class UUI_Controls_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverBack;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAudio;                                        // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverGame;                                         // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverDisplay;                                      // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BackButton;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_2;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_3;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_27;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_0;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Sensitivity;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 Go_Back_To;                                        // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UGI_Settings_C*                         GI_Settings;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Mouse_Sensitivity;                                 // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         SaveGame;                                          // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Controls_BackButton_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Controls_BackButton_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Controls_Button_27_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Controls_Button_27_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Controls_Button_27_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Controls_Button_2_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Controls_Button_2_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Controls_Button_2_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Controls_Button_3_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Controls_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Controls_Button_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Controls_Button_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Controls_CheckBox_0_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__UI_Controls_CheckBox_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__UI_Controls_Slider_Sensitivity_K2Node_ComponentBoundEvent_17_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__UI_Settings_GraphicsReturn_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Controls(int32 EntryPoint);
	float Get_Slider_Sensitivity_Value();
	ECheckBoxState GetCheckedState();
	ECheckBoxState GetCheckedState_0();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Controls_C">();
	}
	static class UUI_Controls_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Controls_C>();
	}
};
static_assert(alignof(UUI_Controls_C) == 0x000008, "Wrong alignment on UUI_Controls_C");
static_assert(sizeof(UUI_Controls_C) == 0x0003A0, "Wrong size on UUI_Controls_C");
static_assert(offsetof(UUI_Controls_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_Controls_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, HoverBack) == 0x0002E8, "Member 'UUI_Controls_C::HoverBack' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, HoverAudio) == 0x0002F0, "Member 'UUI_Controls_C::HoverAudio' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, HoverGame) == 0x0002F8, "Member 'UUI_Controls_C::HoverGame' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, HoverDisplay) == 0x000300, "Member 'UUI_Controls_C::HoverDisplay' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, BackButton) == 0x000308, "Member 'UUI_Controls_C::BackButton' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Button) == 0x000310, "Member 'UUI_Controls_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Button_1) == 0x000318, "Member 'UUI_Controls_C::Button_1' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Button_2) == 0x000320, "Member 'UUI_Controls_C::Button_2' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Button_3) == 0x000328, "Member 'UUI_Controls_C::Button_3' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Button_27) == 0x000330, "Member 'UUI_Controls_C::Button_27' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, CheckBox) == 0x000338, "Member 'UUI_Controls_C::CheckBox' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, CheckBox_0) == 0x000340, "Member 'UUI_Controls_C::CheckBox_0' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Image_0) == 0x000348, "Member 'UUI_Controls_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Image_1) == 0x000350, "Member 'UUI_Controls_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Image_2) == 0x000358, "Member 'UUI_Controls_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Image_3) == 0x000360, "Member 'UUI_Controls_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Image_11) == 0x000368, "Member 'UUI_Controls_C::Image_11' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Image_12) == 0x000370, "Member 'UUI_Controls_C::Image_12' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Slider_Sensitivity) == 0x000378, "Member 'UUI_Controls_C::Slider_Sensitivity' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Go_Back_To) == 0x000380, "Member 'UUI_Controls_C::Go_Back_To' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, GI_Settings) == 0x000388, "Member 'UUI_Controls_C::GI_Settings' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, Mouse_Sensitivity) == 0x000390, "Member 'UUI_Controls_C::Mouse_Sensitivity' has a wrong offset!");
static_assert(offsetof(UUI_Controls_C, SaveGame) == 0x000398, "Member 'UUI_Controls_C::SaveGame' has a wrong offset!");

}

