#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CommandButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CommandButton.UI_CommandButton_C
// 0x0078 (0x0358 - 0x02E0)
class UUI_CommandButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonIcon;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonTitle;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_80;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_219;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             Icon;                                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0328(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bIsClickable;                                      // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    IconDT;                                            // 0x0340(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	int32                                         LastIndex;                                         // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSpacer;                                        // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_UI_CommandButton(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void UpdateIconByIndex(int32 Index_0);
	void UpdateIconDT(const struct FDataTableRowHandle& IconDT_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_CommandButton_C">();
	}
	static class UUI_CommandButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CommandButton_C>();
	}
};
static_assert(alignof(UUI_CommandButton_C) == 0x000008, "Wrong alignment on UUI_CommandButton_C");
static_assert(sizeof(UUI_CommandButton_C) == 0x000358, "Wrong size on UUI_CommandButton_C");
static_assert(offsetof(UUI_CommandButton_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_CommandButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, Button) == 0x0002E8, "Member 'UUI_CommandButton_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, ButtonIcon) == 0x0002F0, "Member 'UUI_CommandButton_C::ButtonIcon' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, ButtonTitle) == 0x0002F8, "Member 'UUI_CommandButton_C::ButtonTitle' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, Overlay_80) == 0x000300, "Member 'UUI_CommandButton_C::Overlay_80' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, Spacer_219) == 0x000308, "Member 'UUI_CommandButton_C::Spacer_219' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, OnPressed) == 0x000310, "Member 'UUI_CommandButton_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, Icon) == 0x000320, "Member 'UUI_CommandButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, Text) == 0x000328, "Member 'UUI_CommandButton_C::Text' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, bIsClickable) == 0x000338, "Member 'UUI_CommandButton_C::bIsClickable' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, IconDT) == 0x000340, "Member 'UUI_CommandButton_C::IconDT' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, LastIndex) == 0x000350, "Member 'UUI_CommandButton_C::LastIndex' has a wrong offset!");
static_assert(offsetof(UUI_CommandButton_C, bUseSpacer) == 0x000354, "Member 'UUI_CommandButton_C::bUseSpacer' has a wrong offset!");

}

