#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CommandButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "S_InputIcons_structs.hpp"


namespace SDK::Params
{

// Function UI_CommandButton.UI_CommandButton_C.ExecuteUbergraph_UI_CommandButton
// 0x0180 (0x0180 - 0x0000)
struct UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B8(0x0078)(ConstParm)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InputIcons                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0138(0x0020)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_CustomEvent_IconDT;                         // 0x0168(0x0010)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton) == 0x000008, "Wrong alignment on UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton");
static_assert(sizeof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton) == 0x000180, "Wrong size on UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, EntryPoint) == 0x000000, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, Temp_int_Variable) == 0x000004, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, K2Node_Event_MyGeometry) == 0x000008, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, K2Node_Event_MouseEvent) == 0x0000B8, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, K2Node_CustomEvent_Index) == 0x000130, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, CallFunc_GetDataTableRowFromName_OutRow) == 0x000138, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000158, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, K2Node_Select_Default) == 0x000160, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, K2Node_CustomEvent_IconDT) == 0x000168, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::K2Node_CustomEvent_IconDT' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton, K2Node_Event_IsDesignTime) == 0x000178, "Member 'UI_CommandButton_C_ExecuteUbergraph_UI_CommandButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UI_CommandButton.UI_CommandButton_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct UI_CommandButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UI_CommandButton_C_OnMouseEnter) == 0x000008, "Wrong alignment on UI_CommandButton_C_OnMouseEnter");
static_assert(sizeof(UI_CommandButton_C_OnMouseEnter) == 0x0000B0, "Wrong size on UI_CommandButton_C_OnMouseEnter");
static_assert(offsetof(UI_CommandButton_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UI_CommandButton_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_CommandButton_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UI_CommandButton_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UI_CommandButton.UI_CommandButton_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct UI_CommandButton_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UI_CommandButton_C_OnMouseLeave) == 0x000008, "Wrong alignment on UI_CommandButton_C_OnMouseLeave");
static_assert(sizeof(UI_CommandButton_C_OnMouseLeave) == 0x000078, "Wrong size on UI_CommandButton_C_OnMouseLeave");
static_assert(offsetof(UI_CommandButton_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UI_CommandButton_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UI_CommandButton.UI_CommandButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_CommandButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CommandButton_C_PreConstruct) == 0x000001, "Wrong alignment on UI_CommandButton_C_PreConstruct");
static_assert(sizeof(UI_CommandButton_C_PreConstruct) == 0x000001, "Wrong size on UI_CommandButton_C_PreConstruct");
static_assert(offsetof(UI_CommandButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_CommandButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_CommandButton.UI_CommandButton_C.UpdateIconByIndex
// 0x0004 (0x0004 - 0x0000)
struct UI_CommandButton_C_UpdateIconByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CommandButton_C_UpdateIconByIndex) == 0x000004, "Wrong alignment on UI_CommandButton_C_UpdateIconByIndex");
static_assert(sizeof(UI_CommandButton_C_UpdateIconByIndex) == 0x000004, "Wrong size on UI_CommandButton_C_UpdateIconByIndex");
static_assert(offsetof(UI_CommandButton_C_UpdateIconByIndex, Index_0) == 0x000000, "Member 'UI_CommandButton_C_UpdateIconByIndex::Index_0' has a wrong offset!");

// Function UI_CommandButton.UI_CommandButton_C.UpdateIconDT
// 0x0010 (0x0010 - 0x0000)
struct UI_CommandButton_C_UpdateIconDT final
{
public:
	struct FDataTableRowHandle                    IconDT_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UI_CommandButton_C_UpdateIconDT) == 0x000008, "Wrong alignment on UI_CommandButton_C_UpdateIconDT");
static_assert(sizeof(UI_CommandButton_C_UpdateIconDT) == 0x000010, "Wrong size on UI_CommandButton_C_UpdateIconDT");
static_assert(offsetof(UI_CommandButton_C_UpdateIconDT, IconDT_0) == 0x000000, "Member 'UI_CommandButton_C_UpdateIconDT::IconDT_0' has a wrong offset!");

}

