#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Cards

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Enum_PlayCards_structs.hpp"


namespace SDK::Params
{

// Function UI_Cards.UI_Cards_C.ExecuteUbergraph_UI_Cards
// 0x0B30 (0x0B30 - 0x0000)
struct UI_Cards_C_ExecuteUbergraph_UI_Cards final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_PlayCards                                Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_PlayCards                                Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_PlayCards                                Temp_byte_Variable_2;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_6;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_7;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_PlayCards                                Temp_byte_Variable_3;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_8;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_9;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_10;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_11;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_12;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_13;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_14;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_15;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x009C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<Enum_PlayCards>                        K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class ABP_HalfSwordGameMode_C*                K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode;      // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_PlayCards>                        K2Node_MakeArray_Array_1;                          // 0x0118(0x0010)(ReferenceParm)
	TArray<Enum_PlayCards>                        K2Node_MakeArray_Array_2;                          // 0x0128(0x0010)(ReferenceParm)
	TArray<Enum_PlayCards>                        K2Node_Select_Default;                             // 0x0138(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_PlayCards                                K2Node_Select_Default_1;                           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_PlayCards                                CallFunc_Array_Random_OutItem;                     // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_2;                           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0160(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0230(0x03F0)()
	class UTexture2D*                             K2Node_Select_Default_3;                           // 0x0620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue_1;       // 0x0630(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_1;                   // 0x0700(0x03F0)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0AF0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0AF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0B00(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0B08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0B10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B11[0x7];                                      // 0x0B11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0B18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0B20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0B28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Cards_C_ExecuteUbergraph_UI_Cards) == 0x000010, "Wrong alignment on UI_Cards_C_ExecuteUbergraph_UI_Cards");
static_assert(sizeof(UI_Cards_C_ExecuteUbergraph_UI_Cards) == 0x000B30, "Wrong size on UI_Cards_C_ExecuteUbergraph_UI_Cards");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, EntryPoint) == 0x000000, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_int_Variable) == 0x000004, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_bool_Variable) == 0x000008, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_byte_Variable) == 0x000009, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_byte_Variable_1) == 0x00000A, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_byte_Variable_2) == 0x00000B, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable) == 0x000010, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_1) == 0x000018, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_2) == 0x000020, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_3) == 0x000028, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_4) == 0x000030, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_5) == 0x000038, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_6) == 0x000040, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_7) == 0x000048, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_byte_Variable_3) == 0x000050, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_8) == 0x000058, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_9) == 0x000060, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_10) == 0x000068, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_11) == 0x000070, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_12) == 0x000078, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_13) == 0x000080, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_14) == 0x000088, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, Temp_object_Variable_15) == 0x000090, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_Event_IsDesignTime) == 0x000098, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_Event_MyGeometry) == 0x00009C, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_Event_InDeltaTime) == 0x0000D4, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_GetPlayerController_ReturnValue) == 0x0000D8, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_PlayAnimation_ReturnValue) == 0x0000E0, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_SetGamePaused_ReturnValue) == 0x0000E8, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_GetGameMode_ReturnValue) == 0x0000F0, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_MakeArray_Array) == 0x0000F8, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode) == 0x000108, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_MakeArray_Array_1) == 0x000118, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_MakeArray_Array_2) == 0x000128, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_Select_Default) == 0x000138, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000148, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_Select_Default_1) == 0x000149, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_Array_Random_OutItem) == 0x00014A, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_Array_Random_OutIndex) == 0x00014C, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_Select_Default_2) == 0x000150, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000160, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_MakeStruct_ButtonStyle) == 0x000230, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_Select_Default_3) == 0x000620, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_MakeBrushFromTexture_ReturnValue_1) == 0x000630, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_MakeBrushFromTexture_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, K2Node_MakeStruct_ButtonStyle_1) == 0x000700, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::K2Node_MakeStruct_ButtonStyle_1' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_PlayAnimation_ReturnValue_1) == 0x000AF0, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_PlayAnimation_ReturnValue_2) == 0x000AF8, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_PlayAnimation_ReturnValue_3) == 0x000B00, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_PlayAnimation_ReturnValue_4) == 0x000B08, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_SetGamePaused_ReturnValue_1) == 0x000B10, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_GetPlayerController_ReturnValue_1) == 0x000B18, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_GetGameMode_ReturnValue_1) == 0x000B20, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_ExecuteUbergraph_UI_Cards, CallFunc_Not_PreBool_ReturnValue) == 0x000B28, "Member 'UI_Cards_C_ExecuteUbergraph_UI_Cards::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function UI_Cards.UI_Cards_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Cards_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Cards_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Cards_C_PreConstruct");
static_assert(sizeof(UI_Cards_C_PreConstruct) == 0x000001, "Wrong size on UI_Cards_C_PreConstruct");
static_assert(offsetof(UI_Cards_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Cards_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Cards.UI_Cards_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Cards_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Cards_C_Tick) == 0x000004, "Wrong alignment on UI_Cards_C_Tick");
static_assert(sizeof(UI_Cards_C_Tick) == 0x00003C, "Wrong size on UI_Cards_C_Tick");
static_assert(offsetof(UI_Cards_C_Tick, MyGeometry) == 0x000000, "Member 'UI_Cards_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Cards_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_Cards_C_Tick::InDeltaTime' has a wrong offset!");

}

