#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Checkbox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_Checkbox.UI_Checkbox_C.BndEvt__ToggleDoF_1_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_Checkbox_C_BndEvt__ToggleDoF_1_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Checkbox_C_BndEvt__ToggleDoF_1_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on UI_Checkbox_C_BndEvt__ToggleDoF_1_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(UI_Checkbox_C_BndEvt__ToggleDoF_1_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on UI_Checkbox_C_BndEvt__ToggleDoF_1_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(UI_Checkbox_C_BndEvt__ToggleDoF_1_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'UI_Checkbox_C_BndEvt__ToggleDoF_1_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function UI_Checkbox.UI_Checkbox_C.ChangeValue
// 0x0002 (0x0002 - 0x0000)
struct UI_Checkbox_C_ChangeValue final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldFocus_0;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Checkbox_C_ChangeValue) == 0x000001, "Wrong alignment on UI_Checkbox_C_ChangeValue");
static_assert(sizeof(UI_Checkbox_C_ChangeValue) == 0x000002, "Wrong size on UI_Checkbox_C_ChangeValue");
static_assert(offsetof(UI_Checkbox_C_ChangeValue, bValue) == 0x000000, "Member 'UI_Checkbox_C_ChangeValue::bValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ChangeValue, bShouldFocus_0) == 0x000001, "Member 'UI_Checkbox_C_ChangeValue::bShouldFocus_0' has a wrong offset!");

// Function UI_Checkbox.UI_Checkbox_C.ExecuteUbergraph_UI_Checkbox
// 0x0100 (0x0100 - 0x0000)
struct UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isPhotoModeOpened_bIsOpened;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        CallFunc_isPhotoModeOpened_WidgetReference;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isPhotoModeOpened_bIsOpened_1;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        CallFunc_isPhotoModeOpened_WidgetReference_1;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bDefaultValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldFocus_1;                 // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bValue;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldFocus;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0068(0x0078)(ConstParm)
	bool                                          CallFunc_isPhotoModeOpened_bIsOpened_2;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        CallFunc_isPhotoModeOpened_WidgetReference_2;      // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox) == 0x000008, "Wrong alignment on UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox");
static_assert(sizeof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox) == 0x000100, "Wrong size on UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, EntryPoint) == 0x000000, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_isPhotoModeOpened_bIsOpened) == 0x000005, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_isPhotoModeOpened_bIsOpened' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_isPhotoModeOpened_WidgetReference) == 0x000008, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_isPhotoModeOpened_WidgetReference' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_isPhotoModeOpened_bIsOpened_1) == 0x000011, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_isPhotoModeOpened_bIsOpened_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_isPhotoModeOpened_WidgetReference_1) == 0x000018, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_isPhotoModeOpened_WidgetReference_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, K2Node_Event_IsDesignTime) == 0x000021, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, K2Node_CustomEvent_bDefaultValue) == 0x000022, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::K2Node_CustomEvent_bDefaultValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, K2Node_CustomEvent_bShouldFocus_1) == 0x000023, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::K2Node_CustomEvent_bShouldFocus_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, K2Node_CustomEvent_bValue) == 0x000024, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::K2Node_CustomEvent_bValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, K2Node_CustomEvent_bShouldFocus) == 0x000025, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::K2Node_CustomEvent_bShouldFocus' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_IsChecked_ReturnValue) == 0x000026, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, K2Node_ComponentBoundEvent_bIsChecked) == 0x000027, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_IsValid_ReturnValue_2) == 0x000028, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, Temp_bool_IsClosed_Variable) == 0x000029, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, K2Node_Event_MyGeometry) == 0x00002C, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, K2Node_Event_MouseEvent) == 0x000068, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_isPhotoModeOpened_bIsOpened_2) == 0x0000E0, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_isPhotoModeOpened_bIsOpened_2' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_isPhotoModeOpened_WidgetReference_2) == 0x0000E8, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_isPhotoModeOpened_WidgetReference_2' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_IsValid_ReturnValue_3) == 0x0000F0, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000F8, "Member 'UI_Checkbox_C_ExecuteUbergraph_UI_Checkbox::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function UI_Checkbox.UI_Checkbox_C.Initialize
// 0x0001 (0x0001 - 0x0000)
struct UI_Checkbox_C_Initialize final
{
public:
	bool                                          bDefaultValue_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Checkbox_C_Initialize) == 0x000001, "Wrong alignment on UI_Checkbox_C_Initialize");
static_assert(sizeof(UI_Checkbox_C_Initialize) == 0x000001, "Wrong size on UI_Checkbox_C_Initialize");
static_assert(offsetof(UI_Checkbox_C_Initialize, bDefaultValue_0) == 0x000000, "Member 'UI_Checkbox_C_Initialize::bDefaultValue_0' has a wrong offset!");

// Function UI_Checkbox.UI_Checkbox_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct UI_Checkbox_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UI_Checkbox_C_OnMouseEnter) == 0x000008, "Wrong alignment on UI_Checkbox_C_OnMouseEnter");
static_assert(sizeof(UI_Checkbox_C_OnMouseEnter) == 0x0000B0, "Wrong size on UI_Checkbox_C_OnMouseEnter");
static_assert(offsetof(UI_Checkbox_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UI_Checkbox_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UI_Checkbox_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UI_Checkbox.UI_Checkbox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Checkbox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Checkbox_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Checkbox_C_PreConstruct");
static_assert(sizeof(UI_Checkbox_C_PreConstruct) == 0x000001, "Wrong size on UI_Checkbox_C_PreConstruct");
static_assert(offsetof(UI_Checkbox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Checkbox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Checkbox.UI_Checkbox_C.ResetCheckbox
// 0x0001 (0x0001 - 0x0000)
struct UI_Checkbox_C_ResetCheckbox final
{
public:
	bool                                          bShouldFocus_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Checkbox_C_ResetCheckbox) == 0x000001, "Wrong alignment on UI_Checkbox_C_ResetCheckbox");
static_assert(sizeof(UI_Checkbox_C_ResetCheckbox) == 0x000001, "Wrong size on UI_Checkbox_C_ResetCheckbox");
static_assert(offsetof(UI_Checkbox_C_ResetCheckbox, bShouldFocus_0) == 0x000000, "Member 'UI_Checkbox_C_ResetCheckbox::bShouldFocus_0' has a wrong offset!");

// Function UI_Checkbox.UI_Checkbox_C.Set Focused or Unfocused Color
// 0x0BB0 (0x0BB0 - 0x0000)
struct UI_Checkbox_C_Set_Focused_or_Unfocused_Color final
{
public:
	bool                                          bChangeCheckboxColorWhenFocused_0;                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bChangeTextColorWhenFocused_0;                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCheckBox*                              CheckBox_0;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CheckboxTitle;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CheckboxValue_0;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue_1;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_2;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0064(0x0014)()
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x007C(0x0014)()
	struct FMargin                                K2Node_Select_Default_1;                           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00B0(0x0014)()
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCheckBoxStyle                         K2Node_MakeStruct_CheckBoxStyle;                   // 0x00D0(0x0AD0)()
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0BA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0BA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color) == 0x000010, "Wrong alignment on UI_Checkbox_C_Set_Focused_or_Unfocused_Color");
static_assert(sizeof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color) == 0x000BB0, "Wrong size on UI_Checkbox_C_Set_Focused_or_Unfocused_Color");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, bChangeCheckboxColorWhenFocused_0) == 0x000000, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::bChangeCheckboxColorWhenFocused_0' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, bChangeTextColorWhenFocused_0) == 0x000001, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::bChangeTextColorWhenFocused_0' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CheckBox_0) == 0x000008, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CheckBox_0' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CheckboxTitle) == 0x000010, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CheckboxTitle' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CheckboxValue_0) == 0x000018, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CheckboxValue_0' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_IsHovered_ReturnValue) == 0x000020, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_IsHovered_ReturnValue_1) == 0x000021, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_IsHovered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_HasAnyUserFocus_ReturnValue) == 0x000022, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_GetIsEnabled_ReturnValue) == 0x000023, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_HasAnyUserFocus_ReturnValue_1) == 0x000024, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_HasAnyUserFocus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_IsHovered_ReturnValue_2) == 0x000026, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_IsHovered_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_BooleanOR_ReturnValue) == 0x000027, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_GetIsEnabled_ReturnValue_1) == 0x000028, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_GetIsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_BooleanOR_ReturnValue_1) == 0x000029, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_BooleanOR_ReturnValue_2) == 0x00002A, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_BooleanAND_ReturnValue_1) == 0x00002B, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000030, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, K2Node_MakeStruct_Margin) == 0x000040, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, K2Node_MakeStruct_SlateColor) == 0x000050, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, K2Node_MakeStruct_SlateColor_1) == 0x000064, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, Temp_bool_Variable) == 0x000078, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, Temp_bool_Variable_1) == 0x000079, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, K2Node_Select_Default) == 0x00007C, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, K2Node_Select_Default_1) == 0x000090, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_SelectColor_ReturnValue) == 0x0000A0, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, K2Node_MakeStruct_SlateColor_2) == 0x0000B0, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, K2Node_MakeStruct_CheckBoxStyle) == 0x0000D0, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::K2Node_MakeStruct_CheckBoxStyle' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000BA0, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_Set_Focused_or_Unfocused_Color, K2Node_MakeStruct_Left_ImplicitCast) == 0x000BA8, "Member 'UI_Checkbox_C_Set_Focused_or_Unfocused_Color::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function UI_Checkbox.UI_Checkbox_C.setTxtValue
// 0x0028 (0x0028 - 0x0000)
struct UI_Checkbox_C_setTxtValue final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0018(0x0010)()
};
static_assert(alignof(UI_Checkbox_C_setTxtValue) == 0x000008, "Wrong alignment on UI_Checkbox_C_setTxtValue");
static_assert(sizeof(UI_Checkbox_C_setTxtValue) == 0x000028, "Wrong size on UI_Checkbox_C_setTxtValue");
static_assert(offsetof(UI_Checkbox_C_setTxtValue, ReturnValue) == 0x000000, "Member 'UI_Checkbox_C_setTxtValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_setTxtValue, Temp_bool_Variable) == 0x000010, "Member 'UI_Checkbox_C_setTxtValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_setTxtValue, CallFunc_IsChecked_ReturnValue) == 0x000011, "Member 'UI_Checkbox_C_setTxtValue::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_setTxtValue, K2Node_Select_Default) == 0x000018, "Member 'UI_Checkbox_C_setTxtValue::K2Node_Select_Default' has a wrong offset!");

// Function UI_Checkbox.UI_Checkbox_C.ToggleUsingArrows
// 0x0018 (0x0018 - 0x0000)
struct UI_Checkbox_C_ToggleUsingArrows final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Checkbox_C_ToggleUsingArrows) == 0x000008, "Wrong alignment on UI_Checkbox_C_ToggleUsingArrows");
static_assert(sizeof(UI_Checkbox_C_ToggleUsingArrows) == 0x000018, "Wrong size on UI_Checkbox_C_ToggleUsingArrows");
static_assert(offsetof(UI_Checkbox_C_ToggleUsingArrows, Navigation_0) == 0x000000, "Member 'UI_Checkbox_C_ToggleUsingArrows::Navigation_0' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ToggleUsingArrows, ReturnValue) == 0x000008, "Member 'UI_Checkbox_C_ToggleUsingArrows::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Checkbox_C_ToggleUsingArrows, CallFunc_IsChecked_ReturnValue) == 0x000010, "Member 'UI_Checkbox_C_ToggleUsingArrows::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
