#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_DED

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_DED.UI_DED_C.ExecuteUbergraph_UI_DED
// 0x0140 (0x0140 - 0x0000)
struct UI_DED_C_ExecuteUbergraph_UI_DED final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWillie_BP_C*                           K2Node_DynamicCast_AsWillie_BP;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue;             // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HalfSwordGameMode_C*                K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode;      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue;                 // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings_1;                // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue_1;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_DED_C_ExecuteUbergraph_UI_DED) == 0x000008, "Wrong alignment on UI_DED_C_ExecuteUbergraph_UI_DED");
static_assert(sizeof(UI_DED_C_ExecuteUbergraph_UI_DED) == 0x000140, "Wrong size on UI_DED_C_ExecuteUbergraph_UI_DED");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, EntryPoint) == 0x000000, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, Temp_byte_Variable) == 0x000010, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_Event_MyGeometry) == 0x000014, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000050, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_DynamicCast_AsWillie_BP) == 0x000060, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_DynamicCast_AsWillie_BP' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, Temp_bool_Variable) == 0x000069, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, Temp_bool_Has_Been_Initd_Variable) == 0x00006A, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, Temp_bool_IsClosed_Variable) == 0x00006B, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000078, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_PlayAnimation_ReturnValue_2) == 0x000080, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_PlayAnimation_ReturnValue_3) == 0x000088, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_PlayAnimation_ReturnValue_4) == 0x000090, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000A0, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000A8, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_GetGameInstance_ReturnValue) == 0x0000B0, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_DynamicCast_AsGI_Settings) == 0x0000B8, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000C1, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_PlayAnimation_ReturnValue_5) == 0x0000C8, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_DoesSaveGameExist_ReturnValue) == 0x0000D0, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_DeleteGameInSlot_ReturnValue) == 0x0000D1, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_DeleteGameInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_GetGameMode_ReturnValue_1) == 0x0000D8, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode) == 0x0000E0, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_IsValid_ReturnValue) == 0x0000E9, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_FClamp_ReturnValue) == 0x0000F8, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000100, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, Temp_byte_Variable_1) == 0x000101, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, Temp_bool_IsClosed_Variable_1) == 0x000102, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_IsGamePaused_ReturnValue) == 0x000103, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_IsGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_Select_Default) == 0x000104, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_GetGameInstance_ReturnValue_1) == 0x000108, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_DynamicCast_AsGI_Settings_1) == 0x000110, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_DynamicCast_AsGI_Settings_1' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_DeleteGameInSlot_ReturnValue_1) == 0x000119, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_DeleteGameInSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000120, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000130, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_DED_C_ExecuteUbergraph_UI_DED, CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast) == 0x000138, "Member 'UI_DED_C_ExecuteUbergraph_UI_DED::CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast' has a wrong offset!");

// Function UI_DED.UI_DED_C.Get_Score_Text
// 0x0020 (0x0020 - 0x0000)
struct UI_DED_C_Get_Score_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0010)()
};
static_assert(alignof(UI_DED_C_Get_Score_Text) == 0x000008, "Wrong alignment on UI_DED_C_Get_Score_Text");
static_assert(sizeof(UI_DED_C_Get_Score_Text) == 0x000020, "Wrong size on UI_DED_C_Get_Score_Text");
static_assert(offsetof(UI_DED_C_Get_Score_Text, ReturnValue) == 0x000000, "Member 'UI_DED_C_Get_Score_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DED_C_Get_Score_Text, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'UI_DED_C_Get_Score_Text::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

// Function UI_DED.UI_DED_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_DED_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_DED_C_Tick) == 0x000004, "Wrong alignment on UI_DED_C_Tick");
static_assert(sizeof(UI_DED_C_Tick) == 0x00003C, "Wrong size on UI_DED_C_Tick");
static_assert(offsetof(UI_DED_C_Tick, MyGeometry) == 0x000000, "Member 'UI_DED_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_DED_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_DED_C_Tick::InDeltaTime' has a wrong offset!");

}

