#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_DED

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_DED.UI_DED_C
// 0x0088 (0x0368 - 0x02E0)
class UUI_DED_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DethPicUnfade;                                     // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RestartHover;                                      // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RestartButtonAppear;                               // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TextAppear;                                        // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade;                                              // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Restart;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_7;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DeathPic;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Score;                                             // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AWillie_BP_C*                           My_Master__Willie_;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Opacity;                                   // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Restart;                                       // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Settings_C*                         GI_Settings;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_HalfSwordGameMode_C*                BP_Half_Sword_Game_Mode;                           // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         As_GI_Settings;                                    // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_DED_Button_155_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_DED_Button_155_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_DED_Button_155_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_DED(int32 EntryPoint);
	class FText Get_Score_Text();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_DED_C">();
	}
	static class UUI_DED_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_DED_C>();
	}
};
static_assert(alignof(UUI_DED_C) == 0x000008, "Wrong alignment on UUI_DED_C");
static_assert(sizeof(UUI_DED_C) == 0x000368, "Wrong size on UUI_DED_C");
static_assert(offsetof(UUI_DED_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_DED_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, DethPicUnfade) == 0x0002E8, "Member 'UUI_DED_C::DethPicUnfade' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, RestartHover) == 0x0002F0, "Member 'UUI_DED_C::RestartHover' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, RestartButtonAppear) == 0x0002F8, "Member 'UUI_DED_C::RestartButtonAppear' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, TextAppear) == 0x000300, "Member 'UUI_DED_C::TextAppear' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, Fade) == 0x000308, "Member 'UUI_DED_C::Fade' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, Black) == 0x000310, "Member 'UUI_DED_C::Black' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, Button_Restart) == 0x000318, "Member 'UUI_DED_C::Button_Restart' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, CanvasPanel_7) == 0x000320, "Member 'UUI_DED_C::CanvasPanel_7' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, DeathPic) == 0x000328, "Member 'UUI_DED_C::DeathPic' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, Score) == 0x000330, "Member 'UUI_DED_C::Score' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, My_Master__Willie_) == 0x000338, "Member 'UUI_DED_C::My_Master__Willie_' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, Current_Opacity) == 0x000340, "Member 'UUI_DED_C::Current_Opacity' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, Can_Restart) == 0x000348, "Member 'UUI_DED_C::Can_Restart' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, GI_Settings) == 0x000350, "Member 'UUI_DED_C::GI_Settings' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, BP_Half_Sword_Game_Mode) == 0x000358, "Member 'UUI_DED_C::BP_Half_Sword_Game_Mode' has a wrong offset!");
static_assert(offsetof(UUI_DED_C, As_GI_Settings) == 0x000360, "Member 'UUI_DED_C::As_GI_Settings' has a wrong offset!");

}

