#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_FadeOut

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_FadeOut.UI_FadeOut_C.ExecuteUbergraph_UI_FadeOut
// 0x0020 (0x0020 - 0x0000)
struct UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut) == 0x000008, "Wrong alignment on UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut");
static_assert(sizeof(UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut) == 0x000020, "Wrong size on UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut");
static_assert(offsetof(UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut, EntryPoint) == 0x000000, "Member 'UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut, CallFunc_GetPlayerController_ReturnValue_1) == 0x000018, "Member 'UI_FadeOut_C_ExecuteUbergraph_UI_FadeOut::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");

}

