#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_FadeOut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_FadeOut.UI_FadeOut_C
// 0x0020 (0x0300 - 0x02E0)
class UUI_FadeOut_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_Opened;                                         // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_FadeOut(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_FadeOut_C">();
	}
	static class UUI_FadeOut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_FadeOut_C>();
	}
};
static_assert(alignof(UUI_FadeOut_C) == 0x000008, "Wrong alignment on UUI_FadeOut_C");
static_assert(sizeof(UUI_FadeOut_C) == 0x000300, "Wrong size on UUI_FadeOut_C");
static_assert(offsetof(UUI_FadeOut_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_FadeOut_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_FadeOut_C, FadeOut) == 0x0002E8, "Member 'UUI_FadeOut_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UUI_FadeOut_C, Image_0) == 0x0002F0, "Member 'UUI_FadeOut_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_FadeOut_C, Is_Opened) == 0x0002F8, "Member 'UUI_FadeOut_C::Is_Opened' has a wrong offset!");

}

