#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Gallery

#include "Basic.hpp"

#include "S_PhotosData_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Gallery.UI_Gallery_C.CloseFullscreen
// 0x0001 (0x0001 - 0x0000)
struct UI_Gallery_C_CloseFullscreen final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Gallery_C_CloseFullscreen) == 0x000001, "Wrong alignment on UI_Gallery_C_CloseFullscreen");
static_assert(sizeof(UI_Gallery_C_CloseFullscreen) == 0x000001, "Wrong size on UI_Gallery_C_CloseFullscreen");
static_assert(offsetof(UI_Gallery_C_CloseFullscreen, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UI_Gallery_C_CloseFullscreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UI_Gallery.UI_Gallery_C.CreatePages
// 0x0070 (0x0070 - 0x0000)
struct UI_Gallery_C_CreatePages final
{
public:
	int32                                         PagesToCreate;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_PhotoPage_C*                        CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_PhotoPage_C*                        CallFunc_Create_ReturnValue_1;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Gallery_C_CreatePages) == 0x000008, "Wrong alignment on UI_Gallery_C_CreatePages");
static_assert(sizeof(UI_Gallery_C_CreatePages) == 0x000070, "Wrong size on UI_Gallery_C_CreatePages");
static_assert(offsetof(UI_Gallery_C_CreatePages, PagesToCreate) == 0x000000, "Member 'UI_Gallery_C_CreatePages::PagesToCreate' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'UI_Gallery_C_CreatePages::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Array_Length_ReturnValue_1) == 0x000008, "Member 'UI_Gallery_C_CreatePages::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'UI_Gallery_C_CreatePages::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, Temp_int_Variable) == 0x000010, "Member 'UI_Gallery_C_CreatePages::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'UI_Gallery_C_CreatePages::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Create_ReturnValue) == 0x000018, "Member 'UI_Gallery_C_CreatePages::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Multiply_IntInt_ReturnValue) == 0x000020, "Member 'UI_Gallery_C_CreatePages::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Array_Length_ReturnValue_2) == 0x000024, "Member 'UI_Gallery_C_CreatePages::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'UI_Gallery_C_CreatePages::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Create_ReturnValue_1) == 0x000030, "Member 'UI_Gallery_C_CreatePages::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000038, "Member 'UI_Gallery_C_CreatePages::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'UI_Gallery_C_CreatePages::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000040, "Member 'UI_Gallery_C_CreatePages::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Array_AddUnique_ReturnValue) == 0x000048, "Member 'UI_Gallery_C_CreatePages::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Array_Length_ReturnValue_3) == 0x00004C, "Member 'UI_Gallery_C_CreatePages::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000050, "Member 'UI_Gallery_C_CreatePages::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_SafeDivide_ReturnValue) == 0x000058, "Member 'UI_Gallery_C_CreatePages::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_FCeil_ReturnValue) == 0x000060, "Member 'UI_Gallery_C_CreatePages::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'UI_Gallery_C_CreatePages::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_CreatePages, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000068, "Member 'UI_Gallery_C_CreatePages::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");

// Function UI_Gallery.UI_Gallery_C.DeletePhoto
// 0x0178 (0x0178 - 0x0000)
struct UI_Gallery_C_DeletePhoto final
{
public:
	class UUI_PhotoThumbnail_C*                   ThumbToDelete;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoPage_C*                        CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoPage_C*                        CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_PhotoPage_C*                        CallFunc_Array_Get_Item_2;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item_3;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_PhotoPage_C*                        CallFunc_Array_Get_Item_4;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item_5;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item_6;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item_7;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_5;         // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoPage_C*                        CallFunc_Array_Get_Item_8;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item_9;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_PhotosData                          CallFunc_Array_Get_Item_10;                        // 0x00F0(0x0030)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item_11;                        // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_6;         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item_12;                        // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_6;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_7;         // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FileExists_ReturnValue;                   // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FileExists_ReturnValue_1;                 // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoThumbnail_C*                   K2Node_DynamicCast_AsUI_Photo_Thumbnail;           // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Gallery_C_DeletePhoto) == 0x000008, "Wrong alignment on UI_Gallery_C_DeletePhoto");
static_assert(sizeof(UI_Gallery_C_DeletePhoto) == 0x000178, "Wrong size on UI_Gallery_C_DeletePhoto");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, ThumbToDelete) == 0x000000, "Member 'UI_Gallery_C_DeletePhoto::ThumbToDelete' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_LastIndex_ReturnValue) == 0x000008, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item) == 0x000010, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, Temp_int_Variable) == 0x00001C, "Member 'UI_Gallery_C_DeletePhoto::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Length_ReturnValue_1) == 0x000034, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Max_ReturnValue) == 0x00003C, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000040, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, Temp_int_Variable_1) == 0x000048, "Member 'UI_Gallery_C_DeletePhoto::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'UI_Gallery_C_DeletePhoto::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_2) == 0x000050, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x000058, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00005A, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000060, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'UI_Gallery_C_DeletePhoto::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000068, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_LastIndex_ReturnValue_1) == 0x00006C, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000070, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000074, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, Temp_int_Variable_2) == 0x000078, "Member 'UI_Gallery_C_DeletePhoto::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Find_ReturnValue) == 0x00007C, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Add_IntInt_ReturnValue_2) == 0x000080, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_LastIndex_ReturnValue_2) == 0x000084, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_LastIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_3) == 0x000088, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_4) == 0x000090, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_IsVisible_ReturnValue) == 0x000098, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Not_PreBool_ReturnValue) == 0x000099, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_5) == 0x0000A0, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_IsValidIndex_ReturnValue_3) == 0x0000A8, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_IsValidIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A9, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_BooleanAND_ReturnValue) == 0x0000AA, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x0000AC, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_6) == 0x0000B0, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_IsValidIndex_ReturnValue_4) == 0x0000B8, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_IsValidIndex_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_IsValid_ReturnValue_2) == 0x0000B9, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, Temp_int_Array_Index_Variable_1) == 0x0000BC, "Member 'UI_Gallery_C_DeletePhoto::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_7) == 0x0000C0, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000C8, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, Temp_int_Loop_Counter_Variable_1) == 0x0000CC, "Member 'UI_Gallery_C_DeletePhoto::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Subtract_IntInt_ReturnValue_5) == 0x0000D0, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Subtract_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_IsValidIndex_ReturnValue_5) == 0x0000D4, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_IsValidIndex_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000D5, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_8) == 0x0000D8, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, Temp_int_Array_Index_Variable_2) == 0x0000E0, "Member 'UI_Gallery_C_DeletePhoto::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_9) == 0x0000E8, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_10) == 0x0000F0, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_10' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x000120, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_11) == 0x000128, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_11' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_IsValidIndex_ReturnValue_6) == 0x000130, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_IsValidIndex_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Get_Item_12) == 0x000138, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Get_Item_12' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_Length_ReturnValue_2) == 0x000140, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_IsVisible_ReturnValue_1) == 0x000144, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Subtract_IntInt_ReturnValue_6) == 0x000148, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Subtract_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Not_PreBool_ReturnValue_1) == 0x00014C, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Max_ReturnValue_1) == 0x000150, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Array_IsValidIndex_ReturnValue_7) == 0x000154, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Array_IsValidIndex_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Greater_IntInt_ReturnValue) == 0x000155, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_FileExists_ReturnValue) == 0x000156, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_FileExists_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_FileExists_ReturnValue_1) == 0x000157, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_FileExists_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_BooleanAND_ReturnValue_1) == 0x000158, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_IsValid_ReturnValue_3) == 0x000159, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, K2Node_DynamicCast_AsUI_Photo_Thumbnail) == 0x000160, "Member 'UI_Gallery_C_DeletePhoto::K2Node_DynamicCast_AsUI_Photo_Thumbnail' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'UI_Gallery_C_DeletePhoto::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, Temp_int_Loop_Counter_Variable_2) == 0x00016C, "Member 'UI_Gallery_C_DeletePhoto::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Less_IntInt_ReturnValue) == 0x000170, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Gallery_C_DeletePhoto, CallFunc_Add_IntInt_ReturnValue_3) == 0x000174, "Member 'UI_Gallery_C_DeletePhoto::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function UI_Gallery.UI_Gallery_C.ExecuteUbergraph_UI_Gallery
// 0x0630 (0x0630 - 0x0000)
struct UI_Gallery_C_ExecuteUbergraph_UI_Gallery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PhotosData                          K2Node_Event_PhotoData;                            // 0x0008(0x0030)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_PhotosData                          K2Node_MakeStruct_S_PhotosData;                    // 0x0038(0x0030)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NextFocusOnTheFirstPhoto;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_PrevFocusOnTheFirstPhoto_1;     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewPageIndex;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_PrevFocusOnTheFirstPhoto;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0074(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B0(0x0078)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x0128(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0160(0x0078)(ConstParm)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x01E8(0x0008)(NoDestructor)
	bool                                          CallFunc_IsUnderLocation_ReturnValue;              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_Key;                            // 0x01F8(0x0018)(ConstParm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsMouseButton_ReturnValue;            // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsKeyboardKey_ReturnValue;            // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0217(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_TabIndex;                             // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_TabButton_C*                        K2Node_Event_CommonButtonPressed;                  // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23E[0x2];                                      // 0x023E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Screenshot_File_IsValid_;             // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Get_Screenshot_File_2D_Image;             // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_Screenshot_File_Base_Filename;        // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_Screenshot_File_Full_File_Path;       // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_4;          // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_5;          // 0x027F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_6;          // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_7;          // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0286(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_287[0x1];                                      // 0x0287(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoThumbnail_C*                   K2Node_DynamicCast_AsUI_Photo_Thumbnail;           // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PhotosData                          K2Node_MakeStruct_S_PhotosData_1;                  // 0x0298(0x0030)(ZeroConstructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x02C8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_8;          // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_9;          // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_10;         // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_11;         // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x02E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E7[0x1];                                      // 0x02E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable_1;                            // 0x02E8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_12;         // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_13;         // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_14;         // 0x0305(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_15;         // 0x0306(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0307(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_16;         // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PhotosData                          CallFunc_Array_Get_Item;                           // 0x0320(0x0030)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_17;         // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PhotosData                          K2Node_MakeStruct_S_PhotosData_2;                  // 0x0358(0x0030)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Select_Default;                             // 0x0390(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item_1;                         // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x2];                                      // 0x03BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
