#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_GoreSettings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_GoreSettings.UI_GoreSettings_C.BndEvt__UI_Settings_AuVi_Slider_1_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_GoreSettings_C_BndEvt__UI_Settings_AuVi_Slider_1_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_BndEvt__UI_Settings_AuVi_Slider_1_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_GoreSettings_C_BndEvt__UI_Settings_AuVi_Slider_1_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_GoreSettings_C_BndEvt__UI_Settings_AuVi_Slider_1_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_GoreSettings_C_BndEvt__UI_Settings_AuVi_Slider_1_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_GoreSettings_C_BndEvt__UI_Settings_AuVi_Slider_1_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UI_GoreSettings_C_BndEvt__UI_Settings_AuVi_Slider_1_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.BndEvt__UI_Settings_Game_BodyDensitySlid_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_GoreSettings_C_BndEvt__UI_Settings_Game_BodyDensitySlid_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_BndEvt__UI_Settings_Game_BodyDensitySlid_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_GoreSettings_C_BndEvt__UI_Settings_Game_BodyDensitySlid_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_GoreSettings_C_BndEvt__UI_Settings_Game_BodyDensitySlid_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_GoreSettings_C_BndEvt__UI_Settings_Game_BodyDensitySlid_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_GoreSettings_C_BndEvt__UI_Settings_Game_BodyDensitySlid_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UI_GoreSettings_C_BndEvt__UI_Settings_Game_BodyDensitySlid_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.ExecuteUbergraph_UI_GoreSettings
// 0x01F0 (0x01F0 - 0x0000)
struct UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_AudioSettings_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_9;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Controls_C*                         CallFunc_Create_ReturnValue_1;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWillie_BP_C*                           K2Node_DynamicCast_AsWillie_BP;                    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_DisplaySettings_C*                  CallFunc_Create_ReturnValue_2;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_3;                     // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_4;                     // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         K2Node_DynamicCast_AsSG_Settings;                  // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_2;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0184(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_2;                           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_3;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Gore_Rate_ImplicitCast;         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Blood_Rate_ImplicitCast;        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings) == 0x000008, "Wrong alignment on UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings");
static_assert(sizeof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings) == 0x0001F0, "Wrong size on UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, EntryPoint) == 0x000000, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_int_Variable) == 0x000010, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable) == 0x000018, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_1) == 0x000020, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_2) == 0x000028, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_int_Variable_1) == 0x000030, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_3) == 0x000038, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_4) == 0x000040, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_5) == 0x000048, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_int_Variable_2) == 0x000050, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_6) == 0x000058, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_7) == 0x000060, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_8) == 0x000068, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_int_Variable_3) == 0x000070, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_9) == 0x000078, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_10) == 0x000080, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_10' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, Temp_real_Variable_11) == 0x000088, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::Temp_real_Variable_11' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_Create_ReturnValue_1) == 0x000090, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_Select_Default) == 0x000098, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_GetPlayerController_ReturnValue) == 0x0000A0, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_GetGameInstance_ReturnValue) == 0x0000A8, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_IsInputKeyDown_ReturnValue) == 0x0000B0, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_DynamicCast_AsGI_Settings) == 0x0000B8, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000C8, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_DynamicCast_AsWillie_BP) == 0x0000D0, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_DynamicCast_AsWillie_BP' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000E0, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_IsInputKeyDown_ReturnValue_1) == 0x0000E8, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_IsInputKeyDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_ComponentBoundEvent_Value_1) == 0x0000EC, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_Create_ReturnValue_2) == 0x0000F0, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_ComponentBoundEvent_Value) == 0x0000F8, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_PlayAnimation_ReturnValue) == 0x000100, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_PlayAnimation_ReturnValue_1) == 0x000108, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_PlayAnimation_ReturnValue_2) == 0x000110, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_PlayAnimation_ReturnValue_3) == 0x000118, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_PlayAnimation_ReturnValue_4) == 0x000120, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_PlayAnimation_ReturnValue_5) == 0x000128, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_PlayAnimation_ReturnValue_6) == 0x000130, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_Create_ReturnValue_3) == 0x000138, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_PlayAnimation_ReturnValue_7) == 0x000140, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_Create_ReturnValue_4) == 0x000148, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000150, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000158, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_DynamicCast_AsSG_Settings) == 0x000160, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_DynamicCast_AsSG_Settings' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000170, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_GetPlayerController_ReturnValue_2) == 0x000178, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_IsInputKeyDown_ReturnValue_2) == 0x000180, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_IsInputKeyDown_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_Event_MyGeometry) == 0x000184, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_Event_InDeltaTime) == 0x0001BC, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_BooleanOR_ReturnValue) == 0x0001C0, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, CallFunc_BooleanOR_ReturnValue_1) == 0x0001C1, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_Event_IsDesignTime) == 0x0001C2, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_Select_Default_1) == 0x0001C8, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_Select_Default_2) == 0x0001D0, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_Select_Default_3) == 0x0001D8, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_VariableSet_Gore_Rate_ImplicitCast) == 0x0001E0, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_VariableSet_Gore_Rate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings, K2Node_VariableSet_Blood_Rate_ImplicitCast) == 0x0001E8, "Member 'UI_GoreSettings_C_ExecuteUbergraph_UI_GoreSettings::K2Node_VariableSet_Blood_Rate_ImplicitCast' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.Get_BoneSnappingSlid_Value
// 0x0008 (0x0008 - 0x0000)
struct UI_GoreSettings_C_Get_BoneSnappingSlid_Value final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_Get_BoneSnappingSlid_Value) == 0x000004, "Wrong alignment on UI_GoreSettings_C_Get_BoneSnappingSlid_Value");
static_assert(sizeof(UI_GoreSettings_C_Get_BoneSnappingSlid_Value) == 0x000008, "Wrong size on UI_GoreSettings_C_Get_BoneSnappingSlid_Value");
static_assert(offsetof(UI_GoreSettings_C_Get_BoneSnappingSlid_Value, ReturnValue) == 0x000000, "Member 'UI_GoreSettings_C_Get_BoneSnappingSlid_Value::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_Get_BoneSnappingSlid_Value, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GoreSettings_C_Get_BoneSnappingSlid_Value::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.Get_Slider_DamagePlayer_Value
// 0x0008 (0x0008 - 0x0000)
struct UI_GoreSettings_C_Get_Slider_DamagePlayer_Value final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_Get_Slider_DamagePlayer_Value) == 0x000004, "Wrong alignment on UI_GoreSettings_C_Get_Slider_DamagePlayer_Value");
static_assert(sizeof(UI_GoreSettings_C_Get_Slider_DamagePlayer_Value) == 0x000008, "Wrong size on UI_GoreSettings_C_Get_Slider_DamagePlayer_Value");
static_assert(offsetof(UI_GoreSettings_C_Get_Slider_DamagePlayer_Value, ReturnValue) == 0x000000, "Member 'UI_GoreSettings_C_Get_Slider_DamagePlayer_Value::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_Get_Slider_DamagePlayer_Value, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GoreSettings_C_Get_Slider_DamagePlayer_Value::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.Get_Slider_LockOnSlider_Value
// 0x0008 (0x0008 - 0x0000)
struct UI_GoreSettings_C_Get_Slider_LockOnSlider_Value final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_Get_Slider_LockOnSlider_Value) == 0x000004, "Wrong alignment on UI_GoreSettings_C_Get_Slider_LockOnSlider_Value");
static_assert(sizeof(UI_GoreSettings_C_Get_Slider_LockOnSlider_Value) == 0x000008, "Wrong size on UI_GoreSettings_C_Get_Slider_LockOnSlider_Value");
static_assert(offsetof(UI_GoreSettings_C_Get_Slider_LockOnSlider_Value, ReturnValue) == 0x000000, "Member 'UI_GoreSettings_C_Get_Slider_LockOnSlider_Value::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_Get_Slider_LockOnSlider_Value, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GoreSettings_C_Get_Slider_LockOnSlider_Value::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.GetBrush
// 0x01E0 (0x01E0 - 0x0000)
struct UI_GoreSettings_C_GetBrush final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Variable;                                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0110(0x00D0)()
};
static_assert(alignof(UI_GoreSettings_C_GetBrush) == 0x000010, "Wrong alignment on UI_GoreSettings_C_GetBrush");
static_assert(sizeof(UI_GoreSettings_C_GetBrush) == 0x0001E0, "Wrong size on UI_GoreSettings_C_GetBrush");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, ReturnValue) == 0x000000, "Member 'UI_GoreSettings_C_GetBrush::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, Temp_int_Variable) == 0x0000D0, "Member 'UI_GoreSettings_C_GetBrush::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, Temp_object_Variable) == 0x0000D8, "Member 'UI_GoreSettings_C_GetBrush::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, Temp_object_Variable_1) == 0x0000E0, "Member 'UI_GoreSettings_C_GetBrush::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, Temp_object_Variable_2) == 0x0000E8, "Member 'UI_GoreSettings_C_GetBrush::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'UI_GoreSettings_C_GetBrush::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'UI_GoreSettings_C_GetBrush::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, CallFunc_Round_ReturnValue) == 0x000100, "Member 'UI_GoreSettings_C_GetBrush::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, CallFunc_Clamp_ReturnValue) == 0x000104, "Member 'UI_GoreSettings_C_GetBrush::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, K2Node_Select_Default) == 0x000108, "Member 'UI_GoreSettings_C_GetBrush::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetBrush, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000110, "Member 'UI_GoreSettings_C_GetBrush::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.GetText
// 0x0070 (0x0070 - 0x0000)
struct UI_GoreSettings_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0010)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0010)()
};
static_assert(alignof(UI_GoreSettings_C_GetText) == 0x000008, "Wrong alignment on UI_GoreSettings_C_GetText");
static_assert(sizeof(UI_GoreSettings_C_GetText) == 0x000070, "Wrong size on UI_GoreSettings_C_GetText");
static_assert(offsetof(UI_GoreSettings_C_GetText, ReturnValue) == 0x000000, "Member 'UI_GoreSettings_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetText, Temp_int_Variable) == 0x000010, "Member 'UI_GoreSettings_C_GetText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetText, Temp_text_Variable) == 0x000018, "Member 'UI_GoreSettings_C_GetText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetText, Temp_text_Variable_1) == 0x000028, "Member 'UI_GoreSettings_C_GetText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetText, Temp_text_Variable_2) == 0x000038, "Member 'UI_GoreSettings_C_GetText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetText, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000048, "Member 'UI_GoreSettings_C_GetText::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetText, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'UI_GoreSettings_C_GetText::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetText, CallFunc_Round_ReturnValue) == 0x000058, "Member 'UI_GoreSettings_C_GetText::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetText, CallFunc_Clamp_ReturnValue) == 0x00005C, "Member 'UI_GoreSettings_C_GetText::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetText, K2Node_Select_Default) == 0x000060, "Member 'UI_GoreSettings_C_GetText::K2Node_Select_Default' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.GetValue
// 0x0008 (0x0008 - 0x0000)
struct UI_GoreSettings_C_GetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_GetValue) == 0x000004, "Wrong alignment on UI_GoreSettings_C_GetValue");
static_assert(sizeof(UI_GoreSettings_C_GetValue) == 0x000008, "Wrong size on UI_GoreSettings_C_GetValue");
static_assert(offsetof(UI_GoreSettings_C_GetValue, ReturnValue) == 0x000000, "Member 'UI_GoreSettings_C_GetValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetValue, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GoreSettings_C_GetValue::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.GetValue_0
// 0x0008 (0x0008 - 0x0000)
struct UI_GoreSettings_C_GetValue_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_GetValue_0) == 0x000004, "Wrong alignment on UI_GoreSettings_C_GetValue_0");
static_assert(sizeof(UI_GoreSettings_C_GetValue_0) == 0x000008, "Wrong size on UI_GoreSettings_C_GetValue_0");
static_assert(offsetof(UI_GoreSettings_C_GetValue_0, ReturnValue) == 0x000000, "Member 'UI_GoreSettings_C_GetValue_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetValue_0, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GoreSettings_C_GetValue_0::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.GetValue_1
// 0x0008 (0x0008 - 0x0000)
struct UI_GoreSettings_C_GetValue_1 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_GetValue_1) == 0x000004, "Wrong alignment on UI_GoreSettings_C_GetValue_1");
static_assert(sizeof(UI_GoreSettings_C_GetValue_1) == 0x000008, "Wrong size on UI_GoreSettings_C_GetValue_1");
static_assert(offsetof(UI_GoreSettings_C_GetValue_1, ReturnValue) == 0x000000, "Member 'UI_GoreSettings_C_GetValue_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetValue_1, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GoreSettings_C_GetValue_1::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.GetValue_2
// 0x0004 (0x0004 - 0x0000)
struct UI_GoreSettings_C_GetValue_2 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_GetValue_2) == 0x000004, "Wrong alignment on UI_GoreSettings_C_GetValue_2");
static_assert(sizeof(UI_GoreSettings_C_GetValue_2) == 0x000004, "Wrong size on UI_GoreSettings_C_GetValue_2");
static_assert(offsetof(UI_GoreSettings_C_GetValue_2, ReturnValue) == 0x000000, "Member 'UI_GoreSettings_C_GetValue_2::ReturnValue' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.GetValue_3
// 0x0008 (0x0008 - 0x0000)
struct UI_GoreSettings_C_GetValue_3 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_GetValue_3) == 0x000004, "Wrong alignment on UI_GoreSettings_C_GetValue_3");
static_assert(sizeof(UI_GoreSettings_C_GetValue_3) == 0x000008, "Wrong size on UI_GoreSettings_C_GetValue_3");
static_assert(offsetof(UI_GoreSettings_C_GetValue_3, ReturnValue) == 0x000000, "Member 'UI_GoreSettings_C_GetValue_3::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_GetValue_3, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GoreSettings_C_GetValue_3::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_GoreSettings_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_PreConstruct) == 0x000001, "Wrong alignment on UI_GoreSettings_C_PreConstruct");
static_assert(sizeof(UI_GoreSettings_C_PreConstruct) == 0x000001, "Wrong size on UI_GoreSettings_C_PreConstruct");
static_assert(offsetof(UI_GoreSettings_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_GoreSettings_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_GoreSettings.UI_GoreSettings_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_GoreSettings_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GoreSettings_C_Tick) == 0x000004, "Wrong alignment on UI_GoreSettings_C_Tick");
static_assert(sizeof(UI_GoreSettings_C_Tick) == 0x00003C, "Wrong size on UI_GoreSettings_C_Tick");
static_assert(offsetof(UI_GoreSettings_C_Tick, MyGeometry) == 0x000000, "Member 'UI_GoreSettings_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_GoreSettings_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_GoreSettings_C_Tick::InDeltaTime' has a wrong offset!");

}

