#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HUD

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_HUD.UI_HUD_C.ExecuteUbergraph_UI_HUD
// 0x03D8 (0x03D8 - 0x0000)
struct UI_HUD_C_ExecuteUbergraph_UI_HUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_3;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_4;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_5;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_6;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_7;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_8;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWillie_BP_C*                           K2Node_DynamicCast_AsWillie_BP;                    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue_9;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_10;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HalfSwordGameMode_C*                K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode;      // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_1;               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_2;               // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0217(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_3;               // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_2;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_4;               // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_3;          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_5;               // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_4;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_6;               // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_9;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_10;     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_5;          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_11;     // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_7;               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_12;     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_6;          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_8;               // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_13;     // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_14;     // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_7;          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_15;     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_9;               // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_16;     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_8;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_10;              // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_17;     // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_14;               // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_18;     // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_9;          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_19;     // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue_11;              // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_20;     // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_15;               // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_10;         // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_21;     // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_22;     // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_1;      // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_2;      // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_3;      // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_4;      // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_5;      // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_6;      // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_7;      // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_8;      // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_9;      // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_10;     // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast_11;     // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HUD_C_ExecuteUbergraph_UI_HUD) == 0x000008, "Wrong alignment on UI_HUD_C_ExecuteUbergraph_UI_HUD");
static_assert(sizeof(UI_HUD_C_ExecuteUbergraph_UI_HUD) == 0x0003D8, "Wrong size on UI_HUD_C_ExecuteUbergraph_UI_HUD");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, EntryPoint) == 0x000000, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue) == 0x000004, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000018, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_bool_Variable) == 0x000020, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable) == 0x000034, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_1) == 0x000035, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_bool_Variable_1) == 0x000036, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_2) == 0x000037, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_3) == 0x000038, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_bool_Variable_2) == 0x000039, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_4) == 0x00003A, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, Temp_byte_Variable_5) == 0x00003B, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000040, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000058, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BreakVector_X) == 0x000078, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BreakVector_Y) == 0x000080, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BreakVector_Z) == 0x000088, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000090, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MakeVector2D_ReturnValue) == 0x000098, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Event_MyGeometry) == 0x0000A8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Event_InDeltaTime) == 0x0000E0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue) == 0x0000E8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_FClamp_ReturnValue) == 0x0000F8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000100, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000108, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000110, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_3) == 0x000118, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_4) == 0x000120, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_5) == 0x000128, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_6) == 0x000130, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_7) == 0x000138, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_8) == 0x000140, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GetGameInstance_ReturnValue) == 0x000148, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_AsGI_Settings) == 0x000150, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_PlayAnimation_ReturnValue) == 0x000160, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_PlayAnimation_ReturnValue_1) == 0x000168, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000170, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Event_IsDesignTime) == 0x000178, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000180, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_AsWillie_BP) == 0x000188, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_AsWillie_BP' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_9) == 0x000198, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_MapRangeClamped_ReturnValue_10) == 0x0001A0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_MapRangeClamped_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001A8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0001B0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0001B1, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GetGameMode_ReturnValue) == 0x0001B8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode) == 0x0001C0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_AsBP_Half_Sword_Game_Mode' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_DynamicCast_bSuccess_2) == 0x0001C8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001C9, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001CA, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue) == 0x0001CB, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_1) == 0x0001CC, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0001D0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001D8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0001E0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0001E8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_1) == 0x0001F0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_SelectFloat_ReturnValue) == 0x0001F8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_3) == 0x000200, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_FClamp_ReturnValue_1) == 0x000208, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_2) == 0x000210, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_4) == 0x000211, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Select_Default) == 0x000212, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_3) == 0x000213, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_4) == 0x000214, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_2) == 0x000215, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_5) == 0x000216, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_5) == 0x000217, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_6) == 0x000218, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_1) == 0x000220, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000228, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Select_Default_1) == 0x000230, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000238, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_6) == 0x000240, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_3) == 0x000241, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_7) == 0x000242, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_7) == 0x000243, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_8) == 0x000244, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_2) == 0x000248, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_9) == 0x000250, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000258, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_10) == 0x000260, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000268, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_11) == 0x000270, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_BooleanAND_ReturnValue_12) == 0x000271, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_BooleanAND_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_4) == 0x000272, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_8) == 0x000273, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, K2Node_Select_Default_2) == 0x000274, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_3) == 0x000278, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000280, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_5) == 0x000288, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_8) == 0x000290, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_9) == 0x000298, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_4) == 0x0002A0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_6) == 0x0002A8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_9) == 0x0002B0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_10) == 0x0002B8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_10) == 0x0002C0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_5) == 0x0002C8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_11) == 0x0002D0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_7) == 0x0002D8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_12) == 0x0002E0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_11) == 0x0002E8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_6) == 0x0002F0, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_8) == 0x0002F8, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_13) == 0x000300, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_12) == 0x000308, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_14) == 0x000310, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_7) == 0x000318, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_15) == 0x000320, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_9) == 0x000328, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_16) == 0x000330, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_13) == 0x000338, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_8) == 0x000340, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_10) == 0x000348, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_17) == 0x000350, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_14) == 0x000358, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_18) == 0x000360, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Conv_BoolToDouble_ReturnValue_9) == 0x000368, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Conv_BoolToDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_19) == 0x000370, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_IsGamePaused_ReturnValue_11) == 0x000378, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_IsGamePaused_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Multiply_DoubleDouble_ReturnValue_20) == 0x000380, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Multiply_DoubleDouble_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(UI_HUD_C_ExecuteUbergraph_UI_HUD, CallFunc_Not_PreBool_ReturnValue_15) == 0x000388, "Member 'UI_HUD_C_ExecuteUbergraph_UI_HUD::CallFunc_Not_PreBool_ReturnValue_15' has a wrong offset!");
