#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_KeyBinds

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_KeyBinds.UI_KeyBinds_C
// 0x0080 (0x0360 - 0x02E0)
class UUI_KeyBinds_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverBack;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAudio;                                        // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverControls;                                     // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverGame;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverDisplay;                                      // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BackButton_1;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_2;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_27;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 Go_Back_To;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__UI_KeyBinds_BackButton_1_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_BackButton_1_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_BackButton_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_1_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_27_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_27_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_27_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_2_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_2_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_2_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_KeyBinds_Button_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_UI_KeyBinds(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_KeyBinds_C">();
	}
	static class UUI_KeyBinds_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_KeyBinds_C>();
	}
};
static_assert(alignof(UUI_KeyBinds_C) == 0x000008, "Wrong alignment on UUI_KeyBinds_C");
static_assert(sizeof(UUI_KeyBinds_C) == 0x000360, "Wrong size on UUI_KeyBinds_C");
static_assert(offsetof(UUI_KeyBinds_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_KeyBinds_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, HoverBack) == 0x0002E8, "Member 'UUI_KeyBinds_C::HoverBack' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, HoverAudio) == 0x0002F0, "Member 'UUI_KeyBinds_C::HoverAudio' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, HoverControls) == 0x0002F8, "Member 'UUI_KeyBinds_C::HoverControls' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, HoverGame) == 0x000300, "Member 'UUI_KeyBinds_C::HoverGame' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, HoverDisplay) == 0x000308, "Member 'UUI_KeyBinds_C::HoverDisplay' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, BackButton_1) == 0x000310, "Member 'UUI_KeyBinds_C::BackButton_1' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, Button) == 0x000318, "Member 'UUI_KeyBinds_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, Button_1) == 0x000320, "Member 'UUI_KeyBinds_C::Button_1' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, Button_2) == 0x000328, "Member 'UUI_KeyBinds_C::Button_2' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, Button_27) == 0x000330, "Member 'UUI_KeyBinds_C::Button_27' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, Image) == 0x000338, "Member 'UUI_KeyBinds_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, Image_0) == 0x000340, "Member 'UUI_KeyBinds_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, Image_1) == 0x000348, "Member 'UUI_KeyBinds_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, Image_2) == 0x000350, "Member 'UUI_KeyBinds_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUI_KeyBinds_C, Go_Back_To) == 0x000358, "Member 'UUI_KeyBinds_C::Go_Back_To' has a wrong offset!");

}

