#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Lose

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Lose.UI_Lose_C
// 0x0070 (0x0350 - 0x02E0)
class UUI_Lose_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DethPicUnfade;                                     // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RestartHover;                                      // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RestartButtonAppear;                               // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TextAppear;                                        // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade;                                              // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DeathPic;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Score;                                             // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AWillie_BP_C*                           My_Master__Willie_;                                // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Opacity;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Restart;                                       // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_Settings_C*                         GI_Settings;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_HalfSwordGameMode_C*                BP_Half_Sword_Game_Mode;                           // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_Lose(int32 EntryPoint);
	class FText Get_Score_Text();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Lose_C">();
	}
	static class UUI_Lose_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Lose_C>();
	}
};
static_assert(alignof(UUI_Lose_C) == 0x000008, "Wrong alignment on UUI_Lose_C");
static_assert(sizeof(UUI_Lose_C) == 0x000350, "Wrong size on UUI_Lose_C");
static_assert(offsetof(UUI_Lose_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_Lose_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, DethPicUnfade) == 0x0002E8, "Member 'UUI_Lose_C::DethPicUnfade' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, RestartHover) == 0x0002F0, "Member 'UUI_Lose_C::RestartHover' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, RestartButtonAppear) == 0x0002F8, "Member 'UUI_Lose_C::RestartButtonAppear' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, TextAppear) == 0x000300, "Member 'UUI_Lose_C::TextAppear' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, Fade) == 0x000308, "Member 'UUI_Lose_C::Fade' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, Black) == 0x000310, "Member 'UUI_Lose_C::Black' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, DeathPic) == 0x000318, "Member 'UUI_Lose_C::DeathPic' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, Score) == 0x000320, "Member 'UUI_Lose_C::Score' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, My_Master__Willie_) == 0x000328, "Member 'UUI_Lose_C::My_Master__Willie_' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, Current_Opacity) == 0x000330, "Member 'UUI_Lose_C::Current_Opacity' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, Can_Restart) == 0x000338, "Member 'UUI_Lose_C::Can_Restart' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, GI_Settings) == 0x000340, "Member 'UUI_Lose_C::GI_Settings' has a wrong offset!");
static_assert(offsetof(UUI_Lose_C, BP_Half_Sword_Game_Mode) == 0x000348, "Member 'UUI_Lose_C::BP_Half_Sword_Game_Mode' has a wrong offset!");

}

