#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PhotoPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_PhotoPage.UI_PhotoPage_C
// 0x0038 (0x0318 - 0x02E0)
class UUI_PhotoPage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanel*                      Page;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PhotosPerColumn;                                   // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PhotosPerRow;                                      // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUI_PhotoThumbnail_C*>           PhotosArray;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         PageIndex;                                         // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Gallery_C*                          GalleryReference;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_PhotoPage(int32 EntryPoint);
	void Initialize(class UUI_Gallery_C* GalleryReference_0, int32 PageIndex_0);
	void PreConstruct(bool IsDesignTime);
	void ResetPage();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdatePage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_PhotoPage_C">();
	}
	static class UUI_PhotoPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_PhotoPage_C>();
	}
};
static_assert(alignof(UUI_PhotoPage_C) == 0x000008, "Wrong alignment on UUI_PhotoPage_C");
static_assert(sizeof(UUI_PhotoPage_C) == 0x000318, "Wrong size on UUI_PhotoPage_C");
static_assert(offsetof(UUI_PhotoPage_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_PhotoPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_PhotoPage_C, Page) == 0x0002E8, "Member 'UUI_PhotoPage_C::Page' has a wrong offset!");
static_assert(offsetof(UUI_PhotoPage_C, PhotosPerColumn) == 0x0002F0, "Member 'UUI_PhotoPage_C::PhotosPerColumn' has a wrong offset!");
static_assert(offsetof(UUI_PhotoPage_C, PhotosPerRow) == 0x0002F4, "Member 'UUI_PhotoPage_C::PhotosPerRow' has a wrong offset!");
static_assert(offsetof(UUI_PhotoPage_C, PhotosArray) == 0x0002F8, "Member 'UUI_PhotoPage_C::PhotosArray' has a wrong offset!");
static_assert(offsetof(UUI_PhotoPage_C, PageIndex) == 0x000308, "Member 'UUI_PhotoPage_C::PageIndex' has a wrong offset!");
static_assert(offsetof(UUI_PhotoPage_C, GalleryReference) == 0x000310, "Member 'UUI_PhotoPage_C::GalleryReference' has a wrong offset!");

}

