#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Pause_Eng

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Pause_Eng.UI_Pause_Eng_C.ExecuteUbergraph_UI_Pause_Eng
// 0x0150 (0x0150 - 0x0000)
struct UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_DisplaySettings_C*                  CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_8;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_9;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_2;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue;             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_10;             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_11;             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_2;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_3;              // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng) == 0x000008, "Wrong alignment on UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng");
static_assert(sizeof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng) == 0x000150, "Wrong size on UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, EntryPoint) == 0x000000, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_SetGamePaused_ReturnValue) == 0x000004, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_SetGamePaused_ReturnValue_1) == 0x000005, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetPlayerController_ReturnValue_1) == 0x000010, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetPlayerController_ReturnValue_2) == 0x000018, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetPlayerController_ReturnValue_3) == 0x000020, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_Create_ReturnValue) == 0x000028, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_2) == 0x000040, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_3) == 0x000048, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_4) == 0x000050, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_5) == 0x000058, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_6) == 0x000060, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_7) == 0x000068, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetPlayerController_ReturnValue_4) == 0x000070, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_8) == 0x000078, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_IsInputKeyDown_ReturnValue) == 0x000080, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_9) == 0x000088, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetPlayerController_ReturnValue_5) == 0x000090, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_IsInputKeyDown_ReturnValue_1) == 0x000098, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_IsInputKeyDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetObjectClass_ReturnValue) == 0x0000A0, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_BooleanOR_ReturnValue) == 0x0000A8, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetPlayerController_ReturnValue_6) == 0x0000B0, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_IsInputKeyDown_ReturnValue_2) == 0x0000B8, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_IsInputKeyDown_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetPlayerController_ReturnValue_7) == 0x0000C0, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetPlayerController_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_BooleanOR_ReturnValue_1) == 0x0000C8, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_DeleteGameInSlot_ReturnValue) == 0x0000C9, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_DeleteGameInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_10) == 0x0000D0, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_PlayAnimation_ReturnValue_11) == 0x0000D8, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_PlayAnimation_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, Temp_bool_Variable) == 0x0000E0, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_Not_PreBool_ReturnValue) == 0x0000E1, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetGameMode_ReturnValue) == 0x0000E8, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_SetGamePaused_ReturnValue_2) == 0x0000F0, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_SetGamePaused_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_SetGamePaused_ReturnValue_3) == 0x0000F1, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_SetGamePaused_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, K2Node_Event_MyGeometry) == 0x0000F4, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, K2Node_Event_InDeltaTime) == 0x00012C, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetGameInstance_ReturnValue) == 0x000130, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, K2Node_DynamicCast_AsGI_Settings) == 0x000138, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng, CallFunc_GetGameMode_ReturnValue_1) == 0x000148, "Member 'UI_Pause_Eng_C_ExecuteUbergraph_UI_Pause_Eng::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");

// Function UI_Pause_Eng.UI_Pause_Eng_C.SetLastOpenedWidget
// 0x0008 (0x0008 - 0x0000)
struct UI_Pause_Eng_C_SetLastOpenedWidget final
{
public:
	class UClass*                                 UW;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Pause_Eng_C_SetLastOpenedWidget) == 0x000008, "Wrong alignment on UI_Pause_Eng_C_SetLastOpenedWidget");
static_assert(sizeof(UI_Pause_Eng_C_SetLastOpenedWidget) == 0x000008, "Wrong size on UI_Pause_Eng_C_SetLastOpenedWidget");
static_assert(offsetof(UI_Pause_Eng_C_SetLastOpenedWidget, UW) == 0x000000, "Member 'UI_Pause_Eng_C_SetLastOpenedWidget::UW' has a wrong offset!");

// Function UI_Pause_Eng.UI_Pause_Eng_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Pause_Eng_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Pause_Eng_C_Tick) == 0x000004, "Wrong alignment on UI_Pause_Eng_C_Tick");
static_assert(sizeof(UI_Pause_Eng_C_Tick) == 0x00003C, "Wrong size on UI_Pause_Eng_C_Tick");
static_assert(offsetof(UI_Pause_Eng_C_Tick, MyGeometry) == 0x000000, "Member 'UI_Pause_Eng_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Pause_Eng_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_Pause_Eng_C_Tick::InDeltaTime' has a wrong offset!");

}

