#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PhotoMode

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_PhotoResolutions_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "S_PhotosData_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "S_PostProcessRendering_structs.hpp"
#include "S_PostProcessFilter_structs.hpp"
#include "S_Logos_structs.hpp"
#include "E_ColorGradingMode_structs.hpp"


namespace SDK::Params
{

// Function UI_PhotoMode.UI_PhotoMode_C.ActiveTab
// 0x0820 (0x0820 - 0x0000)
struct UI_PhotoMode_C_ActiveTab final
{
public:
	int32                                         TabIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_TabButton_C*                        ButtonToNotModify;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FButtonStyle                           NormalTabStyle;                                    // 0x0010(0x03F0)(Edit, BlueprintVisible)
	struct FButtonStyle                           ActiveTabStyle;                                    // 0x0400(0x03F0)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_TabButton_C*                        CallFunc_Array_Get_Item;                           // 0x07F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0804(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_805[0x3];                                      // 0x0805(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x080C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80D[0x3];                                      // 0x080D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_ActiveTab) == 0x000010, "Wrong alignment on UI_PhotoMode_C_ActiveTab");
static_assert(sizeof(UI_PhotoMode_C_ActiveTab) == 0x000820, "Wrong size on UI_PhotoMode_C_ActiveTab");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, TabIndex) == 0x000000, "Member 'UI_PhotoMode_C_ActiveTab::TabIndex' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, ButtonToNotModify) == 0x000008, "Member 'UI_PhotoMode_C_ActiveTab::ButtonToNotModify' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, NormalTabStyle) == 0x000010, "Member 'UI_PhotoMode_C_ActiveTab::NormalTabStyle' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, ActiveTabStyle) == 0x000400, "Member 'UI_PhotoMode_C_ActiveTab::ActiveTabStyle' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, Temp_int_Array_Index_Variable) == 0x0007F0, "Member 'UI_PhotoMode_C_ActiveTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, CallFunc_Array_Get_Item) == 0x0007F8, "Member 'UI_PhotoMode_C_ActiveTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, CallFunc_Array_Length_ReturnValue) == 0x000800, "Member 'UI_PhotoMode_C_ActiveTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000804, "Member 'UI_PhotoMode_C_ActiveTab::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, Temp_int_Loop_Counter_Variable) == 0x000808, "Member 'UI_PhotoMode_C_ActiveTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, CallFunc_Less_IntInt_ReturnValue) == 0x00080C, "Member 'UI_PhotoMode_C_ActiveTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_ActiveTab, CallFunc_Add_IntInt_ReturnValue) == 0x000810, "Member 'UI_PhotoMode_C_ActiveTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature) == 0x000018, "Wrong size on UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature, OptionIndex) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature::OptionIndex' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature, OptionText) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature::OptionText' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature) == 0x000001, "Wrong alignment on UI_PhotoMode_C_BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature) == 0x000001, "Wrong size on UI_PhotoMode_C_BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature, Value) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_PhotoMode_C_BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature) == 0x000001, "Wrong alignment on UI_PhotoMode_C_BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature) == 0x000001, "Wrong size on UI_PhotoMode_C_BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature, Value) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature) == 0x000018, "Wrong size on UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature, OptionIndex) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature::OptionIndex' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature, OptionText) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature::OptionText' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature) == 0x000018, "Wrong size on UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature, OptionIndex) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature::OptionIndex' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature, OptionText) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature::OptionText' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature) == 0x000018, "Wrong size on UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature, OptionIndex) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature::OptionIndex' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature, OptionText) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature::OptionText' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature) == 0x000001, "Wrong alignment on UI_PhotoMode_C_BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature) == 0x000001, "Wrong size on UI_PhotoMode_C_BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature, Value) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_PhotoMode_C_BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature) == 0x000001, "Wrong alignment on UI_PhotoMode_C_BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature) == 0x000001, "Wrong size on UI_PhotoMode_C_BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature, Value) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature) == 0x000018, "Wrong size on UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature, OptionIndex) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature::OptionIndex' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature, OptionText) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature::OptionText' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature) == 0x000010, "Wrong size on UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature, SliderValue) == 0x000000, "Member 'UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature::SliderValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature, bReset) == 0x000008, "Member 'UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature::bReset' has a wrong offset!");

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LogoVerticalAlignment_K2Node_ComponentBoundEvent_26_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LogoVerticalAlignment_K2Node_ComponentBoundEvent_26_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoMode_C_BndEvt__LogoVerticalAlignment_K2Node_ComponentBoundEvent_26_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_PhotoMode_C_BndEvt__LogoVerticalAlignment_K2Node_ComponentBoundEvent_26_OnSliderValueChanged__DelegateSignature");
