#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Pause

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Pause.UI_Pause_C.ExecuteUbergraph_UI_Pause
// 0x0140 (0x0140 - 0x0000)
struct UI_Pause_C_ExecuteUbergraph_UI_Pause final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_DisplaySettings_C*                  CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_8;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_9;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_2;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_10;             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_11;             // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue_1;           // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_2;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Pause_C_ExecuteUbergraph_UI_Pause) == 0x000008, "Wrong alignment on UI_Pause_C_ExecuteUbergraph_UI_Pause");
static_assert(sizeof(UI_Pause_C_ExecuteUbergraph_UI_Pause) == 0x000140, "Wrong size on UI_Pause_C_ExecuteUbergraph_UI_Pause");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, EntryPoint) == 0x000000, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, K2Node_Event_MyGeometry) == 0x000004, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_SetGamePaused_ReturnValue) == 0x000040, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_SetGamePaused_ReturnValue_1) == 0x000041, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_GetPlayerController_ReturnValue_1) == 0x000050, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_GetPlayerController_ReturnValue_2) == 0x000058, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_GetPlayerController_ReturnValue_3) == 0x000060, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_Create_ReturnValue) == 0x000068, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_1) == 0x000078, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_2) == 0x000080, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_3) == 0x000088, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_4) == 0x000090, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_5) == 0x000098, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_6) == 0x0000A0, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_7) == 0x0000A8, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_GetPlayerController_ReturnValue_4) == 0x0000B0, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_8) == 0x0000B8, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_IsInputKeyDown_ReturnValue) == 0x0000C0, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_9) == 0x0000C8, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_GetPlayerController_ReturnValue_5) == 0x0000D0, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_IsInputKeyDown_ReturnValue_1) == 0x0000D8, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_IsInputKeyDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_GetObjectClass_ReturnValue) == 0x0000E0, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_BooleanOR_ReturnValue) == 0x0000E8, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_GetPlayerController_ReturnValue_6) == 0x0000F0, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_IsInputKeyDown_ReturnValue_2) == 0x0000F8, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_IsInputKeyDown_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_GetPlayerController_ReturnValue_7) == 0x000100, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_GetPlayerController_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_BooleanOR_ReturnValue_1) == 0x000108, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, Temp_bool_Variable) == 0x000109, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_10) == 0x000110, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_Not_PreBool_ReturnValue) == 0x000118, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_PlayAnimation_ReturnValue_11) == 0x000120, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_PlayAnimation_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_DeleteGameInSlot_ReturnValue) == 0x000128, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_DeleteGameInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_DeleteGameInSlot_ReturnValue_1) == 0x000129, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_DeleteGameInSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_GetGameMode_ReturnValue) == 0x000130, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_ExecuteUbergraph_UI_Pause, CallFunc_SetGamePaused_ReturnValue_2) == 0x000138, "Member 'UI_Pause_C_ExecuteUbergraph_UI_Pause::CallFunc_SetGamePaused_ReturnValue_2' has a wrong offset!");

// Function UI_Pause.UI_Pause_C.SetLastOpenedWidget
// 0x0008 (0x0008 - 0x0000)
struct UI_Pause_C_SetLastOpenedWidget final
{
public:
	class UClass*                                 UW;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Pause_C_SetLastOpenedWidget) == 0x000008, "Wrong alignment on UI_Pause_C_SetLastOpenedWidget");
static_assert(sizeof(UI_Pause_C_SetLastOpenedWidget) == 0x000008, "Wrong size on UI_Pause_C_SetLastOpenedWidget");
static_assert(offsetof(UI_Pause_C_SetLastOpenedWidget, UW) == 0x000000, "Member 'UI_Pause_C_SetLastOpenedWidget::UW' has a wrong offset!");

// Function UI_Pause.UI_Pause_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Pause_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Pause_C_Tick) == 0x000004, "Wrong alignment on UI_Pause_C_Tick");
static_assert(sizeof(UI_Pause_C_Tick) == 0x00003C, "Wrong size on UI_Pause_C_Tick");
static_assert(offsetof(UI_Pause_C_Tick, MyGeometry) == 0x000000, "Member 'UI_Pause_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Pause_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_Pause_C_Tick::InDeltaTime' has a wrong offset!");

}

