#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Selector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_Selector.UI_Selector_C.AddOption
// 0x0030 (0x0030 - 0x0000)
struct UI_Selector_C_AddOption final
{
public:
	class FText                                   NewOption;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMaxValue_InValue_ImplicitCast;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Selector_C_AddOption) == 0x000008, "Wrong alignment on UI_Selector_C_AddOption");
static_assert(sizeof(UI_Selector_C_AddOption) == 0x000030, "Wrong size on UI_Selector_C_AddOption");
static_assert(offsetof(UI_Selector_C_AddOption, NewOption) == 0x000000, "Member 'UI_Selector_C_AddOption::NewOption' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOption, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'UI_Selector_C_AddOption::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOption, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'UI_Selector_C_AddOption::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOption, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'UI_Selector_C_AddOption::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOption, CallFunc_SetMaxValue_InValue_ImplicitCast) == 0x000028, "Member 'UI_Selector_C_AddOption::CallFunc_SetMaxValue_InValue_ImplicitCast' has a wrong offset!");

// Function UI_Selector.UI_Selector_C.AddOptions(Name)
// 0x0040 (0x0040 - 0x0000)
struct UI_Selector_C_AddOptions_Name_ final
{
public:
	TArray<class FName>                           Options_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0028(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Selector_C_AddOptions_Name_) == 0x000008, "Wrong alignment on UI_Selector_C_AddOptions_Name_");
static_assert(sizeof(UI_Selector_C_AddOptions_Name_) == 0x000040, "Wrong size on UI_Selector_C_AddOptions_Name_");
static_assert(offsetof(UI_Selector_C_AddOptions_Name_, Options_0) == 0x000000, "Member 'UI_Selector_C_AddOptions_Name_::Options_0' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Name_, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'UI_Selector_C_AddOptions_Name_::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Name_, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UI_Selector_C_AddOptions_Name_::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Name_, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'UI_Selector_C_AddOptions_Name_::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Name_, CallFunc_Array_Get_Item) == 0x00001C, "Member 'UI_Selector_C_AddOptions_Name_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Name_, CallFunc_Conv_NameToText_ReturnValue) == 0x000028, "Member 'UI_Selector_C_AddOptions_Name_::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Name_, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'UI_Selector_C_AddOptions_Name_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Name_, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'UI_Selector_C_AddOptions_Name_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function UI_Selector.UI_Selector_C.AddOptions(String)
// 0x0048 (0x0048 - 0x0000)
struct UI_Selector_C_AddOptions_String_ final
{
public:
	TArray<class FString>                         Options_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Selector_C_AddOptions_String_) == 0x000008, "Wrong alignment on UI_Selector_C_AddOptions_String_");
static_assert(sizeof(UI_Selector_C_AddOptions_String_) == 0x000048, "Wrong size on UI_Selector_C_AddOptions_String_");
static_assert(offsetof(UI_Selector_C_AddOptions_String_, Options_0) == 0x000000, "Member 'UI_Selector_C_AddOptions_String_::Options_0' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_String_, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'UI_Selector_C_AddOptions_String_::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_String_, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UI_Selector_C_AddOptions_String_::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_String_, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'UI_Selector_C_AddOptions_String_::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_String_, CallFunc_Array_Get_Item) == 0x000020, "Member 'UI_Selector_C_AddOptions_String_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_String_, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'UI_Selector_C_AddOptions_String_::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_String_, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'UI_Selector_C_AddOptions_String_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_String_, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'UI_Selector_C_AddOptions_String_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function UI_Selector.UI_Selector_C.AddOptions(Text)
// 0x0038 (0x0038 - 0x0000)
struct UI_Selector_C_AddOptions_Text_ final
{
public:
	TArray<class FText>                           Options_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Selector_C_AddOptions_Text_) == 0x000008, "Wrong alignment on UI_Selector_C_AddOptions_Text_");
static_assert(sizeof(UI_Selector_C_AddOptions_Text_) == 0x000038, "Wrong size on UI_Selector_C_AddOptions_Text_");
static_assert(offsetof(UI_Selector_C_AddOptions_Text_, Options_0) == 0x000000, "Member 'UI_Selector_C_AddOptions_Text_::Options_0' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Text_, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'UI_Selector_C_AddOptions_Text_::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Text_, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UI_Selector_C_AddOptions_Text_::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Text_, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'UI_Selector_C_AddOptions_Text_::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Text_, CallFunc_Array_Get_Item) == 0x000020, "Member 'UI_Selector_C_AddOptions_Text_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Text_, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UI_Selector_C_AddOptions_Text_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_AddOptions_Text_, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'UI_Selector_C_AddOptions_Text_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function UI_Selector.UI_Selector_C.BndEvt__Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_Selector_C_BndEvt__Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Selector_C_BndEvt__Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_Selector_C_BndEvt__Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_Selector_C_BndEvt__Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_Selector_C_BndEvt__Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_Selector_C_BndEvt__Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UI_Selector_C_BndEvt__Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UI_Selector.UI_Selector_C.ChangeValue
// 0x0010 (0x0010 - 0x0000)
struct UI_Selector_C_ChangeValue final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldFocus_0;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Selector_C_ChangeValue) == 0x000008, "Wrong alignment on UI_Selector_C_ChangeValue");
static_assert(sizeof(UI_Selector_C_ChangeValue) == 0x000010, "Wrong size on UI_Selector_C_ChangeValue");
static_assert(offsetof(UI_Selector_C_ChangeValue, Value) == 0x000000, "Member 'UI_Selector_C_ChangeValue::Value' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ChangeValue, bShouldFocus_0) == 0x000008, "Member 'UI_Selector_C_ChangeValue::bShouldFocus_0' has a wrong offset!");

// Function UI_Selector.UI_Selector_C.ExecuteUbergraph_UI_Selector
// 0x0258 (0x0258 - 0x0000)
struct UI_Selector_C_ExecuteUbergraph_UI_Selector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isPhotoModeOpened_bIsOpened;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        CallFunc_isPhotoModeOpened_WidgetReference;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isPhotoModeOpened_bIsOpened_1;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        CallFunc_isPhotoModeOpened_WidgetReference_1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isPhotoModeOpened_bIsOpened_2;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        CallFunc_isPhotoModeOpened_WidgetReference_2;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isPhotoModeOpened_bIsOpened_3;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        CallFunc_isPhotoModeOpened_WidgetReference_3;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldFocus_1;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bResetThisSlider;               // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0090(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00C8(0x0078)(ConstParm)
	double                                        K2Node_CustomEvent_Value;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldFocus;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0150(0x0078)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedOption_SelectedIndex;          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSelectedOption_SelectedOption;         // 0x01D0(0x0010)()
	bool                                          CallFunc_isPhotoModeOpened_bIsOpened_4;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        CallFunc_isPhotoModeOpened_WidgetReference_4;      // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F3[0x5];                                      // 0x01F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isPhotoModeOpened_bIsOpened_5;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        CallFunc_isPhotoModeOpened_WidgetReference_5;      // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_1;          // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_2;          // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_3;          // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_4;          // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_5;          // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Selector_C_ExecuteUbergraph_UI_Selector) == 0x000008, "Wrong alignment on UI_Selector_C_ExecuteUbergraph_UI_Selector");
static_assert(sizeof(UI_Selector_C_ExecuteUbergraph_UI_Selector) == 0x000258, "Wrong size on UI_Selector_C_ExecuteUbergraph_UI_Selector");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, EntryPoint) == 0x000000, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, Temp_bool_Has_Been_Initd_Variable) == 0x000007, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_bIsOpened) == 0x000008, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_bIsOpened' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_WidgetReference) == 0x000010, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_WidgetReference' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue_2) == 0x000018, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue_3) == 0x000019, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_bIsOpened_1) == 0x00001A, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_bIsOpened_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_WidgetReference_1) == 0x000020, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_WidgetReference_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_bIsOpened_2) == 0x000028, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_bIsOpened_2' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_WidgetReference_2) == 0x000030, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_WidgetReference_2' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue_4) == 0x000038, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_bIsOpened_3) == 0x000039, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_bIsOpened_3' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_WidgetReference_3) == 0x000040, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_WidgetReference_3' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue_5) == 0x000048, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, K2Node_Event_IsDesignTime) == 0x000049, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_Array_LastIndex_ReturnValue) == 0x00004C, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_GetValue_ReturnValue) == 0x000050, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000058, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_FTrunc_ReturnValue) == 0x000068, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_GetValue_ReturnValue_1) == 0x00006C, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_GetIsEnabled_ReturnValue) == 0x000070, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_FTrunc_ReturnValue_1) == 0x000080, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_GetIsEnabled_ReturnValue_1) == 0x000084, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_GetIsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000085, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, K2Node_ComponentBoundEvent_Value) == 0x000088, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, K2Node_CustomEvent_bShouldFocus_1) == 0x00008C, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::K2Node_CustomEvent_bShouldFocus_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, K2Node_CustomEvent_bResetThisSlider) == 0x00008D, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::K2Node_CustomEvent_bResetThisSlider' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, K2Node_Event_MyGeometry) == 0x000090, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, K2Node_Event_MouseEvent_1) == 0x0000C8, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, K2Node_CustomEvent_Value) == 0x000140, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, K2Node_CustomEvent_bShouldFocus) == 0x000148, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::K2Node_CustomEvent_bShouldFocus' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, K2Node_Event_MouseEvent) == 0x000150, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue_6) == 0x0001C8, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue_7) == 0x0001C9, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_GetSelectedOption_SelectedIndex) == 0x0001CC, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_GetSelectedOption_SelectedIndex' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_GetSelectedOption_SelectedOption) == 0x0001D0, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_GetSelectedOption_SelectedOption' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_bIsOpened_4) == 0x0001E0, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_bIsOpened_4' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_WidgetReference_4) == 0x0001E8, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_WidgetReference_4' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue_8) == 0x0001F0, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue_9) == 0x0001F1, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0001F2, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_BreakVector2D_X) == 0x0001F8, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_BreakVector2D_Y) == 0x000200, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_bIsOpened_5) == 0x000208, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_bIsOpened_5' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_isPhotoModeOpened_WidgetReference_5) == 0x000210, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_isPhotoModeOpened_WidgetReference_5' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_IsValid_ReturnValue_10) == 0x000218, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000220, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000228, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_SetValue_InValue_ImplicitCast) == 0x000230, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_SetValue_InValue_ImplicitCast_1) == 0x000234, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_SetValue_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000238, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_SetValue_InValue_ImplicitCast_2) == 0x000240, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_SetValue_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_SetValue_InValue_ImplicitCast_3) == 0x000244, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_SetValue_InValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_SetValue_InValue_ImplicitCast_4) == 0x000248, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_SetValue_InValue_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_SetValue_InValue_ImplicitCast_5) == 0x00024C, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_SetValue_InValue_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000250, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_ExecuteUbergraph_UI_Selector, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000254, "Member 'UI_Selector_C_ExecuteUbergraph_UI_Selector::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function UI_Selector.UI_Selector_C.getFocusedOrUnfocusedColor
// 0x07F0 (0x07F0 - 0x0000)
struct UI_Selector_C_getFocusedOrUnfocusedColor final
{
public:
	bool                                          bChangeSliderColorWhenFocused;                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bChangeTextColorWhenFocused_0;                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USlider*                                Slider_0;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 imgLeftButton;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 imgRightButton;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                SliderTitle_0;                                     // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                SliderValue_0;                                     // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bSetMargin;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            LeftButtonColor;                                   // 0x0040(0x00D0)(Parm, OutParm)
	struct FSlateBrush                            RightButtonColor;                                  // 0x0110(0x00D0)(Parm, OutParm)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_2;                  // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_3;                  // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue_1;            // 0x01E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_4;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0210(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0224(0x0014)()
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0240(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0310(0x00D0)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x03E0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x03F4(0x0014)()
	bool                                          Temp_bool_Variable;                                // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x040C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0420(0x0014)()
	uint8                                         Pad_434[0xC];                                      // 0x0434(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0440(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x0510(0x00D0)()
	bool                                          Temp_bool_Variable_1;                              // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0xF];                                      // 0x05E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x05F0(0x00D0)()
	bool                                          Temp_bool_Variable_2;                              // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x3];                                      // 0x06C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x06C4(0x0014)()
	uint8                                         Pad_6D8[0x8];                                      // 0x06D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default_2;                           // 0x06E0(0x00D0)()
	bool                                          Temp_bool_Variable_3;                              // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B1[0x3];                                      // 0x07B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x07B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_Select_Default_3;                           // 0x07C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D4[0x4];                                      // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Selector_C_getFocusedOrUnfocusedColor) == 0x000010, "Wrong alignment on UI_Selector_C_getFocusedOrUnfocusedColor");
static_assert(sizeof(UI_Selector_C_getFocusedOrUnfocusedColor) == 0x0007F0, "Wrong size on UI_Selector_C_getFocusedOrUnfocusedColor");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, bChangeSliderColorWhenFocused) == 0x000000, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::bChangeSliderColorWhenFocused' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, bChangeTextColorWhenFocused_0) == 0x000001, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::bChangeTextColorWhenFocused_0' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, Slider_0) == 0x000008, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::Slider_0' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, imgLeftButton) == 0x000010, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::imgLeftButton' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, imgRightButton) == 0x000018, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::imgRightButton' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, SliderTitle_0) == 0x000020, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::SliderTitle_0' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, SliderValue_0) == 0x000028, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::SliderValue_0' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, bSetMargin) == 0x000030, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::bSetMargin' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, LeftButtonColor) == 0x000040, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::LeftButtonColor' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, RightButtonColor) == 0x000110, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::RightButtonColor' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_IsHovered_ReturnValue) == 0x0001E0, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_IsHovered_ReturnValue_1) == 0x0001E1, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_IsHovered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_IsHovered_ReturnValue_2) == 0x0001E2, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_IsHovered_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_IsHovered_ReturnValue_3) == 0x0001E3, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_IsHovered_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_HasAnyUserFocus_ReturnValue) == 0x0001E4, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_GetIsEnabled_ReturnValue) == 0x0001E5, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_HasAnyUserFocus_ReturnValue_1) == 0x0001E6, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_HasAnyUserFocus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_BooleanAND_ReturnValue) == 0x0001E7, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_IsHovered_ReturnValue_4) == 0x0001E8, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_IsHovered_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_BooleanOR_ReturnValue) == 0x0001E9, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_GetIsEnabled_ReturnValue_1) == 0x0001EA, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_GetIsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_BooleanOR_ReturnValue_1) == 0x0001EB, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_BooleanOR_ReturnValue_2) == 0x0001EC, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_BooleanOR_ReturnValue_3) == 0x0001ED, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_BooleanOR_ReturnValue_4) == 0x0001EE, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Selector_C_getFocusedOrUnfocusedColor, CallFunc_BooleanAND_ReturnValue_1) == 0x0001EF, "Member 'UI_Selector_C_getFocusedOrUnfocusedColor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
