#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_StartUpScreen_3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_StartUpScreen_3.UI_StartUpScreen_3_C
// 0x0030 (0x0310 - 0x02E0)
class UUI_StartUpScreen_3_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_Opened;                                         // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_StartUpScreen_3(int32 EntryPoint);
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_0(const struct FKey& Key);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_StartUpScreen_3_C">();
	}
	static class UUI_StartUpScreen_3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_StartUpScreen_3_C>();
	}
};
static_assert(alignof(UUI_StartUpScreen_3_C) == 0x000008, "Wrong alignment on UUI_StartUpScreen_3_C");
static_assert(sizeof(UUI_StartUpScreen_3_C) == 0x000310, "Wrong size on UUI_StartUpScreen_3_C");
static_assert(offsetof(UUI_StartUpScreen_3_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_StartUpScreen_3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_StartUpScreen_3_C, Fade) == 0x0002E8, "Member 'UUI_StartUpScreen_3_C::Fade' has a wrong offset!");
static_assert(offsetof(UUI_StartUpScreen_3_C, Image_0) == 0x0002F0, "Member 'UUI_StartUpScreen_3_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_StartUpScreen_3_C, Image_1) == 0x0002F8, "Member 'UUI_StartUpScreen_3_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_StartUpScreen_3_C, Image_2) == 0x000300, "Member 'UUI_StartUpScreen_3_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUI_StartUpScreen_3_C, Is_Opened) == 0x000308, "Member 'UUI_StartUpScreen_3_C::Is_Opened' has a wrong offset!");

}

