#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Selector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Selector.UI_Selector_C
// 0x0140 (0x0420 - 0x02E0)
class UUI_Selector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                btn_left;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                btn_right;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ElementsContainer;                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_left_btn;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_right_btn;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SliderName;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SliderSizeBox;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SliderValue;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SliderTitle;                                       // 0x0340(0x0010)(Edit, BlueprintVisible)
	class FText                                   Unit;                                              // 0x0350(0x0010)(Edit, BlueprintVisible)
	class FText                                   UnitPrefix;                                        // 0x0360(0x0010)(Edit, BlueprintVisible)
	class FText                                   SliderDefaultValueTip;                             // 0x0370(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bChangeTextColorWhenFocused;                       // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           FocusedSliderAndTextColor;                         // 0x0384(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnfocusedSliderAndTextColor;                       // 0x0394(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SliderSize;                                        // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultValue;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           Options;                                           // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUI_PhotoMode_C*                        PhotoModeWidgetReference;                          // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                MarginSize;                                        // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           BackgroundColor;                                   // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldFocus;                                      // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ResetDispatcher;                                   // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(int32 OptionIndex, class FText OptionText)> OnOptionChanged;                                   // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddOption(const class FText& NewOption);
	void AddOptions_Name_(TArray<class FName>& Options_0);
	void AddOptions_String_(TArray<class FString>& Options_0);
	void AddOptions_Text_(TArray<class FText>& Options_0);
	void BndEvt__btn_left_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__btn_right_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void ChangeValue(double Value, bool bShouldFocus_0);
	void ClearOptions();
	void Construct();
	void ExecuteUbergraph_UI_Selector(int32 EntryPoint);
	void FocusThisWidget();
	void FocusWithMouseWheel();
	void getFocusedOrUnfocusedColor(bool bChangeSliderColorWhenFocused, bool bChangeTextColorWhenFocused_0, class USlider* Slider_0, class UImage* imgLeftButton, class UImage* imgRightButton, class UWidget* SliderTitle_0, class UWidget* SliderValue_0, bool bSetMargin, struct FSlateBrush* LeftButtonColor, struct FSlateBrush* RightButtonColor);
	struct FSlateBrush getLeftButtonSettings();
	struct FSlateBrush getRightButtonSettings();
	void GetSelectedOption(int32* SelectedIndex, class FText* SelectedOption);
	class FText getTxtValue();
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void RemoveOption(const class FText& Item);
	void ResetSlider(bool bShouldFocus_0, bool bResetThisSlider);
	void ResetSliderFocus();
	void SetDefaultOptionByIndex(int32 DefaultIndex);
	void SetDefaultOptionByName(const class FText& ItemToFind, bool* bSuccess);
	void SetSliderFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Selector_C">();
	}
	static class UUI_Selector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Selector_C>();
	}
};
static_assert(alignof(UUI_Selector_C) == 0x000008, "Wrong alignment on UUI_Selector_C");
static_assert(sizeof(UUI_Selector_C) == 0x000420, "Wrong size on UUI_Selector_C");
static_assert(offsetof(UUI_Selector_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_Selector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, Border) == 0x0002E8, "Member 'UUI_Selector_C::Border' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, btn_left) == 0x0002F0, "Member 'UUI_Selector_C::btn_left' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, btn_right) == 0x0002F8, "Member 'UUI_Selector_C::btn_right' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, HorizontalBox_ElementsContainer) == 0x000300, "Member 'UUI_Selector_C::HorizontalBox_ElementsContainer' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, img_left_btn) == 0x000308, "Member 'UUI_Selector_C::img_left_btn' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, img_right_btn) == 0x000310, "Member 'UUI_Selector_C::img_right_btn' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, SizeBox) == 0x000318, "Member 'UUI_Selector_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, Slider) == 0x000320, "Member 'UUI_Selector_C::Slider' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, SliderName) == 0x000328, "Member 'UUI_Selector_C::SliderName' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, SliderSizeBox) == 0x000330, "Member 'UUI_Selector_C::SliderSizeBox' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, SliderValue) == 0x000338, "Member 'UUI_Selector_C::SliderValue' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, SliderTitle) == 0x000340, "Member 'UUI_Selector_C::SliderTitle' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, Unit) == 0x000350, "Member 'UUI_Selector_C::Unit' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, UnitPrefix) == 0x000360, "Member 'UUI_Selector_C::UnitPrefix' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, SliderDefaultValueTip) == 0x000370, "Member 'UUI_Selector_C::SliderDefaultValueTip' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, bChangeTextColorWhenFocused) == 0x000380, "Member 'UUI_Selector_C::bChangeTextColorWhenFocused' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, FocusedSliderAndTextColor) == 0x000384, "Member 'UUI_Selector_C::FocusedSliderAndTextColor' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, UnfocusedSliderAndTextColor) == 0x000394, "Member 'UUI_Selector_C::UnfocusedSliderAndTextColor' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, SliderSize) == 0x0003A8, "Member 'UUI_Selector_C::SliderSize' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, DefaultValue) == 0x0003B8, "Member 'UUI_Selector_C::DefaultValue' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, Options) == 0x0003C0, "Member 'UUI_Selector_C::Options' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, PhotoModeWidgetReference) == 0x0003D0, "Member 'UUI_Selector_C::PhotoModeWidgetReference' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, MarginSize) == 0x0003D8, "Member 'UUI_Selector_C::MarginSize' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, BackgroundColor) == 0x0003E8, "Member 'UUI_Selector_C::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, bShouldFocus) == 0x0003F8, "Member 'UUI_Selector_C::bShouldFocus' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, ResetDispatcher) == 0x000400, "Member 'UUI_Selector_C::ResetDispatcher' has a wrong offset!");
static_assert(offsetof(UUI_Selector_C, OnOptionChanged) == 0x000410, "Member 'UUI_Selector_C::OnOptionChanged' has a wrong offset!");

}

