#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_TabButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_TabButton.UI_TabButton_C.ExecuteUbergraph_UI_TabButton
// 0x0E90 (0x0E90 - 0x0000)
struct UI_TabButton_C_ExecuteUbergraph_UI_TabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        K2Node_CustomEvent_PhotoModeWidgetRef;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Data_C>           K2Node_DynamicCast_AsBPI_Data;                     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0030(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0100(0x03F0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x04F0(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_1;                   // 0x05C0(0x03F0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x09B0(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_2;                   // 0x0A80(0x03F0)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0E70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E71[0x3];                                      // 0x0E71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x0E74(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast_1;        // 0x0E7C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast_2;        // 0x0E84(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton) == 0x000010, "Wrong alignment on UI_TabButton_C_ExecuteUbergraph_UI_TabButton");
static_assert(sizeof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton) == 0x000E90, "Wrong size on UI_TabButton_C_ExecuteUbergraph_UI_TabButton");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, EntryPoint) == 0x000000, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_CustomEvent_PhotoModeWidgetRef) == 0x000008, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_CustomEvent_PhotoModeWidgetRef' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_DynamicCast_AsBPI_Data) == 0x000010, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_DynamicCast_AsBPI_Data' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_MakeStruct_SlateBrush) == 0x000030, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_MakeStruct_ButtonStyle) == 0x000100, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_MakeStruct_SlateBrush_1) == 0x0004F0, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_MakeStruct_ButtonStyle_1) == 0x0005C0, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_MakeStruct_ButtonStyle_1' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_MakeStruct_SlateBrush_2) == 0x0009B0, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_MakeStruct_ButtonStyle_2) == 0x000A80, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_MakeStruct_ButtonStyle_2' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_Event_IsDesignTime) == 0x000E70, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x000E74, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_MakeStruct_ImageSize_ImplicitCast_1) == 0x000E7C, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_MakeStruct_ImageSize_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_TabButton_C_ExecuteUbergraph_UI_TabButton, K2Node_MakeStruct_ImageSize_ImplicitCast_2) == 0x000E84, "Member 'UI_TabButton_C_ExecuteUbergraph_UI_TabButton::K2Node_MakeStruct_ImageSize_ImplicitCast_2' has a wrong offset!");

// Function UI_TabButton.UI_TabButton_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct UI_TabButton_C_Initialize final
{
public:
	class UUI_PhotoMode_C*                        PhotoModeWidgetRef_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TabButton_C_Initialize) == 0x000008, "Wrong alignment on UI_TabButton_C_Initialize");
static_assert(sizeof(UI_TabButton_C_Initialize) == 0x000008, "Wrong size on UI_TabButton_C_Initialize");
static_assert(offsetof(UI_TabButton_C_Initialize, PhotoModeWidgetRef_0) == 0x000000, "Member 'UI_TabButton_C_Initialize::PhotoModeWidgetRef_0' has a wrong offset!");

// Function UI_TabButton.UI_TabButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_TabButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TabButton_C_PreConstruct) == 0x000001, "Wrong alignment on UI_TabButton_C_PreConstruct");
static_assert(sizeof(UI_TabButton_C_PreConstruct) == 0x000001, "Wrong size on UI_TabButton_C_PreConstruct");
static_assert(offsetof(UI_TabButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_TabButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

