#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_WIN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_WIN.UI_WIN_C
// 0x0050 (0x0330 - 0x02E0)
class UUI_WIN_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TextFadeIn;                                        // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade;                                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YOUWON;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       WinAnim_0;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Hold_Meter;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HalfSwordGameMode_C*                BP_Half_Sword_Game_Mode;                           // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AWillie_BP_C*                           My_Master__Willie_;                                // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_WIN(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_WIN_C">();
	}
	static class UUI_WIN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_WIN_C>();
	}
};
static_assert(alignof(UUI_WIN_C) == 0x000008, "Wrong alignment on UUI_WIN_C");
static_assert(sizeof(UUI_WIN_C) == 0x000330, "Wrong size on UUI_WIN_C");
static_assert(offsetof(UUI_WIN_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_WIN_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_WIN_C, TextFadeIn) == 0x0002E8, "Member 'UUI_WIN_C::TextFadeIn' has a wrong offset!");
static_assert(offsetof(UUI_WIN_C, Fade) == 0x0002F0, "Member 'UUI_WIN_C::Fade' has a wrong offset!");
static_assert(offsetof(UUI_WIN_C, Image_0) == 0x0002F8, "Member 'UUI_WIN_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_WIN_C, Image_1) == 0x000300, "Member 'UUI_WIN_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_WIN_C, YOUWON) == 0x000308, "Member 'UUI_WIN_C::YOUWON' has a wrong offset!");
static_assert(offsetof(UUI_WIN_C, WinAnim_0) == 0x000310, "Member 'UUI_WIN_C::WinAnim_0' has a wrong offset!");
static_assert(offsetof(UUI_WIN_C, Hold_Meter) == 0x000318, "Member 'UUI_WIN_C::Hold_Meter' has a wrong offset!");
static_assert(offsetof(UUI_WIN_C, BP_Half_Sword_Game_Mode) == 0x000320, "Member 'UUI_WIN_C::BP_Half_Sword_Game_Mode' has a wrong offset!");
static_assert(offsetof(UUI_WIN_C, My_Master__Willie_) == 0x000328, "Member 'UUI_WIN_C::My_Master__Willie_' has a wrong offset!");

}

