#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_WinScreen_Versus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_WinScreen_Versus.UI_WinScreen_Versus_C
// 0x0038 (0x0318 - 0x02E0)
class UUI_WinScreen_Versus_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BCK;                                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Player_Lost_Int;                                   // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_WinScreen_Versus(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_WinScreen_Versus_C">();
	}
	static class UUI_WinScreen_Versus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_WinScreen_Versus_C>();
	}
};
static_assert(alignof(UUI_WinScreen_Versus_C) == 0x000008, "Wrong alignment on UUI_WinScreen_Versus_C");
static_assert(sizeof(UUI_WinScreen_Versus_C) == 0x000318, "Wrong size on UUI_WinScreen_Versus_C");
static_assert(offsetof(UUI_WinScreen_Versus_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_WinScreen_Versus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_WinScreen_Versus_C, FadeIn) == 0x0002E8, "Member 'UUI_WinScreen_Versus_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UUI_WinScreen_Versus_C, FadeOut) == 0x0002F0, "Member 'UUI_WinScreen_Versus_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UUI_WinScreen_Versus_C, BCK) == 0x0002F8, "Member 'UUI_WinScreen_Versus_C::BCK' has a wrong offset!");
static_assert(offsetof(UUI_WinScreen_Versus_C, Image_0) == 0x000300, "Member 'UUI_WinScreen_Versus_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_WinScreen_Versus_C, Image_1) == 0x000308, "Member 'UUI_WinScreen_Versus_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_WinScreen_Versus_C, Player_Lost_Int) == 0x000310, "Member 'UUI_WinScreen_Versus_C::Player_Lost_Int' has a wrong offset!");

}

