#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VertexPaintDetectionPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum VertexPaintDetectionPlugin.EPaintWithinAreaShape
// NumValues: 0x0004
enum class EPaintWithinAreaShape : uint8
{
	IsSquareOrRectangleShape                 = 0,
	IsSphereShape                            = 1,
	IsComplexShape                           = 2,
	EPaintWithinAreaShape_MAX                = 3,
};

// Enum VertexPaintDetectionPlugin.EVertexColorChannel
// NumValues: 0x0005
enum class EVertexColorChannel : uint8
{
	RedChannel                               = 0,
	GreenChannel                             = 1,
	BlueChannel                              = 2,
	AlphaChannel                             = 3,
	EVertexColorChannel_MAX                  = 4,
};

// Enum VertexPaintDetectionPlugin.ESurfaceAtChannel
// NumValues: 0x0006
enum class ESurfaceAtChannel : uint8
{
	Default                                  = 0,
	RedChannel                               = 1,
	GreenChannel                             = 2,
	BlueChannel                              = 3,
	AlphaChannel                             = 4,
	ESurfaceAtChannel_MAX                    = 5,
};

// Enum VertexPaintDetectionPlugin.FRVPDPPaintColorSnippetSetting
// NumValues: 0x0003
enum class EFRVPDPPaintColorSnippetSetting : uint8
{
	PaintSingleSnippet                       = 0,
	PaintGroupSnippet                        = 1,
	FRVPDPPaintColorSnippetSetting_MAX       = 2,
};

// Enum VertexPaintDetectionPlugin.EApplyVertexColorSetting
// NumValues: 0x0003
enum class EApplyVertexColorSetting : uint8
{
	EAddVertexColor                          = 0,
	ESetVertexColor                          = 1,
	EApplyVertexColorSetting_MAX             = 2,
};

// Enum VertexPaintDetectionPlugin.FRVPDPStartFallOffDistanceFromSetting
// NumValues: 0x0003
enum class EFRVPDPStartFallOffDistanceFromSetting : uint8
{
	BaseOfPaintShape                         = 0,
	EndOfPaintShape                          = 1,
	FRVPDPStartFallOffDistanceFromSetting_MAX = 2,
};

// Enum VertexPaintDetectionPlugin.EVertexPaintAtLocationFallOffType
// NumValues: 0x0004
enum class EVertexPaintAtLocationFallOffType : uint8
{
	OutwardFallOff                           = 0,
	InwardFallOff                            = 1,
	SphericalFallOff                         = 2,
	EVertexPaintAtLocationFallOffType_MAX    = 3,
};

// Enum VertexPaintDetectionPlugin.EPaintEntireMeshPropogateToLODsMethod
// NumValues: 0x0003
enum class EPaintEntireMeshPropogateToLODsMethod : uint8
{
	ModifiedEngineMethod                     = 0,
	DontPropogateLOD0ToAllLODs               = 1,
	EPaintEntireMeshPropogateToLODsMethod_MAX = 2,
};

// Enum VertexPaintDetectionPlugin.EVertexPaintWithinAreaFallOffType
// NumValues: 0x0004
enum class EVertexPaintWithinAreaFallOffType : uint8
{
	SphericalFromCenter                      = 0,
	GradiantUpward                           = 1,
	GradiantDownward                         = 2,
	EVertexPaintWithinAreaFallOffType_MAX    = 3,
};

// Enum VertexPaintDetectionPlugin.ELoadColorSnippetDataAssetOptions
// NumValues: 0x0003
enum class ELoadColorSnippetDataAssetOptions : uint8
{
	LoadPaintColorSnippetDataAsset           = 0,
	LoadCompareWithColorSnippetDataAsset     = 1,
	ELoadColorSnippetDataAssetOptions_MAX    = 2,
};

// Enum VertexPaintDetectionPlugin.ETVertexPaintThreadPriority
// NumValues: 0x0005
enum class ETVertexPaintThreadPriority : uint8
{
	TimeCritical                             = 0,
	Highest                                  = 1,
	Normal                                   = 2,
	Slowest                                  = 3,
	ETVertexPaintThreadPriority_MAX          = 4,
};

// ScriptStruct VertexPaintDetectionPlugin.RVPDPPhysicsSurfaceDataAtChannelInfo
// 0x0020 (0x0020 - 0x0000)
struct FRVPDPPhysicsSurfaceDataAtChannelInfo final
{
public:
	EPhysicalSurface                              PhysicalSurfaceAtChannel;                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PhysicalSurfaceAsStringAtChannel;                  // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicalSurfaceValueAtChannel;                     // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRVPDPPhysicsSurfaceDataAtChannelInfo) == 0x000008, "Wrong alignment on FRVPDPPhysicsSurfaceDataAtChannelInfo");
static_assert(sizeof(FRVPDPPhysicsSurfaceDataAtChannelInfo) == 0x000020, "Wrong size on FRVPDPPhysicsSurfaceDataAtChannelInfo");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataAtChannelInfo, PhysicalSurfaceAtChannel) == 0x000000, "Member 'FRVPDPPhysicsSurfaceDataAtChannelInfo::PhysicalSurfaceAtChannel' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataAtChannelInfo, PhysicalSurfaceAsStringAtChannel) == 0x000008, "Member 'FRVPDPPhysicsSurfaceDataAtChannelInfo::PhysicalSurfaceAsStringAtChannel' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataAtChannelInfo, PhysicalSurfaceValueAtChannel) == 0x000018, "Member 'FRVPDPPhysicsSurfaceDataAtChannelInfo::PhysicalSurfaceValueAtChannel' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPAdditionalDataToPassThroughInfo
// 0x0130 (0x0130 - 0x0000)
struct FRVPDPAdditionalDataToPassThroughInfo final
{
public:
	class AActor*                                 PassThrough_Actor1;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 PassThrough_Actor2;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    PassThrough_PrimitiveComponent1;                   // 0x0010(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    PassThrough_PrimitiveComponent2;                   // 0x0018(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PassThrough_Bool1;                                 // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PassThrough_Bool2;                                 // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PassThrough_Bool3;                                 // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PassThrough_Byte1;                                 // 0x0023(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PassThrough_Byte2;                                 // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PassThrough_Float1;                                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassThrough_Float2;                                // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassThrough_Float3;                                // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassThrough_Float4;                                // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PassThrough_Int1;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PassThrough_Int2;                                  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PassThrough_Vector1;                               // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PassThrough_Vector2;                               // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PassThrough_Vector3;                               // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PassThrough_Vector4;                               // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               PassThrough_Rotator1;                              // 0x00A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               PassThrough_Rotator2;                              // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 PassThrough_String1;                               // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PassThrough_String2;                               // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PassThrough_Name1;                                 // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PassThrough_Name2;                                 // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              PassThrough_PhysicsSurface1;                       // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              PassThrough_PhysicsSurface2;                       // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      PassThrough_PhysicalMaterial1;                     // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             PassThrough_ObjectCollisionChannel;                // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectTypeQuery                              PassThrough_ObjectType;                            // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          PassThrough_RandomStream;                          // 0x0114(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                PassThrough_UObject1;                              // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                PassThrough_UObject2;                              // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPAdditionalDataToPassThroughInfo) == 0x000008, "Wrong alignment on FRVPDPAdditionalDataToPassThroughInfo");
static_assert(sizeof(FRVPDPAdditionalDataToPassThroughInfo) == 0x000130, "Wrong size on FRVPDPAdditionalDataToPassThroughInfo");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Actor1) == 0x000000, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Actor1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Actor2) == 0x000008, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Actor2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_PrimitiveComponent1) == 0x000010, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_PrimitiveComponent1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_PrimitiveComponent2) == 0x000018, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_PrimitiveComponent2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Bool1) == 0x000020, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Bool1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Bool2) == 0x000021, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Bool2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Bool3) == 0x000022, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Bool3' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Byte1) == 0x000023, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Byte1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Byte2) == 0x000024, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Byte2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Float1) == 0x000028, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Float1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Float2) == 0x00002C, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Float2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Float3) == 0x000030, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Float3' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Float4) == 0x000034, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Float4' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Int1) == 0x000038, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Int1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Int2) == 0x00003C, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Int2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Vector1) == 0x000040, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Vector1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Vector2) == 0x000058, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Vector2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Vector3) == 0x000070, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Vector3' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Vector4) == 0x000088, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Vector4' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Rotator1) == 0x0000A0, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Rotator1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Rotator2) == 0x0000B8, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Rotator2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_String1) == 0x0000D0, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_String1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_String2) == 0x0000E0, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_String2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Name1) == 0x0000F0, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Name1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_Name2) == 0x0000F8, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_Name2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_PhysicsSurface1) == 0x000100, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_PhysicsSurface1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_PhysicsSurface2) == 0x000101, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_PhysicsSurface2' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_PhysicalMaterial1) == 0x000108, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_PhysicalMaterial1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_ObjectCollisionChannel) == 0x000110, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_ObjectCollisionChannel' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_ObjectType) == 0x000111, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_ObjectType' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_RandomStream) == 0x000114, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_RandomStream' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_UObject1) == 0x000120, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_UObject1' has a wrong offset!");
static_assert(offsetof(FRVPDPAdditionalDataToPassThroughInfo, PassThrough_UObject2) == 0x000128, "Member 'FRVPDPAdditionalDataToPassThroughInfo::PassThrough_UObject2' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPMostDominantPhysicsSurfaceInfo
// 0x0030 (0x0030 - 0x0000)
struct FRVPDPMostDominantPhysicsSurfaceInfo final
{
public:
	EPhysicalSurface                              MostDominantPhysicsSurface;                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MostDominantPhysicsSurfaceAsString;                // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MostDominantPhysicstSurfaceValue;                  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESurfaceAtChannel>                     MostDominantPhysicsSurfaceAtVertexColorChannels;   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPMostDominantPhysicsSurfaceInfo) == 0x000008, "Wrong alignment on FRVPDPMostDominantPhysicsSurfaceInfo");
static_assert(sizeof(FRVPDPMostDominantPhysicsSurfaceInfo) == 0x000030, "Wrong size on FRVPDPMostDominantPhysicsSurfaceInfo");
static_assert(offsetof(FRVPDPMostDominantPhysicsSurfaceInfo, MostDominantPhysicsSurface) == 0x000000, "Member 'FRVPDPMostDominantPhysicsSurfaceInfo::MostDominantPhysicsSurface' has a wrong offset!");
static_assert(offsetof(FRVPDPMostDominantPhysicsSurfaceInfo, MostDominantPhysicsSurfaceAsString) == 0x000008, "Member 'FRVPDPMostDominantPhysicsSurfaceInfo::MostDominantPhysicsSurfaceAsString' has a wrong offset!");
static_assert(offsetof(FRVPDPMostDominantPhysicsSurfaceInfo, MostDominantPhysicstSurfaceValue) == 0x000018, "Member 'FRVPDPMostDominantPhysicsSurfaceInfo::MostDominantPhysicstSurfaceValue' has a wrong offset!");
static_assert(offsetof(FRVPDPMostDominantPhysicsSurfaceInfo, MostDominantPhysicsSurfaceAtVertexColorChannels) == 0x000020, "Member 'FRVPDPMostDominantPhysicsSurfaceInfo::MostDominantPhysicsSurfaceAtVertexColorChannels' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPSerializedColorsPerLODInfo
// 0x0018 (0x0018 - 0x0000)
struct FRVPDPSerializedColorsPerLODInfo final
{
public:
	int32                                         Lod;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ColorsAtLODAsJSonString;                           // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPSerializedColorsPerLODInfo) == 0x000008, "Wrong alignment on FRVPDPSerializedColorsPerLODInfo");
static_assert(sizeof(FRVPDPSerializedColorsPerLODInfo) == 0x000018, "Wrong size on FRVPDPSerializedColorsPerLODInfo");
static_assert(offsetof(FRVPDPSerializedColorsPerLODInfo, Lod) == 0x000000, "Member 'FRVPDPSerializedColorsPerLODInfo::Lod' has a wrong offset!");
static_assert(offsetof(FRVPDPSerializedColorsPerLODInfo, ColorsAtLODAsJSonString) == 0x000008, "Member 'FRVPDPSerializedColorsPerLODInfo::ColorsAtLODAsJSonString' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.VertexDetectMeshDataPerLODStruct
// 0x0060 (0x0060 - 0x0000)
struct FVertexDetectMeshDataPerLODStruct final
{
public:
	int32                                         Lod;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfVerticesAtLOD;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         MeshVertexColorsPerLODArray;                       // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRVPDPSerializedColorsPerLODInfo       SerializedVertexColorsData;                        // 0x0018(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        MeshVertexPositionsInComponentSpacePerLODArray;    // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        MeshVertexNormalsPerLODArray;                      // 0x0040(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 MeshVertexIndexes;                                 // 0x0050(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVertexDetectMeshDataPerLODStruct) == 0x000008, "Wrong alignment on FVertexDetectMeshDataPerLODStruct");
static_assert(sizeof(FVertexDetectMeshDataPerLODStruct) == 0x000060, "Wrong size on FVertexDetectMeshDataPerLODStruct");
static_assert(offsetof(FVertexDetectMeshDataPerLODStruct, Lod) == 0x000000, "Member 'FVertexDetectMeshDataPerLODStruct::Lod' has a wrong offset!");
static_assert(offsetof(FVertexDetectMeshDataPerLODStruct, AmountOfVerticesAtLOD) == 0x000004, "Member 'FVertexDetectMeshDataPerLODStruct::AmountOfVerticesAtLOD' has a wrong offset!");
static_assert(offsetof(FVertexDetectMeshDataPerLODStruct, MeshVertexColorsPerLODArray) == 0x000008, "Member 'FVertexDetectMeshDataPerLODStruct::MeshVertexColorsPerLODArray' has a wrong offset!");
static_assert(offsetof(FVertexDetectMeshDataPerLODStruct, SerializedVertexColorsData) == 0x000018, "Member 'FVertexDetectMeshDataPerLODStruct::SerializedVertexColorsData' has a wrong offset!");
static_assert(offsetof(FVertexDetectMeshDataPerLODStruct, MeshVertexPositionsInComponentSpacePerLODArray) == 0x000030, "Member 'FVertexDetectMeshDataPerLODStruct::MeshVertexPositionsInComponentSpacePerLODArray' has a wrong offset!");
static_assert(offsetof(FVertexDetectMeshDataPerLODStruct, MeshVertexNormalsPerLODArray) == 0x000040, "Member 'FVertexDetectMeshDataPerLODStruct::MeshVertexNormalsPerLODArray' has a wrong offset!");
static_assert(offsetof(FVertexDetectMeshDataPerLODStruct, MeshVertexIndexes) == 0x000050, "Member 'FVertexDetectMeshDataPerLODStruct::MeshVertexIndexes' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPAmountOfColorsOfEachChannelChannelResults
// 0x0010 (0x0010 - 0x0000)
struct FRVPDPAmountOfColorsOfEachChannelChannelResults
{
public:
	float                                         AmountOfVerticesPaintedAtMinAmount;                // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PercentPaintedAtMinAmount;                         // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AverageColorAmountAtMinAmount;                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRVPDPAmountOfColorsOfEachChannelChannelResults) == 0x000004, "Wrong alignment on FRVPDPAmountOfColorsOfEachChannelChannelResults");
static_assert(sizeof(FRVPDPAmountOfColorsOfEachChannelChannelResults) == 0x000010, "Wrong size on FRVPDPAmountOfColorsOfEachChannelChannelResults");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelChannelResults, AmountOfVerticesPaintedAtMinAmount) == 0x000000, "Member 'FRVPDPAmountOfColorsOfEachChannelChannelResults::AmountOfVerticesPaintedAtMinAmount' has a wrong offset!");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelChannelResults, PercentPaintedAtMinAmount) == 0x000004, "Member 'FRVPDPAmountOfColorsOfEachChannelChannelResults::PercentPaintedAtMinAmount' has a wrong offset!");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelChannelResults, AverageColorAmountAtMinAmount) == 0x000008, "Member 'FRVPDPAmountOfColorsOfEachChannelChannelResults::AverageColorAmountAtMinAmount' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPAmountOfColorsOfEachChannelPhysicsResults
// 0x0004 (0x0014 - 0x0010)
struct FRVPDPAmountOfColorsOfEachChannelPhysicsResults final : public FRVPDPAmountOfColorsOfEachChannelChannelResults
{
public:
	EPhysicalSurface                              PhysicsSurface;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRVPDPAmountOfColorsOfEachChannelPhysicsResults) == 0x000004, "Wrong alignment on FRVPDPAmountOfColorsOfEachChannelPhysicsResults");
static_assert(sizeof(FRVPDPAmountOfColorsOfEachChannelPhysicsResults) == 0x000014, "Wrong size on FRVPDPAmountOfColorsOfEachChannelPhysicsResults");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelPhysicsResults, PhysicsSurface) == 0x000010, "Member 'FRVPDPAmountOfColorsOfEachChannelPhysicsResults::PhysicsSurface' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPAmountOfColorsOfEachChannelResults
// 0x0058 (0x0058 - 0x0000)
struct FRVPDPAmountOfColorsOfEachChannelResults final
{
public:
	bool                                          SuccessfullyGotColorChannelResultsAtMinAmount;     // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPAmountOfColorsOfEachChannelChannelResults RedChannelResult;                                  // 0x0004(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FRVPDPAmountOfColorsOfEachChannelChannelResults GreenChannelResult;                                // 0x0014(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FRVPDPAmountOfColorsOfEachChannelChannelResults BlueChannelResult;                                 // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FRVPDPAmountOfColorsOfEachChannelChannelResults AlphaChannelResult;                                // 0x0034(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          SuccessfullyGotPhysicsSurfaceResultsAtMinAmount;   // 0x0044(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRVPDPAmountOfColorsOfEachChannelPhysicsResults> PhysicsSurfacesResults;                            // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPAmountOfColorsOfEachChannelResults) == 0x000008, "Wrong alignment on FRVPDPAmountOfColorsOfEachChannelResults");
static_assert(sizeof(FRVPDPAmountOfColorsOfEachChannelResults) == 0x000058, "Wrong size on FRVPDPAmountOfColorsOfEachChannelResults");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelResults, SuccessfullyGotColorChannelResultsAtMinAmount) == 0x000000, "Member 'FRVPDPAmountOfColorsOfEachChannelResults::SuccessfullyGotColorChannelResultsAtMinAmount' has a wrong offset!");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelResults, RedChannelResult) == 0x000004, "Member 'FRVPDPAmountOfColorsOfEachChannelResults::RedChannelResult' has a wrong offset!");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelResults, GreenChannelResult) == 0x000014, "Member 'FRVPDPAmountOfColorsOfEachChannelResults::GreenChannelResult' has a wrong offset!");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelResults, BlueChannelResult) == 0x000024, "Member 'FRVPDPAmountOfColorsOfEachChannelResults::BlueChannelResult' has a wrong offset!");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelResults, AlphaChannelResult) == 0x000034, "Member 'FRVPDPAmountOfColorsOfEachChannelResults::AlphaChannelResult' has a wrong offset!");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelResults, SuccessfullyGotPhysicsSurfaceResultsAtMinAmount) == 0x000044, "Member 'FRVPDPAmountOfColorsOfEachChannelResults::SuccessfullyGotPhysicsSurfaceResultsAtMinAmount' has a wrong offset!");
static_assert(offsetof(FRVPDPAmountOfColorsOfEachChannelResults, PhysicsSurfacesResults) == 0x000048, "Member 'FRVPDPAmountOfColorsOfEachChannelResults::PhysicsSurfacesResults' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPWithinAreaResults
// 0x0068 (0x0068 - 0x0000)
struct FRVPDPWithinAreaResults final
{
public:
	TArray<struct FVertexDetectMeshDataPerLODStruct> MeshVertexDataWithinArea;                          // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPAmountOfColorsOfEachChannelResults AmountOfPaintedColorsOfEachChannelWithinArea;      // 0x0010(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPWithinAreaResults) == 0x000008, "Wrong alignment on FRVPDPWithinAreaResults");
static_assert(sizeof(FRVPDPWithinAreaResults) == 0x000068, "Wrong size on FRVPDPWithinAreaResults");
static_assert(offsetof(FRVPDPWithinAreaResults, MeshVertexDataWithinArea) == 0x000000, "Member 'FRVPDPWithinAreaResults::MeshVertexDataWithinArea' has a wrong offset!");
static_assert(offsetof(FRVPDPWithinAreaResults, AmountOfPaintedColorsOfEachChannelWithinArea) == 0x000010, "Member 'FRVPDPWithinAreaResults::AmountOfPaintedColorsOfEachChannelWithinArea' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPGroupColorSnippetInfo
// 0x0048 (0x0048 - 0x0000)
struct FRVPDPGroupColorSnippetInfo final
{
public:
	class FString                                 GroupSnippetID;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVertexPaintColorSnippetDataAsset> ColorSnippetDataAssetStoredOn;                     // 0x0010(0x0028)(Edit, BlueprintVisible, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UObject>>         AssociatedGroupMeshes;                             // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPGroupColorSnippetInfo) == 0x000008, "Wrong alignment on FRVPDPGroupColorSnippetInfo");
static_assert(sizeof(FRVPDPGroupColorSnippetInfo) == 0x000048, "Wrong size on FRVPDPGroupColorSnippetInfo");
static_assert(offsetof(FRVPDPGroupColorSnippetInfo, GroupSnippetID) == 0x000000, "Member 'FRVPDPGroupColorSnippetInfo::GroupSnippetID' has a wrong offset!");
static_assert(offsetof(FRVPDPGroupColorSnippetInfo, ColorSnippetDataAssetStoredOn) == 0x000010, "Member 'FRVPDPGroupColorSnippetInfo::ColorSnippetDataAssetStoredOn' has a wrong offset!");
static_assert(offsetof(FRVPDPGroupColorSnippetInfo, AssociatedGroupMeshes) == 0x000038, "Member 'FRVPDPGroupColorSnippetInfo::AssociatedGroupMeshes' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPPhysicsSurfaceDataInfo
// 0x0110 (0x0110 - 0x0000)
struct FRVPDPPhysicsSurfaceDataInfo final
{
public:
	bool                                          PhysicsSurfaceSuccessfullyAcquired;                // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPMostDominantPhysicsSurfaceInfo   MostDominantPhysicsSurfaceInfo;                    // 0x0008(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	bool                                          MaterialRegisteredToIncludeDefaultChannel;         // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPPhysicsSurfaceDataAtChannelInfo  PhysicsSurface_AtDefault;                          // 0x0040(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPPhysicsSurfaceDataAtChannelInfo  PhysicsSurface_AtRed;                              // 0x0060(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPPhysicsSurfaceDataAtChannelInfo  PhysicsSurface_AtGreen;                            // 0x0080(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPPhysicsSurfaceDataAtChannelInfo  PhysicsSurface_AtBlue;                             // 0x00A0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPPhysicsSurfaceDataAtChannelInfo  PhysicsSurface_AtAlpha;                            // 0x00C0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<EPhysicalSurface>                      PhysicalSurfacesAsArray;                           // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         SurfacesAsStringArray;                             // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<float>                                 SurfaceValuesArray;                                // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPPhysicsSurfaceDataInfo) == 0x000008, "Wrong alignment on FRVPDPPhysicsSurfaceDataInfo");
static_assert(sizeof(FRVPDPPhysicsSurfaceDataInfo) == 0x000110, "Wrong size on FRVPDPPhysicsSurfaceDataInfo");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, PhysicsSurfaceSuccessfullyAcquired) == 0x000000, "Member 'FRVPDPPhysicsSurfaceDataInfo::PhysicsSurfaceSuccessfullyAcquired' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, MostDominantPhysicsSurfaceInfo) == 0x000008, "Member 'FRVPDPPhysicsSurfaceDataInfo::MostDominantPhysicsSurfaceInfo' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, MaterialRegisteredToIncludeDefaultChannel) == 0x000038, "Member 'FRVPDPPhysicsSurfaceDataInfo::MaterialRegisteredToIncludeDefaultChannel' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, PhysicsSurface_AtDefault) == 0x000040, "Member 'FRVPDPPhysicsSurfaceDataInfo::PhysicsSurface_AtDefault' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, PhysicsSurface_AtRed) == 0x000060, "Member 'FRVPDPPhysicsSurfaceDataInfo::PhysicsSurface_AtRed' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, PhysicsSurface_AtGreen) == 0x000080, "Member 'FRVPDPPhysicsSurfaceDataInfo::PhysicsSurface_AtGreen' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, PhysicsSurface_AtBlue) == 0x0000A0, "Member 'FRVPDPPhysicsSurfaceDataInfo::PhysicsSurface_AtBlue' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, PhysicsSurface_AtAlpha) == 0x0000C0, "Member 'FRVPDPPhysicsSurfaceDataInfo::PhysicsSurface_AtAlpha' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, PhysicalSurfacesAsArray) == 0x0000E0, "Member 'FRVPDPPhysicsSurfaceDataInfo::PhysicalSurfacesAsArray' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, SurfacesAsStringArray) == 0x0000F0, "Member 'FRVPDPPhysicsSurfaceDataInfo::SurfacesAsStringArray' has a wrong offset!");
static_assert(offsetof(FRVPDPPhysicsSurfaceDataInfo, SurfaceValuesArray) == 0x000100, "Member 'FRVPDPPhysicsSurfaceDataInfo::SurfaceValuesArray' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPEstimatedColorAtHitLocationInfo
// 0x0140 (0x0140 - 0x0000)
struct FRVPDPEstimatedColorAtHitLocationInfo final
{
public:
	bool                                          EstimatedColorAtHitLocationDataSuccessfullyAcquired; // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           EstimatedColorAtHitLocation;                       // 0x0004(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPPhysicsSurfaceDataInfo           PhysicalSurfaceInfo;                               // 0x0018(0x0110)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FVector                                WorldSpaceLocationWeEstimatedTheColorAt;           // 0x0128(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPEstimatedColorAtHitLocationInfo) == 0x000008, "Wrong alignment on FRVPDPEstimatedColorAtHitLocationInfo");
static_assert(sizeof(FRVPDPEstimatedColorAtHitLocationInfo) == 0x000140, "Wrong size on FRVPDPEstimatedColorAtHitLocationInfo");
static_assert(offsetof(FRVPDPEstimatedColorAtHitLocationInfo, EstimatedColorAtHitLocationDataSuccessfullyAcquired) == 0x000000, "Member 'FRVPDPEstimatedColorAtHitLocationInfo::EstimatedColorAtHitLocationDataSuccessfullyAcquired' has a wrong offset!");
static_assert(offsetof(FRVPDPEstimatedColorAtHitLocationInfo, EstimatedColorAtHitLocation) == 0x000004, "Member 'FRVPDPEstimatedColorAtHitLocationInfo::EstimatedColorAtHitLocation' has a wrong offset!");
static_assert(offsetof(FRVPDPEstimatedColorAtHitLocationInfo, PhysicalSurfaceInfo) == 0x000018, "Member 'FRVPDPEstimatedColorAtHitLocationInfo::PhysicalSurfaceInfo' has a wrong offset!");
static_assert(offsetof(FRVPDPEstimatedColorAtHitLocationInfo, WorldSpaceLocationWeEstimatedTheColorAt) == 0x000128, "Member 'FRVPDPEstimatedColorAtHitLocationInfo::WorldSpaceLocationWeEstimatedTheColorAt' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClosestVertexPositionInfo
// 0x0030 (0x0030 - 0x0000)
struct FRVPDPClosestVertexPositionInfo final
{
public:
	struct FVector                                ClosestVertexPositionWorld;                        // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClosestVertexPositionActorLocal;                   // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPClosestVertexPositionInfo) == 0x000008, "Wrong alignment on FRVPDPClosestVertexPositionInfo");
static_assert(sizeof(FRVPDPClosestVertexPositionInfo) == 0x000030, "Wrong size on FRVPDPClosestVertexPositionInfo");
static_assert(offsetof(FRVPDPClosestVertexPositionInfo, ClosestVertexPositionWorld) == 0x000000, "Member 'FRVPDPClosestVertexPositionInfo::ClosestVertexPositionWorld' has a wrong offset!");
static_assert(offsetof(FRVPDPClosestVertexPositionInfo, ClosestVertexPositionActorLocal) == 0x000018, "Member 'FRVPDPClosestVertexPositionInfo::ClosestVertexPositionActorLocal' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClosestVertexNormalInfo
// 0x0030 (0x0030 - 0x0000)
struct FRVPDPClosestVertexNormalInfo final
{
public:
	struct FVector                                ClosestVertexNormal;                               // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClosestVertexNormalLocal;                          // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPClosestVertexNormalInfo) == 0x000008, "Wrong alignment on FRVPDPClosestVertexNormalInfo");
static_assert(sizeof(FRVPDPClosestVertexNormalInfo) == 0x000030, "Wrong size on FRVPDPClosestVertexNormalInfo");
static_assert(offsetof(FRVPDPClosestVertexNormalInfo, ClosestVertexNormal) == 0x000000, "Member 'FRVPDPClosestVertexNormalInfo::ClosestVertexNormal' has a wrong offset!");
static_assert(offsetof(FRVPDPClosestVertexNormalInfo, ClosestVertexNormalLocal) == 0x000018, "Member 'FRVPDPClosestVertexNormalInfo::ClosestVertexNormalLocal' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClosestVertexInfo
// 0x0090 (0x0090 - 0x0000)
struct FRVPDPClosestVertexInfo final
{
public:
	int32                                         ClosestVertexIndex;                                // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClosestSection;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ClosestVertexColors;                               // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPClosestVertexPositionInfo        ClosestVertexPositionInfo;                         // 0x0018(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FRVPDPClosestVertexNormalInfo          ClosestVertexNormalInfo;                           // 0x0048(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ClosestVertexMaterial;                             // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      ClosestVertexUVAtEachUVChannel;                    // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPClosestVertexInfo) == 0x000008, "Wrong alignment on FRVPDPClosestVertexInfo");
static_assert(sizeof(FRVPDPClosestVertexInfo) == 0x000090, "Wrong size on FRVPDPClosestVertexInfo");
static_assert(offsetof(FRVPDPClosestVertexInfo, ClosestVertexIndex) == 0x000000, "Member 'FRVPDPClosestVertexInfo::ClosestVertexIndex' has a wrong offset!");
static_assert(offsetof(FRVPDPClosestVertexInfo, ClosestSection) == 0x000004, "Member 'FRVPDPClosestVertexInfo::ClosestSection' has a wrong offset!");
static_assert(offsetof(FRVPDPClosestVertexInfo, ClosestVertexColors) == 0x000008, "Member 'FRVPDPClosestVertexInfo::ClosestVertexColors' has a wrong offset!");
static_assert(offsetof(FRVPDPClosestVertexInfo, ClosestVertexPositionInfo) == 0x000018, "Member 'FRVPDPClosestVertexInfo::ClosestVertexPositionInfo' has a wrong offset!");
static_assert(offsetof(FRVPDPClosestVertexInfo, ClosestVertexNormalInfo) == 0x000048, "Member 'FRVPDPClosestVertexInfo::ClosestVertexNormalInfo' has a wrong offset!");
static_assert(offsetof(FRVPDPClosestVertexInfo, ClosestVertexMaterial) == 0x000078, "Member 'FRVPDPClosestVertexInfo::ClosestVertexMaterial' has a wrong offset!");
static_assert(offsetof(FRVPDPClosestVertexInfo, ClosestVertexUVAtEachUVChannel) == 0x000080, "Member 'FRVPDPClosestVertexInfo::ClosestVertexUVAtEachUVChannel' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClosestVertexDataResults
// 0x01A8 (0x01A8 - 0x0000)
struct FRVPDPClosestVertexDataResults final
{
public:
	bool                                          ClosestVertexDataSuccessfullyAcquired;             // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPClosestVertexInfo                ClosestVertexGeneralInfo;                          // 0x0008(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPPhysicsSurfaceDataInfo           ClosestVertexPhysicalSurfaceInfo;                  // 0x0098(0x0110)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPClosestVertexDataResults) == 0x000008, "Wrong alignment on FRVPDPClosestVertexDataResults");
static_assert(sizeof(FRVPDPClosestVertexDataResults) == 0x0001A8, "Wrong size on FRVPDPClosestVertexDataResults");
static_assert(offsetof(FRVPDPClosestVertexDataResults, ClosestVertexDataSuccessfullyAcquired) == 0x000000, "Member 'FRVPDPClosestVertexDataResults::ClosestVertexDataSuccessfullyAcquired' has a wrong offset!");
static_assert(offsetof(FRVPDPClosestVertexDataResults, ClosestVertexGeneralInfo) == 0x000008, "Member 'FRVPDPClosestVertexDataResults::ClosestVertexGeneralInfo' has a wrong offset!");
static_assert(offsetof(FRVPDPClosestVertexDataResults, ClosestVertexPhysicalSurfaceInfo) == 0x000098, "Member 'FRVPDPClosestVertexDataResults::ClosestVertexPhysicalSurfaceInfo' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPSkeletalMeshBoneVertexInfo
// 0x0010 (0x0010 - 0x0000)
struct FRVPDPSkeletalMeshBoneVertexInfo final
{
public:
	int32                                         BoneFirstVertex;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoneFirstSectionVertex;                            // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPSkeletalMeshBoneVertexInfo) == 0x000004, "Wrong alignment on FRVPDPSkeletalMeshBoneVertexInfo");
static_assert(sizeof(FRVPDPSkeletalMeshBoneVertexInfo) == 0x000010, "Wrong size on FRVPDPSkeletalMeshBoneVertexInfo");
static_assert(offsetof(FRVPDPSkeletalMeshBoneVertexInfo, BoneFirstVertex) == 0x000000, "Member 'FRVPDPSkeletalMeshBoneVertexInfo::BoneFirstVertex' has a wrong offset!");
static_assert(offsetof(FRVPDPSkeletalMeshBoneVertexInfo, BoneFirstSectionVertex) == 0x000004, "Member 'FRVPDPSkeletalMeshBoneVertexInfo::BoneFirstSectionVertex' has a wrong offset!");
static_assert(offsetof(FRVPDPSkeletalMeshBoneVertexInfo, BoneName) == 0x000008, "Member 'FRVPDPSkeletalMeshBoneVertexInfo::BoneName' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPSkeletalMeshSectionInfo
// 0x0058 (0x0058 - 0x0000)
struct FRVPDPSkeletalMeshSectionInfo final
{
public:
	int32                                         AtSection;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FRVPDPSkeletalMeshBoneVertexInfo> SkeletalMeshBoneVertexInfo;                        // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPSkeletalMeshSectionInfo) == 0x000008, "Wrong alignment on FRVPDPSkeletalMeshSectionInfo");
static_assert(sizeof(FRVPDPSkeletalMeshSectionInfo) == 0x000058, "Wrong size on FRVPDPSkeletalMeshSectionInfo");
static_assert(offsetof(FRVPDPSkeletalMeshSectionInfo, AtSection) == 0x000000, "Member 'FRVPDPSkeletalMeshSectionInfo::AtSection' has a wrong offset!");
static_assert(offsetof(FRVPDPSkeletalMeshSectionInfo, SkeletalMeshBoneVertexInfo) == 0x000008, "Member 'FRVPDPSkeletalMeshSectionInfo::SkeletalMeshBoneVertexInfo' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClothPhysicsDampingSettings
// 0x0004 (0x0004 - 0x0000)
struct FRVPDPClothPhysicsDampingSettings final
{
public:
	float                                         SetDamping_dampingCoefficient;                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPClothPhysicsDampingSettings) == 0x000004, "Wrong alignment on FRVPDPClothPhysicsDampingSettings");
static_assert(sizeof(FRVPDPClothPhysicsDampingSettings) == 0x000004, "Wrong size on FRVPDPClothPhysicsDampingSettings");
static_assert(offsetof(FRVPDPClothPhysicsDampingSettings, SetDamping_dampingCoefficient) == 0x000000, "Member 'FRVPDPClothPhysicsDampingSettings::SetDamping_dampingCoefficient' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClothPhysicsGravitySettings
// 0x0020 (0x0020 - 0x0000)
struct FRVPDPClothPhysicsGravitySettings final
{
public:
	float                                         SetGravity_gravityScale;                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SetGravity_overrideGravity;                        // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SetGravity_gravityOverride;                        // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRVPDPClothPhysicsGravitySettings) == 0x000008, "Wrong alignment on FRVPDPClothPhysicsGravitySettings");
static_assert(sizeof(FRVPDPClothPhysicsGravitySettings) == 0x000020, "Wrong size on FRVPDPClothPhysicsGravitySettings");
static_assert(offsetof(FRVPDPClothPhysicsGravitySettings, SetGravity_gravityScale) == 0x000000, "Member 'FRVPDPClothPhysicsGravitySettings::SetGravity_gravityScale' has a wrong offset!");
static_assert(offsetof(FRVPDPClothPhysicsGravitySettings, SetGravity_overrideGravity) == 0x000004, "Member 'FRVPDPClothPhysicsGravitySettings::SetGravity_overrideGravity' has a wrong offset!");
static_assert(offsetof(FRVPDPClothPhysicsGravitySettings, SetGravity_gravityOverride) == 0x000008, "Member 'FRVPDPClothPhysicsGravitySettings::SetGravity_gravityOverride' has a wrong offset!");

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClothPhysicsWindSettings
// 0x0040 (0x0040 - 0x0000)
struct FRVPDPClothPhysicsWindSettings final
{
public:
	struct FVector2D                              SetWind_drag;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SetWind_lift;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SetWind_airDensity;                                // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
