#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VertexPaintDetectionPlugin

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "VertexPaintDetectionPlugin_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentGetAllVertexColorsOnlyTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentGetAllVertexColorsOnlyTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentGetAllVertexColorsOnlyTasks) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentGetAllVertexColorsOnlyTasks");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentGetAllVertexColorsOnlyTasks) == 0x000050, "Wrong size on VertexPaintDetectionComponent_GetCurrentGetAllVertexColorsOnlyTasks");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentGetAllVertexColorsOnlyTasks, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentGetAllVertexColorsOnlyTasks::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentGetClosestVertexDataTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentGetClosestVertexDataTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentGetClosestVertexDataTasks) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentGetClosestVertexDataTasks");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentGetClosestVertexDataTasks) == 0x000050, "Wrong size on VertexPaintDetectionComponent_GetCurrentGetClosestVertexDataTasks");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentGetClosestVertexDataTasks, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentGetClosestVertexDataTasks::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentGetColorsWithinAreaTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentGetColorsWithinAreaTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentGetColorsWithinAreaTasks) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentGetColorsWithinAreaTasks");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentGetColorsWithinAreaTasks) == 0x000050, "Wrong size on VertexPaintDetectionComponent_GetCurrentGetColorsWithinAreaTasks");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentGetColorsWithinAreaTasks, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentGetColorsWithinAreaTasks::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentPaintAtLocationTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentPaintAtLocationTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentPaintAtLocationTasks) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentPaintAtLocationTasks");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentPaintAtLocationTasks) == 0x000050, "Wrong size on VertexPaintDetectionComponent_GetCurrentPaintAtLocationTasks");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentPaintAtLocationTasks, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentPaintAtLocationTasks::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentPaintColorSnippetTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentPaintColorSnippetTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentPaintColorSnippetTasks) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentPaintColorSnippetTasks");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentPaintColorSnippetTasks) == 0x000050, "Wrong size on VertexPaintDetectionComponent_GetCurrentPaintColorSnippetTasks");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentPaintColorSnippetTasks, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentPaintColorSnippetTasks::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentPaintEntireMeshTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentPaintEntireMeshTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentPaintEntireMeshTasks) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentPaintEntireMeshTasks");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentPaintEntireMeshTasks) == 0x000050, "Wrong size on VertexPaintDetectionComponent_GetCurrentPaintEntireMeshTasks");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentPaintEntireMeshTasks, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentPaintEntireMeshTasks::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentPaintWithinAreaTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentPaintWithinAreaTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentPaintWithinAreaTasks) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentPaintWithinAreaTasks");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentPaintWithinAreaTasks) == 0x000050, "Wrong size on VertexPaintDetectionComponent_GetCurrentPaintWithinAreaTasks");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentPaintWithinAreaTasks, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentPaintWithinAreaTasks::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentSetMeshComponentVertexColorsTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsTasks) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsTasks");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsTasks) == 0x000050, "Wrong size on VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsTasks");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsTasks, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsTasks::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks) == 0x000050, "Wrong size on VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentTasksInitiatedByComponent
// 0x0028 (0x0028 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent final
{
public:
	int32                                         TotalAmountOfTasks;                                // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfGetClosestVertexDataTasks;                 // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfGetAllVertexColorsOnlyTasks;               // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfGetColorsWithinAreaTasks;                  // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfPaintAtLocationTasks;                      // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfPaintWithinAreaTasks;                      // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfPaintEntireMeshTasks;                      // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfPaintColorSnippetTasks;                    // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfSetMeshComponentVertexColorsTasks;         // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfSetMeshComponentVertexColorsUsingSerializedStringTasks; // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent) == 0x000004, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent) == 0x000028, "Wrong size on VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent, TotalAmountOfTasks) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent::TotalAmountOfTasks' has a wrong offset!");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent, AmountOfGetClosestVertexDataTasks) == 0x000004, "Member 'VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent::AmountOfGetClosestVertexDataTasks' has a wrong offset!");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent, AmountOfGetAllVertexColorsOnlyTasks) == 0x000008, "Member 'VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent::AmountOfGetAllVertexColorsOnlyTasks' has a wrong offset!");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent, AmountOfGetColorsWithinAreaTasks) == 0x00000C, "Member 'VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent::AmountOfGetColorsWithinAreaTasks' has a wrong offset!");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent, AmountOfPaintAtLocationTasks) == 0x000010, "Member 'VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent::AmountOfPaintAtLocationTasks' has a wrong offset!");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent, AmountOfPaintWithinAreaTasks) == 0x000014, "Member 'VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent::AmountOfPaintWithinAreaTasks' has a wrong offset!");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent, AmountOfPaintEntireMeshTasks) == 0x000018, "Member 'VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent::AmountOfPaintEntireMeshTasks' has a wrong offset!");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent, AmountOfPaintColorSnippetTasks) == 0x00001C, "Member 'VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent::AmountOfPaintColorSnippetTasks' has a wrong offset!");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent, AmountOfSetMeshComponentVertexColorsTasks) == 0x000020, "Member 'VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent::AmountOfSetMeshComponentVertexColorsTasks' has a wrong offset!");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent, AmountOfSetMeshComponentVertexColorsUsingSerializedStringTasks) == 0x000024, "Member 'VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent::AmountOfSetMeshComponentVertexColorsUsingSerializedStringTasks' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentTasksMeshComponents
// 0x0010 (0x0010 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentTasksMeshComponents final
{
public:
	TArray<class UPrimitiveComponent*>            ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetCurrentTasksMeshComponents) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_GetCurrentTasksMeshComponents");
static_assert(sizeof(VertexPaintDetectionComponent_GetCurrentTasksMeshComponents) == 0x000010, "Wrong size on VertexPaintDetectionComponent_GetCurrentTasksMeshComponents");
static_assert(offsetof(VertexPaintDetectionComponent_GetCurrentTasksMeshComponents, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetCurrentTasksMeshComponents::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetTotalTasksInitiatedByComponent
// 0x0004 (0x0004 - 0x0000)
struct VertexPaintDetectionComponent_GetTotalTasksInitiatedByComponent final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_GetTotalTasksInitiatedByComponent) == 0x000004, "Wrong alignment on VertexPaintDetectionComponent_GetTotalTasksInitiatedByComponent");
static_assert(sizeof(VertexPaintDetectionComponent_GetTotalTasksInitiatedByComponent) == 0x000004, "Wrong size on VertexPaintDetectionComponent_GetTotalTasksInitiatedByComponent");
static_assert(offsetof(VertexPaintDetectionComponent_GetTotalTasksInitiatedByComponent, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_GetTotalTasksInitiatedByComponent::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.HasAnyTasksQueuedUp
// 0x0001 (0x0001 - 0x0000)
struct VertexPaintDetectionComponent_HasAnyTasksQueuedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_HasAnyTasksQueuedUp) == 0x000001, "Wrong alignment on VertexPaintDetectionComponent_HasAnyTasksQueuedUp");
static_assert(sizeof(VertexPaintDetectionComponent_HasAnyTasksQueuedUp) == 0x000001, "Wrong size on VertexPaintDetectionComponent_HasAnyTasksQueuedUp");
static_assert(offsetof(VertexPaintDetectionComponent_HasAnyTasksQueuedUp, ReturnValue) == 0x000000, "Member 'VertexPaintDetectionComponent_HasAnyTasksQueuedUp::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.TaskRemovedByTaskQueue
// 0x2870 (0x2870 - 0x0000)
struct VertexPaintDetectionComponent_TaskRemovedByTaskQueue final
{
public:
	struct FRVPDPCalculateColorsInfo              CalculateColorsInfo;                               // 0x0000(0x2870)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintDetectionComponent_TaskRemovedByTaskQueue) == 0x000008, "Wrong alignment on VertexPaintDetectionComponent_TaskRemovedByTaskQueue");
static_assert(sizeof(VertexPaintDetectionComponent_TaskRemovedByTaskQueue) == 0x002870, "Wrong size on VertexPaintDetectionComponent_TaskRemovedByTaskQueue");
static_assert(offsetof(VertexPaintDetectionComponent_TaskRemovedByTaskQueue, CalculateColorsInfo) == 0x000000, "Member 'VertexPaintDetectionComponent_TaskRemovedByTaskQueue::CalculateColorsInfo' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.AutoPaintDelayFinished
// 0x0008 (0x0008 - 0x0000)
struct AutoAddColorComponent_AutoPaintDelayFinished final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorComponent_AutoPaintDelayFinished) == 0x000008, "Wrong alignment on AutoAddColorComponent_AutoPaintDelayFinished");
static_assert(sizeof(AutoAddColorComponent_AutoPaintDelayFinished) == 0x000008, "Wrong size on AutoAddColorComponent_AutoPaintDelayFinished");
static_assert(offsetof(AutoAddColorComponent_AutoPaintDelayFinished, MeshComponent) == 0x000000, "Member 'AutoAddColorComponent_AutoPaintDelayFinished::MeshComponent' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.AutoPaintedActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct AutoAddColorComponent_AutoPaintedActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorComponent_AutoPaintedActorDestroyed) == 0x000008, "Wrong alignment on AutoAddColorComponent_AutoPaintedActorDestroyed");
static_assert(sizeof(AutoAddColorComponent_AutoPaintedActorDestroyed) == 0x000008, "Wrong size on AutoAddColorComponent_AutoPaintedActorDestroyed");
static_assert(offsetof(AutoAddColorComponent_AutoPaintedActorDestroyed, DestroyedActor) == 0x000000, "Member 'AutoAddColorComponent_AutoPaintedActorDestroyed::DestroyedActor' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.PauseAutoPaintingMesh
// 0x0008 (0x0008 - 0x0000)
struct AutoAddColorComponent_PauseAutoPaintingMesh final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorComponent_PauseAutoPaintingMesh) == 0x000008, "Wrong alignment on AutoAddColorComponent_PauseAutoPaintingMesh");
static_assert(sizeof(AutoAddColorComponent_PauseAutoPaintingMesh) == 0x000008, "Wrong size on AutoAddColorComponent_PauseAutoPaintingMesh");
static_assert(offsetof(AutoAddColorComponent_PauseAutoPaintingMesh, MeshComponent) == 0x000000, "Member 'AutoAddColorComponent_PauseAutoPaintingMesh::MeshComponent' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.ResumeAutoPaintingMesh
// 0x0008 (0x0008 - 0x0000)
struct AutoAddColorComponent_ResumeAutoPaintingMesh final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorComponent_ResumeAutoPaintingMesh) == 0x000008, "Wrong alignment on AutoAddColorComponent_ResumeAutoPaintingMesh");
static_assert(sizeof(AutoAddColorComponent_ResumeAutoPaintingMesh) == 0x000008, "Wrong size on AutoAddColorComponent_ResumeAutoPaintingMesh");
static_assert(offsetof(AutoAddColorComponent_ResumeAutoPaintingMesh, MeshComponent) == 0x000000, "Member 'AutoAddColorComponent_ResumeAutoPaintingMesh::MeshComponent' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade
// 0x0010 (0x0010 - 0x0000)
struct AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyStartNewTaskIfChangeWasMade;                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade) == 0x000008, "Wrong alignment on AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade");
static_assert(sizeof(AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade) == 0x000010, "Wrong size on AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade");
static_assert(offsetof(AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade, MeshComponent) == 0x000000, "Member 'AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade::MeshComponent' has a wrong offset!");
static_assert(offsetof(AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade, OnlyStartNewTaskIfChangeWasMade) == 0x000008, "Member 'AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade::OnlyStartNewTaskIfChangeWasMade' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.StopAutoPaintingMesh
// 0x0008 (0x0008 - 0x0000)
struct AutoAddColorComponent_StopAutoPaintingMesh final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorComponent_StopAutoPaintingMesh) == 0x000008, "Wrong alignment on AutoAddColorComponent_StopAutoPaintingMesh");
static_assert(sizeof(AutoAddColorComponent_StopAutoPaintingMesh) == 0x000008, "Wrong size on AutoAddColorComponent_StopAutoPaintingMesh");
static_assert(offsetof(AutoAddColorComponent_StopAutoPaintingMesh, MeshComponent) == 0x000000, "Member 'AutoAddColorComponent_StopAutoPaintingMesh::MeshComponent' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.CanAutoPaintedMeshGetPaused
// 0x0010 (0x0010 - 0x0000)
struct AutoAddColorComponent_CanAutoPaintedMeshGetPaused final
{
public:
	const class UPrimitiveComponent*              MeshComponent;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoAddColorComponent_CanAutoPaintedMeshGetPaused) == 0x000008, "Wrong alignment on AutoAddColorComponent_CanAutoPaintedMeshGetPaused");
static_assert(sizeof(AutoAddColorComponent_CanAutoPaintedMeshGetPaused) == 0x000010, "Wrong size on AutoAddColorComponent_CanAutoPaintedMeshGetPaused");
static_assert(offsetof(AutoAddColorComponent_CanAutoPaintedMeshGetPaused, MeshComponent) == 0x000000, "Member 'AutoAddColorComponent_CanAutoPaintedMeshGetPaused::MeshComponent' has a wrong offset!");
static_assert(offsetof(AutoAddColorComponent_CanAutoPaintedMeshGetPaused, ReturnValue) == 0x000008, "Member 'AutoAddColorComponent_CanAutoPaintedMeshGetPaused::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade
// 0x0010 (0x0010 - 0x0000)
struct AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade final
{
public:
	const class UPrimitiveComponent*              MeshComponent;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade) == 0x000008, "Wrong alignment on AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade");
static_assert(sizeof(AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade) == 0x000010, "Wrong size on AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade");
static_assert(offsetof(AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade, MeshComponent) == 0x000000, "Member 'AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade::MeshComponent' has a wrong offset!");
static_assert(offsetof(AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade, ReturnValue) == 0x000008, "Member 'AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.GetIsAutoPainting
// 0x0001 (0x0001 - 0x0000)
struct AutoAddColorComponent_GetIsAutoPainting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorComponent_GetIsAutoPainting) == 0x000001, "Wrong alignment on AutoAddColorComponent_GetIsAutoPainting");
static_assert(sizeof(AutoAddColorComponent_GetIsAutoPainting) == 0x000001, "Wrong size on AutoAddColorComponent_GetIsAutoPainting");
static_assert(offsetof(AutoAddColorComponent_GetIsAutoPainting, ReturnValue) == 0x000000, "Member 'AutoAddColorComponent_GetIsAutoPainting::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.GetMeshesBeingAutoPainted
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorComponent_GetMeshesBeingAutoPainted final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPAutoAddColorSettings> ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorComponent_GetMeshesBeingAutoPainted) == 0x000008, "Wrong alignment on AutoAddColorComponent_GetMeshesBeingAutoPainted");
static_assert(sizeof(AutoAddColorComponent_GetMeshesBeingAutoPainted) == 0x000050, "Wrong size on AutoAddColorComponent_GetMeshesBeingAutoPainted");
static_assert(offsetof(AutoAddColorComponent_GetMeshesBeingAutoPainted, ReturnValue) == 0x000000, "Member 'AutoAddColorComponent_GetMeshesBeingAutoPainted::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.IsAutoPaintedMeshPaused
// 0x0010 (0x0010 - 0x0000)
struct AutoAddColorComponent_IsAutoPaintedMeshPaused final
{
public:
	const class UPrimitiveComponent*              MeshComponent;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoAddColorComponent_IsAutoPaintedMeshPaused) == 0x000008, "Wrong alignment on AutoAddColorComponent_IsAutoPaintedMeshPaused");
static_assert(sizeof(AutoAddColorComponent_IsAutoPaintedMeshPaused) == 0x000010, "Wrong size on AutoAddColorComponent_IsAutoPaintedMeshPaused");
static_assert(offsetof(AutoAddColorComponent_IsAutoPaintedMeshPaused, MeshComponent) == 0x000000, "Member 'AutoAddColorComponent_IsAutoPaintedMeshPaused::MeshComponent' has a wrong offset!");
static_assert(offsetof(AutoAddColorComponent_IsAutoPaintedMeshPaused, ReturnValue) == 0x000008, "Member 'AutoAddColorComponent_IsAutoPaintedMeshPaused::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.IsNewRoundOfTasksGoingToStartAfterDelay
// 0x0001 (0x0001 - 0x0000)
struct AutoAddColorComponent_IsNewRoundOfTasksGoingToStartAfterDelay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorComponent_IsNewRoundOfTasksGoingToStartAfterDelay) == 0x000001, "Wrong alignment on AutoAddColorComponent_IsNewRoundOfTasksGoingToStartAfterDelay");
static_assert(sizeof(AutoAddColorComponent_IsNewRoundOfTasksGoingToStartAfterDelay) == 0x000001, "Wrong size on AutoAddColorComponent_IsNewRoundOfTasksGoingToStartAfterDelay");
static_assert(offsetof(AutoAddColorComponent_IsNewRoundOfTasksGoingToStartAfterDelay, ReturnValue) == 0x000000, "Member 'AutoAddColorComponent_IsNewRoundOfTasksGoingToStartAfterDelay::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorEntireMeshComponent.AddAutoPaintEntireMesh
// 0x08B0 (0x08B0 - 0x0000)
struct AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintOnEntireMeshSettings        PaintEntireMeshSettings;                           // 0x0008(0x0458)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0460(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x0590(0x0318)(Parm, NativeAccessSpecifierPublic)
	bool                                          ResumeIfPaused;                                    // 0x08A8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x08A9(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AA[0x6];                                      // 0x08AA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh) == 0x000008, "Wrong alignment on AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh");
static_assert(sizeof(AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh) == 0x0008B0, "Wrong size on AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh");
static_assert(offsetof(AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh, MeshComponent) == 0x000000, "Member 'AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh::MeshComponent' has a wrong offset!");
static_assert(offsetof(AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh, PaintEntireMeshSettings) == 0x000008, "Member 'AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh::PaintEntireMeshSettings' has a wrong offset!");
static_assert(offsetof(AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh, AdditionalData) == 0x000460, "Member 'AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh::AdditionalData' has a wrong offset!");
static_assert(offsetof(AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh, AutoAddColorSettings) == 0x000590, "Member 'AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh::AutoAddColorSettings' has a wrong offset!");
static_assert(offsetof(AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh, ResumeIfPaused) == 0x0008A8, "Member 'AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh::ResumeIfPaused' has a wrong offset!");
static_assert(offsetof(AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh, ReturnValue) == 0x0008A9, "Member 'AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorEntireMeshComponent.GetAutoPaintingEntireMeshesAdditionalDataSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesAdditionalDataSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPAdditionalDataToPassThroughInfo> ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesAdditionalDataSettings) == 0x000008, "Wrong alignment on AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesAdditionalDataSettings");
static_assert(sizeof(AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesAdditionalDataSettings) == 0x000050, "Wrong size on AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesAdditionalDataSettings");
static_assert(offsetof(AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesAdditionalDataSettings, ReturnValue) == 0x000000, "Member 'AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesAdditionalDataSettings::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorEntireMeshComponent.GetAutoPaintingEntireMeshesPaintSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesPaintSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPPaintOnEntireMeshSettings> ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesPaintSettings) == 0x000008, "Wrong alignment on AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesPaintSettings");
static_assert(sizeof(AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesPaintSettings) == 0x000050, "Wrong size on AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesPaintSettings");
static_assert(offsetof(AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesPaintSettings, ReturnValue) == 0x000000, "Member 'AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesPaintSettings::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorEntireMeshComponent.UpdateAutoPaintedEntireMesh
// 0x08A8 (0x08A8 - 0x0000)
struct AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintOnEntireMeshSettings        PaintEntireMeshSettings;                           // 0x0008(0x0458)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0460(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x0590(0x0318)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh) == 0x000008, "Wrong alignment on AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh");
static_assert(sizeof(AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh) == 0x0008A8, "Wrong size on AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh");
static_assert(offsetof(AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh, MeshComponent) == 0x000000, "Member 'AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh::MeshComponent' has a wrong offset!");
static_assert(offsetof(AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh, PaintEntireMeshSettings) == 0x000008, "Member 'AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh::PaintEntireMeshSettings' has a wrong offset!");
static_assert(offsetof(AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh, AdditionalData) == 0x000460, "Member 'AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh::AdditionalData' has a wrong offset!");
static_assert(offsetof(AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh, AutoAddColorSettings) == 0x000590, "Member 'AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh::AutoAddColorSettings' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorPaintAtLocComponent.AddAutoPaintAtLocation
// 0x09A0 (0x09A0 - 0x0000)
struct AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintAtLocationSettings          PaintAtLocationSettings;                           // 0x0008(0x0548)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0550(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x0680(0x0318)(Parm, NativeAccessSpecifierPublic)
	bool                                          ResumeIfPaused;                                    // 0x0998(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0999(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99A[0x6];                                      // 0x099A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation) == 0x000008, "Wrong alignment on AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation");
static_assert(sizeof(AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation) == 0x0009A0, "Wrong size on AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation, MeshComponent) == 0x000000, "Member 'AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation::MeshComponent' has a wrong offset!");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation, PaintAtLocationSettings) == 0x000008, "Member 'AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation::PaintAtLocationSettings' has a wrong offset!");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation, AdditionalData) == 0x000550, "Member 'AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation::AdditionalData' has a wrong offset!");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation, AutoAddColorSettings) == 0x000680, "Member 'AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation::AutoAddColorSettings' has a wrong offset!");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation, ResumeIfPaused) == 0x000998, "Member 'AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation::ResumeIfPaused' has a wrong offset!");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation, ReturnValue) == 0x000999, "Member 'AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorPaintAtLocComponent.GetAutoPaintingAtLocationAdditionalDataSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationAdditionalDataSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPAdditionalDataToPassThroughInfo> ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationAdditionalDataSettings) == 0x000008, "Wrong alignment on AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationAdditionalDataSettings");
static_assert(sizeof(AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationAdditionalDataSettings) == 0x000050, "Wrong size on AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationAdditionalDataSettings");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationAdditionalDataSettings, ReturnValue) == 0x000000, "Member 'AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationAdditionalDataSettings::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorPaintAtLocComponent.GetAutoPaintingAtLocationPaintSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationPaintSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPPaintAtLocationSettings> ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationPaintSettings) == 0x000008, "Wrong alignment on AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationPaintSettings");
static_assert(sizeof(AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationPaintSettings) == 0x000050, "Wrong size on AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationPaintSettings");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationPaintSettings, ReturnValue) == 0x000000, "Member 'AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationPaintSettings::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorPaintAtLocComponent.UpdateAutoPaintedAtLocation
// 0x0998 (0x0998 - 0x0000)
struct AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintAtLocationSettings          PaintAtLocationSettings;                           // 0x0008(0x0548)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0550(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x0680(0x0318)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation) == 0x000008, "Wrong alignment on AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation");
static_assert(sizeof(AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation) == 0x000998, "Wrong size on AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation, MeshComponent) == 0x000000, "Member 'AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation::MeshComponent' has a wrong offset!");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation, PaintAtLocationSettings) == 0x000008, "Member 'AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation::PaintAtLocationSettings' has a wrong offset!");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation, AdditionalData) == 0x000550, "Member 'AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation::AdditionalData' has a wrong offset!");
static_assert(offsetof(AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation, AutoAddColorSettings) == 0x000680, "Member 'AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation::AutoAddColorSettings' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorWithinAreaComponent.AddAutoPaintWithinArea
// 0x08E8 (0x08E8 - 0x0000)
struct AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintWithinAreaSettings          PaintWithinAreaSettings;                           // 0x0008(0x0490)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0498(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x05C8(0x0318)(Parm, NativeAccessSpecifierPublic)
	bool                                          ResumeIfPaused;                                    // 0x08E0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x08E1(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E2[0x6];                                      // 0x08E2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea) == 0x000008, "Wrong alignment on AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea");
static_assert(sizeof(AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea) == 0x0008E8, "Wrong size on AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea");
static_assert(offsetof(AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea, MeshComponent) == 0x000000, "Member 'AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea::MeshComponent' has a wrong offset!");
static_assert(offsetof(AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea, PaintWithinAreaSettings) == 0x000008, "Member 'AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea::PaintWithinAreaSettings' has a wrong offset!");
static_assert(offsetof(AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea, AdditionalData) == 0x000498, "Member 'AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea::AdditionalData' has a wrong offset!");
static_assert(offsetof(AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea, AutoAddColorSettings) == 0x0005C8, "Member 'AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea::AutoAddColorSettings' has a wrong offset!");
static_assert(offsetof(AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea, ResumeIfPaused) == 0x0008E0, "Member 'AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea::ResumeIfPaused' has a wrong offset!");
static_assert(offsetof(AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea, ReturnValue) == 0x0008E1, "Member 'AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorWithinAreaComponent.GetAutoPaintingWithinAreaAdditionalDataSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaAdditionalDataSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPAdditionalDataToPassThroughInfo> ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaAdditionalDataSettings) == 0x000008, "Wrong alignment on AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaAdditionalDataSettings");
static_assert(sizeof(AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaAdditionalDataSettings) == 0x000050, "Wrong size on AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaAdditionalDataSettings");
static_assert(offsetof(AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaAdditionalDataSettings, ReturnValue) == 0x000000, "Member 'AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaAdditionalDataSettings::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorWithinAreaComponent.GetAutoPaintingWithinAreaPaintSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaPaintSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPPaintWithinAreaSettings> ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaPaintSettings) == 0x000008, "Wrong alignment on AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaPaintSettings");
static_assert(sizeof(AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaPaintSettings) == 0x000050, "Wrong size on AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaPaintSettings");
static_assert(offsetof(AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaPaintSettings, ReturnValue) == 0x000000, "Member 'AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaPaintSettings::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.AutoAddColorWithinAreaComponent.UpdateAutoPaintedWithinArea
// 0x08E0 (0x08E0 - 0x0000)
struct AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintWithinAreaSettings          PaintWithinAreaSettings;                           // 0x0008(0x0490)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0498(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x05C8(0x0318)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea) == 0x000008, "Wrong alignment on AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea");
static_assert(sizeof(AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea) == 0x0008E0, "Wrong size on AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea");
static_assert(offsetof(AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea, MeshComponent) == 0x000000, "Member 'AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea::MeshComponent' has a wrong offset!");
static_assert(offsetof(AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea, PaintWithinAreaSettings) == 0x000008, "Member 'AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea::PaintWithinAreaSettings' has a wrong offset!");
static_assert(offsetof(AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea, AdditionalData) == 0x000498, "Member 'AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea::AdditionalData' has a wrong offset!");
static_assert(offsetof(AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea, AutoAddColorSettings) == 0x0005C8, "Member 'AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea::AutoAddColorSettings' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintClothOverlapComponent.GetClothObjectsToSphereTrace
// 0x0010 (0x0010 - 0x0000)
struct VertexPaintClothOverlapComponent_GetClothObjectsToSphereTrace final
{
public:
	TArray<EObjectTypeQuery>                      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintClothOverlapComponent_GetClothObjectsToSphereTrace) == 0x000008, "Wrong alignment on VertexPaintClothOverlapComponent_GetClothObjectsToSphereTrace");
static_assert(sizeof(VertexPaintClothOverlapComponent_GetClothObjectsToSphereTrace) == 0x000010, "Wrong size on VertexPaintClothOverlapComponent_GetClothObjectsToSphereTrace");
static_assert(offsetof(VertexPaintClothOverlapComponent_GetClothObjectsToSphereTrace, ReturnValue) == 0x000000, "Member 'VertexPaintClothOverlapComponent_GetClothObjectsToSphereTrace::ReturnValue' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintClothOverlapComponent.SetClothObjectsTypesToSphereTrace
// 0x0010 (0x0010 - 0x0000)
struct VertexPaintClothOverlapComponent_SetClothObjectsTypesToSphereTrace final
{
public:
	TArray<EObjectTypeQuery>                      ClothObjectTypes;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintClothOverlapComponent_SetClothObjectsTypesToSphereTrace) == 0x000008, "Wrong alignment on VertexPaintClothOverlapComponent_SetClothObjectsTypesToSphereTrace");
static_assert(sizeof(VertexPaintClothOverlapComponent_SetClothObjectsTypesToSphereTrace) == 0x000010, "Wrong size on VertexPaintClothOverlapComponent_SetClothObjectsTypesToSphereTrace");
static_assert(offsetof(VertexPaintClothOverlapComponent_SetClothObjectsTypesToSphereTrace, ClothObjectTypes) == 0x000000, "Member 'VertexPaintClothOverlapComponent_SetClothObjectsTypesToSphereTrace::ClothObjectTypes' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintClothOverlapComponent.SetClothOverlapTracingEnabled
// 0x0001 (0x0001 - 0x0000)
struct VertexPaintClothOverlapComponent_SetClothOverlapTracingEnabled final
{
public:
	bool                                          EnableClothTracing;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VertexPaintClothOverlapComponent_SetClothOverlapTracingEnabled) == 0x000001, "Wrong alignment on VertexPaintClothOverlapComponent_SetClothOverlapTracingEnabled");
static_assert(sizeof(VertexPaintClothOverlapComponent_SetClothOverlapTracingEnabled) == 0x000001, "Wrong size on VertexPaintClothOverlapComponent_SetClothOverlapTracingEnabled");
static_assert(offsetof(VertexPaintClothOverlapComponent_SetClothOverlapTracingEnabled, EnableClothTracing) == 0x000000, "Member 'VertexPaintClothOverlapComponent_SetClothOverlapTracingEnabled::EnableClothTracing' has a wrong offset!");

// Function VertexPaintDetectionPlugin.VertexPaintColorSnippetRefs.CheckAndGetTheComponentsThatMatchGroupChildSnippets
// 0x0080 (0x0080 - 0x0000)
struct VertexPaintColorSnippetRefs_CheckAndGetTheComponentsThatMatchGroupChildSnippets final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
