#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Part_MaceHead_D

#include "Basic.hpp"

#include "Modular_MaceHead_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_Part_MaceHead_D.Weapon_Part_MaceHead_D_C
// 0x0080 (0x0588 - 0x0508)
class AWeapon_Part_MaceHead_D_C final : public AModular_MaceHead_Master_C
{
public:
	class UArrowComponent*                        ArrowEdge8;                                        // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip8;                                              // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowEdge7;                                        // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip7;                                              // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowEdge6;                                        // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip6;                                              // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowEdge5;                                        // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip5;                                              // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowEdge4;                                        // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip4;                                              // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowEdge3;                                        // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip3;                                              // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowEdge2;                                        // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip2;                                              // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowEdge1;                                        // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1_0;                                            // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Weapon_Part_MaceHead_D_C">();
	}
	static class AWeapon_Part_MaceHead_D_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapon_Part_MaceHead_D_C>();
	}
};
static_assert(alignof(AWeapon_Part_MaceHead_D_C) == 0x000008, "Wrong alignment on AWeapon_Part_MaceHead_D_C");
static_assert(sizeof(AWeapon_Part_MaceHead_D_C) == 0x000588, "Wrong size on AWeapon_Part_MaceHead_D_C");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, ArrowEdge8) == 0x000508, "Member 'AWeapon_Part_MaceHead_D_C::ArrowEdge8' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, Tip8) == 0x000510, "Member 'AWeapon_Part_MaceHead_D_C::Tip8' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, ArrowEdge7) == 0x000518, "Member 'AWeapon_Part_MaceHead_D_C::ArrowEdge7' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, Tip7) == 0x000520, "Member 'AWeapon_Part_MaceHead_D_C::Tip7' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, ArrowEdge6) == 0x000528, "Member 'AWeapon_Part_MaceHead_D_C::ArrowEdge6' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, Tip6) == 0x000530, "Member 'AWeapon_Part_MaceHead_D_C::Tip6' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, ArrowEdge5) == 0x000538, "Member 'AWeapon_Part_MaceHead_D_C::ArrowEdge5' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, Tip5) == 0x000540, "Member 'AWeapon_Part_MaceHead_D_C::Tip5' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, ArrowEdge4) == 0x000548, "Member 'AWeapon_Part_MaceHead_D_C::ArrowEdge4' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, Tip4) == 0x000550, "Member 'AWeapon_Part_MaceHead_D_C::Tip4' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, ArrowEdge3) == 0x000558, "Member 'AWeapon_Part_MaceHead_D_C::ArrowEdge3' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, Tip3) == 0x000560, "Member 'AWeapon_Part_MaceHead_D_C::Tip3' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, ArrowEdge2) == 0x000568, "Member 'AWeapon_Part_MaceHead_D_C::ArrowEdge2' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, Tip2) == 0x000570, "Member 'AWeapon_Part_MaceHead_D_C::Tip2' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, ArrowEdge1) == 0x000578, "Member 'AWeapon_Part_MaceHead_D_C::ArrowEdge1' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_D_C, Tip1_0) == 0x000580, "Member 'AWeapon_Part_MaceHead_D_C::Tip1_0' has a wrong offset!");

}

