#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Part_MaceHead_A

#include "Basic.hpp"

#include "Modular_MaceHead_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_Part_MaceHead_A.Weapon_Part_MaceHead_A_C
// 0x0060 (0x0568 - 0x0508)
class AWeapon_Part_MaceHead_A_C final : public AModular_MaceHead_Master_C
{
public:
	class UArrowComponent*                        ArrowTip6;                                         // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip6;                                              // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip5;                                         // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip5;                                              // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip4;                                         // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip4;                                              // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip3;                                         // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip3;                                              // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip2;                                         // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip1;                                         // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip2;                                              // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1_0;                                            // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Weapon_Part_MaceHead_A_C">();
	}
	static class AWeapon_Part_MaceHead_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapon_Part_MaceHead_A_C>();
	}
};
static_assert(alignof(AWeapon_Part_MaceHead_A_C) == 0x000008, "Wrong alignment on AWeapon_Part_MaceHead_A_C");
static_assert(sizeof(AWeapon_Part_MaceHead_A_C) == 0x000568, "Wrong size on AWeapon_Part_MaceHead_A_C");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, ArrowTip6) == 0x000508, "Member 'AWeapon_Part_MaceHead_A_C::ArrowTip6' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, Tip6) == 0x000510, "Member 'AWeapon_Part_MaceHead_A_C::Tip6' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, ArrowTip5) == 0x000518, "Member 'AWeapon_Part_MaceHead_A_C::ArrowTip5' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, Tip5) == 0x000520, "Member 'AWeapon_Part_MaceHead_A_C::Tip5' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, ArrowTip4) == 0x000528, "Member 'AWeapon_Part_MaceHead_A_C::ArrowTip4' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, Tip4) == 0x000530, "Member 'AWeapon_Part_MaceHead_A_C::Tip4' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, ArrowTip3) == 0x000538, "Member 'AWeapon_Part_MaceHead_A_C::ArrowTip3' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, Tip3) == 0x000540, "Member 'AWeapon_Part_MaceHead_A_C::Tip3' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, ArrowTip2) == 0x000548, "Member 'AWeapon_Part_MaceHead_A_C::ArrowTip2' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, ArrowTip1) == 0x000550, "Member 'AWeapon_Part_MaceHead_A_C::ArrowTip1' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, Tip2) == 0x000558, "Member 'AWeapon_Part_MaceHead_A_C::Tip2' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_A_C, Tip1_0) == 0x000560, "Member 'AWeapon_Part_MaceHead_A_C::Tip1_0' has a wrong offset!");

}

