#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Sword_Grip_20GS

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Weapon_Sword_Grip_20GS.Weapon_Sword_Grip_20GS_C.UserConstructionScript
// 0x0118 (0x0118 - 0x0000)
struct Weapon_Sword_Grip_20GS_C_UserConstructionScript final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0020(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Weapon_Sword_Grip_20GS_C_UserConstructionScript) == 0x000008, "Wrong alignment on Weapon_Sword_Grip_20GS_C_UserConstructionScript");
static_assert(sizeof(Weapon_Sword_Grip_20GS_C_UserConstructionScript) == 0x000118, "Wrong size on Weapon_Sword_Grip_20GS_C_UserConstructionScript");
static_assert(offsetof(Weapon_Sword_Grip_20GS_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'Weapon_Sword_Grip_20GS_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Sword_Grip_20GS_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'Weapon_Sword_Grip_20GS_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Sword_Grip_20GS_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000020, "Member 'Weapon_Sword_Grip_20GS_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

