#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Part_Mace_Grip_Tier_Mid_S

#include "Basic.hpp"


namespace SDK::Params
{

// Function Weapon_Part_Mace_Grip_Tier_Mid_S.Weapon_Part_Mace_Grip_Tier_Mid_S_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript final
{
public:
	const class UClass*                           Temp_class_Variable;                               // 0x0000(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UClass*                           Temp_class_Variable_1;                             // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript) == 0x000008, "Wrong alignment on Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript");
static_assert(sizeof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript) == 0x000050, "Wrong size on Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript");
static_assert(offsetof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript, Temp_class_Variable) == 0x000000, "Member 'Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript, Temp_class_Variable_1) == 0x000008, "Member 'Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_1) == 0x000014, "Member 'Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript, CallFunc_Right_ReturnValue) == 0x000028, "Member 'Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript, CallFunc_Left_ReturnValue) == 0x000038, "Member 'Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript, CallFunc_Contains_ReturnValue) == 0x000048, "Member 'Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript, CallFunc_Contains_ReturnValue_1) == 0x000049, "Member 'Weapon_Part_Mace_Grip_Tier_Mid_S_C_UserConstructionScript::CallFunc_Contains_ReturnValue_1' has a wrong offset!");

}

