#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Willie_Torso_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Willie_Torso_BP.Willie_Torso_BP_C
// 0x0028 (0x02B8 - 0x0290)
class AWillie_Torso_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPhysicalAnimationComponent*            PhysicalAnimation;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AWillie_BP_C*                           Parent_WIllie;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Willie_Torso_BP(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Willie_Torso_BP_C">();
	}
	static class AWillie_Torso_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWillie_Torso_BP_C>();
	}
};
static_assert(alignof(AWillie_Torso_BP_C) == 0x000008, "Wrong alignment on AWillie_Torso_BP_C");
static_assert(sizeof(AWillie_Torso_BP_C) == 0x0002B8, "Wrong size on AWillie_Torso_BP_C");
static_assert(offsetof(AWillie_Torso_BP_C, UberGraphFrame) == 0x000290, "Member 'AWillie_Torso_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWillie_Torso_BP_C, PhysicalAnimation) == 0x000298, "Member 'AWillie_Torso_BP_C::PhysicalAnimation' has a wrong offset!");
static_assert(offsetof(AWillie_Torso_BP_C, Mesh) == 0x0002A0, "Member 'AWillie_Torso_BP_C::Mesh' has a wrong offset!");
static_assert(offsetof(AWillie_Torso_BP_C, DefaultSceneRoot) == 0x0002A8, "Member 'AWillie_Torso_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AWillie_Torso_BP_C, Parent_WIllie) == 0x0002B0, "Member 'AWillie_Torso_BP_C::Parent_WIllie' has a wrong offset!");

}

