#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Willie_BP_NoBrain

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Willie_BP_NoBrain.Willie_BP_NoBrain_C.ExecuteUbergraph_Willie_BP_NoBrain
// 0x0028 (0x0028 - 0x0000)
struct Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain) == 0x000008, "Wrong alignment on Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain");
static_assert(sizeof(Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain) == 0x000028, "Wrong size on Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain");
static_assert(offsetof(Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain, EntryPoint) == 0x000000, "Member 'Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain::EntryPoint' has a wrong offset!");
static_assert(offsetof(Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000008, "Member 'Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'Willie_BP_NoBrain_C_ExecuteUbergraph_Willie_BP_NoBrain::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Willie_BP_NoBrain.Willie_BP_NoBrain_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Willie_BP_NoBrain_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Willie_BP_NoBrain_C_ReceiveTick) == 0x000004, "Wrong alignment on Willie_BP_NoBrain_C_ReceiveTick");
static_assert(sizeof(Willie_BP_NoBrain_C_ReceiveTick) == 0x000004, "Wrong size on Willie_BP_NoBrain_C_ReceiveTick");
static_assert(offsetof(Willie_BP_NoBrain_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Willie_BP_NoBrain_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

