#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Willie_BP_DressUp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Willie_BP_DressUp.Willie_BP_DressUp_C.ExecuteUbergraph_Willie_BP_DressUp
// 0x0138 (0x0138 - 0x0000)
struct Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0038(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp) == 0x000008, "Wrong alignment on Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp");
static_assert(sizeof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp) == 0x000138, "Wrong size on Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp");
static_assert(offsetof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp, EntryPoint) == 0x000000, "Member 'Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000008, "Member 'Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000038, "Member 'Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp, K2Node_Event_DeltaSeconds) == 0x000130, "Member 'Willie_BP_DressUp_C_ExecuteUbergraph_Willie_BP_DressUp::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Willie_BP_DressUp.Willie_BP_DressUp_C.Get Damage
// 0x00B0 (0x00B0 - 0x0000)
struct Willie_BP_DressUp_C_Get_Damage final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   bone;                                              // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Raw_Damage;                                        // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Cutting_Power;                                     // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Inside;                                            // 0x0078(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    Damaged_Mesh;                                      // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Dism_Blunt;                                        // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lower_Threshold;                                   // 0x008C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Shockwave;                                         // 0x008D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    Hit_By_Component;                                  // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Stab_;                                             // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          Hit_Box;                                           // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Damage_Out;                                        // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Willie_BP_DressUp_C_Get_Damage) == 0x000008, "Wrong alignment on Willie_BP_DressUp_C_Get_Damage");
static_assert(sizeof(Willie_BP_DressUp_C_Get_Damage) == 0x0000B0, "Wrong size on Willie_BP_DressUp_C_Get_Damage");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Impulse) == 0x000000, "Member 'Willie_BP_DressUp_C_Get_Damage::Impulse' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Velocity) == 0x000018, "Member 'Willie_BP_DressUp_C_Get_Damage::Velocity' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Location) == 0x000030, "Member 'Willie_BP_DressUp_C_Get_Damage::Location' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Normal) == 0x000048, "Member 'Willie_BP_DressUp_C_Get_Damage::Normal' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, bone) == 0x000060, "Member 'Willie_BP_DressUp_C_Get_Damage::bone' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Raw_Damage) == 0x000068, "Member 'Willie_BP_DressUp_C_Get_Damage::Raw_Damage' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Cutting_Power) == 0x000070, "Member 'Willie_BP_DressUp_C_Get_Damage::Cutting_Power' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Inside) == 0x000078, "Member 'Willie_BP_DressUp_C_Get_Damage::Inside' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Damaged_Mesh) == 0x000080, "Member 'Willie_BP_DressUp_C_Get_Damage::Damaged_Mesh' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Dism_Blunt) == 0x000088, "Member 'Willie_BP_DressUp_C_Get_Damage::Dism_Blunt' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Lower_Threshold) == 0x00008C, "Member 'Willie_BP_DressUp_C_Get_Damage::Lower_Threshold' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Shockwave) == 0x00008D, "Member 'Willie_BP_DressUp_C_Get_Damage::Shockwave' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Hit_By_Component) == 0x000090, "Member 'Willie_BP_DressUp_C_Get_Damage::Hit_By_Component' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Stab_) == 0x000098, "Member 'Willie_BP_DressUp_C_Get_Damage::Stab_' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Hit_Box) == 0x0000A0, "Member 'Willie_BP_DressUp_C_Get_Damage::Hit_Box' has a wrong offset!");
static_assert(offsetof(Willie_BP_DressUp_C_Get_Damage, Damage_Out) == 0x0000A8, "Member 'Willie_BP_DressUp_C_Get_Damage::Damage_Out' has a wrong offset!");

// Function Willie_BP_DressUp.Willie_BP_DressUp_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Willie_BP_DressUp_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Willie_BP_DressUp_C_ReceiveTick) == 0x000004, "Wrong alignment on Willie_BP_DressUp_C_ReceiveTick");
static_assert(sizeof(Willie_BP_DressUp_C_ReceiveTick) == 0x000004, "Wrong size on Willie_BP_DressUp_C_ReceiveTick");
static_assert(offsetof(Willie_BP_DressUp_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Willie_BP_DressUp_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

