#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CopyPose1

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_CopyPose1.ABP_CopyPose1_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_CopyPose1_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_CopyPose1_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_CopyPose1_C_AnimGraph");
static_assert(sizeof(ABP_CopyPose1_C_AnimGraph) == 0x000010, "Wrong size on ABP_CopyPose1_C_AnimGraph");
static_assert(offsetof(ABP_CopyPose1_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_CopyPose1_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_CopyPose1.ABP_CopyPose1_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_CopyPose1_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CopyPose1_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_CopyPose1_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_CopyPose1_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_CopyPose1_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_CopyPose1_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_CopyPose1_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_CopyPose1.ABP_CopyPose1_C.ExecuteUbergraph_ABP_CopyPose1
// 0x0020 (0x0020 - 0x0000)
struct ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWillie_BP_C*                           K2Node_DynamicCast_AsWillie_BP;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1) == 0x000008, "Wrong alignment on ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1");
static_assert(sizeof(ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1) == 0x000020, "Wrong size on ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1");
static_assert(offsetof(ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1, EntryPoint) == 0x000000, "Member 'ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1, K2Node_DynamicCast_AsWillie_BP) == 0x000010, "Member 'ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1::K2Node_DynamicCast_AsWillie_BP' has a wrong offset!");
static_assert(offsetof(ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_CopyPose1_C_ExecuteUbergraph_ABP_CopyPose1::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

