#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CandleLight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CandleLight.BP_CandleLight_C.ExecuteUbergraph_BP_CandleLight
// 0x01B0 (0x01B0 - 0x0000)
struct BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0038(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight) == 0x000008, "Wrong alignment on BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight");
static_assert(sizeof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight) == 0x0001B0, "Wrong size on BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, EntryPoint) == 0x000000, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000020, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000038, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000130, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000138, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000140, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_RandomFloatInRange_ReturnValue) == 0x000148, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_MakeColor_ReturnValue) == 0x000158, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000168, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000170, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000180, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000188, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000190, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000198, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Delay_Duration_ImplicitCast) == 0x0001A0, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_Delay_Duration_ImplicitCast_1) == 0x0001A4, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight, CallFunc_MakeColor_G_ImplicitCast) == 0x0001A8, "Member 'BP_CandleLight_C_ExecuteUbergraph_BP_CandleLight::CallFunc_MakeColor_G_ImplicitCast' has a wrong offset!");

}

