#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CandleLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CandleLight.BP_CandleLight_C
// 0x0050 (0x02E0 - 0x0290)
class ABP_CandleLight_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_EE7D0C9A4078E1025B74E08E482262C8; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_EE7D0C9A4078E1025B74E08E482262C8; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Defoult_light_color;                               // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Light_Inensity;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Attenuation_Radius;                                // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Wiggle;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CandleLight(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CandleLight_C">();
	}
	static class ABP_CandleLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CandleLight_C>();
	}
};
static_assert(alignof(ABP_CandleLight_C) == 0x000008, "Wrong alignment on ABP_CandleLight_C");
static_assert(sizeof(ABP_CandleLight_C) == 0x0002E0, "Wrong size on ABP_CandleLight_C");
static_assert(offsetof(ABP_CandleLight_C, UberGraphFrame) == 0x000290, "Member 'ABP_CandleLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CandleLight_C, PointLight) == 0x000298, "Member 'ABP_CandleLight_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_CandleLight_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_CandleLight_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CandleLight_C, Timeline_NewTrack_0_EE7D0C9A4078E1025B74E08E482262C8) == 0x0002A8, "Member 'ABP_CandleLight_C::Timeline_NewTrack_0_EE7D0C9A4078E1025B74E08E482262C8' has a wrong offset!");
static_assert(offsetof(ABP_CandleLight_C, Timeline__Direction_EE7D0C9A4078E1025B74E08E482262C8) == 0x0002AC, "Member 'ABP_CandleLight_C::Timeline__Direction_EE7D0C9A4078E1025B74E08E482262C8' has a wrong offset!");
static_assert(offsetof(ABP_CandleLight_C, Timeline) == 0x0002B0, "Member 'ABP_CandleLight_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_CandleLight_C, Defoult_light_color) == 0x0002B8, "Member 'ABP_CandleLight_C::Defoult_light_color' has a wrong offset!");
static_assert(offsetof(ABP_CandleLight_C, Light_Inensity) == 0x0002C8, "Member 'ABP_CandleLight_C::Light_Inensity' has a wrong offset!");
static_assert(offsetof(ABP_CandleLight_C, Attenuation_Radius) == 0x0002D0, "Member 'ABP_CandleLight_C::Attenuation_Radius' has a wrong offset!");
static_assert(offsetof(ABP_CandleLight_C, Wiggle) == 0x0002D8, "Member 'ABP_CandleLight_C::Wiggle' has a wrong offset!");

}

