#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PhotoMode

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPC_PhotoMode.BPC_PhotoMode_C.Calculate Weight by Ref
// 0x0058 (0x0058 - 0x0000)
struct BPC_PhotoMode_C_Calculate_Weight_by_Ref final
{
public:
	class APostProcessVolume*                     PostProcessVolume;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        PropertyTotal;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PropertyCount;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PropertyValue;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceWeight;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PhotoMode_C_Calculate_Weight_by_Ref) == 0x000008, "Wrong alignment on BPC_PhotoMode_C_Calculate_Weight_by_Ref");
static_assert(sizeof(BPC_PhotoMode_C_Calculate_Weight_by_Ref) == 0x000058, "Wrong size on BPC_PhotoMode_C_Calculate_Weight_by_Ref");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, PostProcessVolume) == 0x000000, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::PostProcessVolume' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, PropertyTotal) == 0x000008, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::PropertyTotal' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, PropertyCount) == 0x000010, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::PropertyCount' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, PropertyValue) == 0x000018, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::PropertyValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, DistanceWeight) == 0x000020, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::DistanceWeight' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, Temp_real_Variable) == 0x000028, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Calculate_Weight_by_Ref, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'BPC_PhotoMode_C_Calculate_Weight_by_Ref::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BPC_PhotoMode.BPC_PhotoMode_C.Create Post Process
// 0x09D0 (0x09D0 - 0x0000)
struct BPC_PhotoMode_C_Create_Post_Process final
{
public:
	struct FPostProcessSettings                   CustomPostProcess;                                 // 0x0000(0x06F0)(Edit, BlueprintVisible)
	struct FVector                                CameraLocation;                                    // 0x06F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class APostProcessVolume*, struct FVector> VolumesExtent;                                     // 0x0708(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<class APostProcessVolume*, struct FTransform> PostProcessReferences;                             // 0x0758(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          bCurrentIsUnbound;                                 // 0x07A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GreatestPriorityFound;                             // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     CurrentVolume;                                     // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1[0x3];                                      // 0x07C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x07C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x07D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9[0x7];                                      // 0x07D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x07E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E9[0x7];                                      // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x07F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x07F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0800(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_809[0x7];                                      // 0x0809(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x0810(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_819[0x7];                                      // 0x0819(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAllImersedPostProcess_CameraLocation;  // 0x0820(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class APostProcessVolume*, struct FTransform> CallFunc_GetAllImersedPostProcess_VolumesTransforms; // 0x0838(0x0050)()
	TMap<class APostProcessVolume*, struct FVector> CallFunc_GetAllImersedPostProcess_VolumesExtent;   // 0x0888(0x0050)()
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x08D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x08E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E9[0x7];                                      // 0x08E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x08F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_908[0x8];                                      // 0x0908(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0910(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0970(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CustomPostProcess_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0978(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0988(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_989[0x7];                                      // 0x0989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostProcessVolume*>             CallFunc_Map_Keys_Keys;                            // 0x0990(0x0010)(ReferenceParm)
	class APostProcessVolume*                     CallFunc_Array_Get_Item;                           // 0x09A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x09A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x09AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x09AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x09AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AF[0x1];                                      // 0x09AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x09B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x09B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x09C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_GreatestPriorityFound_ImplicitCast; // 0x09C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PhotoMode_C_Create_Post_Process) == 0x000010, "Wrong alignment on BPC_PhotoMode_C_Create_Post_Process");
static_assert(sizeof(BPC_PhotoMode_C_Create_Post_Process) == 0x0009D0, "Wrong size on BPC_PhotoMode_C_Create_Post_Process");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CustomPostProcess) == 0x000000, "Member 'BPC_PhotoMode_C_Create_Post_Process::CustomPostProcess' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CameraLocation) == 0x0006F0, "Member 'BPC_PhotoMode_C_Create_Post_Process::CameraLocation' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, VolumesExtent) == 0x000708, "Member 'BPC_PhotoMode_C_Create_Post_Process::VolumesExtent' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, PostProcessReferences) == 0x000758, "Member 'BPC_PhotoMode_C_Create_Post_Process::PostProcessReferences' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, bCurrentIsUnbound) == 0x0007A8, "Member 'BPC_PhotoMode_C_Create_Post_Process::bCurrentIsUnbound' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, GreatestPriorityFound) == 0x0007B0, "Member 'BPC_PhotoMode_C_Create_Post_Process::GreatestPriorityFound' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CurrentVolume) == 0x0007B8, "Member 'BPC_PhotoMode_C_Create_Post_Process::CurrentVolume' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, Temp_bool_IsClosed_Variable) == 0x0007C0, "Member 'BPC_PhotoMode_C_Create_Post_Process::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, Temp_int_Loop_Counter_Variable) == 0x0007C4, "Member 'BPC_PhotoMode_C_Create_Post_Process::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Add_IntInt_ReturnValue) == 0x0007C8, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, Temp_int_Array_Index_Variable) == 0x0007CC, "Member 'BPC_PhotoMode_C_Create_Post_Process::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_GetOwner_ReturnValue) == 0x0007D0, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_IsValid_ReturnValue) == 0x0007D8, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, K2Node_DynamicCast_AsPawn) == 0x0007E0, "Member 'BPC_PhotoMode_C_Create_Post_Process::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, K2Node_DynamicCast_bSuccess) == 0x0007E8, "Member 'BPC_PhotoMode_C_Create_Post_Process::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_GetController_ReturnValue) == 0x0007F0, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_GetOwner_ReturnValue_1) == 0x0007F8, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, K2Node_DynamicCast_AsPlayer_Controller) == 0x000800, "Member 'BPC_PhotoMode_C_Create_Post_Process::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, K2Node_DynamicCast_bSuccess_1) == 0x000808, "Member 'BPC_PhotoMode_C_Create_Post_Process::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, K2Node_DynamicCast_AsPawn_1) == 0x000810, "Member 'BPC_PhotoMode_C_Create_Post_Process::K2Node_DynamicCast_AsPawn_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, K2Node_DynamicCast_bSuccess_2) == 0x000818, "Member 'BPC_PhotoMode_C_Create_Post_Process::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_GetAllImersedPostProcess_CameraLocation) == 0x000820, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_GetAllImersedPostProcess_CameraLocation' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_GetAllImersedPostProcess_VolumesTransforms) == 0x000838, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_GetAllImersedPostProcess_VolumesTransforms' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_GetAllImersedPostProcess_VolumesExtent) == 0x000888, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_GetAllImersedPostProcess_VolumesExtent' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_GetController_ReturnValue_1) == 0x0008D8, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, K2Node_DynamicCast_AsPlayer_Controller_1) == 0x0008E0, "Member 'BPC_PhotoMode_C_Create_Post_Process::K2Node_DynamicCast_AsPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, K2Node_DynamicCast_bSuccess_3) == 0x0008E8, "Member 'BPC_PhotoMode_C_Create_Post_Process::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0008F0, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_MakeTransform_ReturnValue) == 0x000910, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000970, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_FinishSpawningActor_ReturnValue) == 0x000978, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000980, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000988, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Map_Keys_Keys) == 0x000990, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Array_Get_Item) == 0x0009A0, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Array_Length_ReturnValue) == 0x0009A8, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Less_IntInt_ReturnValue) == 0x0009AC, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0009AD, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, Temp_bool_Has_Been_Initd_Variable) == 0x0009AE, "Member 'BPC_PhotoMode_C_Create_Post_Process::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0009B0, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0009B8, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0009C0, "Member 'BPC_PhotoMode_C_Create_Post_Process::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_Create_Post_Process, K2Node_VariableSet_GreatestPriorityFound_ImplicitCast) == 0x0009C8, "Member 'BPC_PhotoMode_C_Create_Post_Process::K2Node_VariableSet_GreatestPriorityFound_ImplicitCast' has a wrong offset!");

// Function BPC_PhotoMode.BPC_PhotoMode_C.ExecuteUbergraph_BPC_PhotoMode
// 0x0430 (0x0430 - 0x0000)
struct BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   K2Node_DynamicCast_AsCine_Camera_Component;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Gallery_C*                          CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_LastKey;                        // 0x0028(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_1;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_Key;                            // 0x0050(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0070(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   K2Node_DynamicCast_AsCine_Camera_Component_1;      // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0160(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_2;      // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EE[0x2];                                      // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x01F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_3;      // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_2;              // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x021E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21F[0x1];                                      // 0x021F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_4;      // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_5;      // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0248(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoMode_C*                        CallFunc_Create_ReturnValue_1;                     // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_Map_Keys_Keys;                            // 0x0358(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x036E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x036F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_3;              // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x03A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x03A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x03A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGlobalTimeDilation_TimeDilation_ImplicitCast; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_CurrentTimeDilation_ImplicitCast; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurrentTimeDilation_ImplicitCast_1; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGlobalTimeDilation_TimeDilation_ImplicitCast_1; // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x03C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DefaultFOV_ImplicitCast;        // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DefaultAperture_ImplicitCast;   // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DefaultFocalLength_ImplicitCast; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Size_ImplicitCast;               // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_GlobalTimeDilationBackup_ImplicitCast; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DefaultSpringArmLength_ImplicitCast; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurrentTimeDilation_ImplicitCast_2; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurrentTimeDilation_ImplicitCast_3; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_GlobalTimeDilationBackup_ImplicitCast_1; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentAperture_NewCurrentAperture_ImplicitCast; // 0x0418(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentFocalLength_InFocalLength_ImplicitCast; // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast; // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_TargetArmLength_ImplicitCast;   // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGlobalTimeDilation_TimeDilation_ImplicitCast_2; // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGlobalTimeDilation_TimeDilation_ImplicitCast_3; // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode) == 0x000010, "Wrong alignment on BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode");
static_assert(sizeof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode) == 0x000430, "Wrong size on BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, EntryPoint) == 0x000000, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_DynamicCast_AsCine_Camera_Component) == 0x000008, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_DynamicCast_AsCine_Camera_Component' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x000014, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_SetGamePaused_ReturnValue) == 0x000020, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_CustomEvent_LastKey) == 0x000028, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_CustomEvent_LastKey' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_1) == 0x000044, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_GetGlobalTimeDilation_ReturnValue_1) == 0x000048, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_GetGlobalTimeDilation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_CustomEvent_Key) == 0x000050, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_CustomEvent_Key' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_SetGamePaused_ReturnValue_1) == 0x000068, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_SwitchEnum_CmpSuccess_1) == 0x000069, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_MakeStruct_SlateBrush) == 0x000070, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_2) == 0x000140, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_DynamicCast_AsCine_Camera_Component_1) == 0x000148, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_DynamicCast_AsCine_Camera_Component_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000158, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_MakeStruct_SlateFontInfo) == 0x000160, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_3) == 0x0001C0, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_GetControlRotation_ReturnValue) == 0x0001C8, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, Temp_int_Loop_Counter_Variable) == 0x0001E0, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Add_IntInt_ReturnValue) == 0x0001E4, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_GetGlobalTimeDilation_ReturnValue_2) == 0x0001E8, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_GetGlobalTimeDilation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_4) == 0x0001EC, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_5) == 0x0001ED, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_GetOwner_ReturnValue) == 0x0001F0, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0001F8, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Array_Get_Item) == 0x000208, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Array_Length_ReturnValue) == 0x000210, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Less_IntInt_ReturnValue) == 0x000214, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_GetGlobalTimeDilation_ReturnValue_3) == 0x000218, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_GetGlobalTimeDilation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_6) == 0x00021C, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_SetGamePaused_ReturnValue_2) == 0x00021D, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_SetGamePaused_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_SwitchEnum_CmpSuccess_2) == 0x00021E, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_GetGlobalTimeDilation_ReturnValue_4) == 0x000220, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_GetGlobalTimeDilation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_7) == 0x000224, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_GetGlobalTimeDilation_ReturnValue_5) == 0x000228, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_GetGlobalTimeDilation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_GetOwner_ReturnValue_1) == 0x000230, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_8) == 0x000238, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, Temp_int_Loop_Counter_Variable_1) == 0x00023C, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Add_IntInt_ReturnValue_1) == 0x000240, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, Temp_bool_Has_Been_Initd_Variable) == 0x000244, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000248, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_9) == 0x000340, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_10) == 0x000341, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Create_ReturnValue_1) == 0x000348, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, Temp_bool_IsClosed_Variable) == 0x000350, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Map_Keys_Keys) == 0x000358, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Array_Length_ReturnValue_1) == 0x000368, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Less_IntInt_ReturnValue_1) == 0x00036C, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_11) == 0x00036D, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_12) == 0x00036E, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, Temp_bool_Has_Been_Initd_Variable_1) == 0x00036F, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_SetGamePaused_ReturnValue_3) == 0x000370, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_SetGamePaused_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_SwitchEnum_CmpSuccess_3) == 0x000371, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_GetControlRotation_ReturnValue_1) == 0x000378, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_GetControlRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, Temp_int_Array_Index_Variable_1) == 0x000390, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Array_Get_Item_1) == 0x000398, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Map_Find_Value) == 0x0003A0, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_Map_Find_ReturnValue) == 0x0003A1, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, K2Node_SwitchEnum_CmpSuccess_4) == 0x0003A2, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, Temp_bool_IsClosed_Variable_1) == 0x0003A3, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_13) == 0x0003A4, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode, CallFunc_IsValid_ReturnValue_14) == 0x0003A5, "Member 'BPC_PhotoMode_C_ExecuteUbergraph_BPC_PhotoMode::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
