#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_VertexPaint

#include "Basic.hpp"

#include "BodyPart_Enum_structs.hpp"


namespace SDK::Params
{

// Function BPI_VertexPaint.BPI_VertexPaint_C.Box Vertex Paint
// 0x0018 (0x0018 - 0x0000)
struct BPI_VertexPaint_C_Box_Vertex_Paint final
{
public:
	class UBoxComponent*                          Box;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   Hit_Bone;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyPart_Enum                                Hit_Body_Part;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Nul;                                               // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_VertexPaint_C_Box_Vertex_Paint) == 0x000008, "Wrong alignment on BPI_VertexPaint_C_Box_Vertex_Paint");
static_assert(sizeof(BPI_VertexPaint_C_Box_Vertex_Paint) == 0x000018, "Wrong size on BPI_VertexPaint_C_Box_Vertex_Paint");
static_assert(offsetof(BPI_VertexPaint_C_Box_Vertex_Paint, Box) == 0x000000, "Member 'BPI_VertexPaint_C_Box_Vertex_Paint::Box' has a wrong offset!");
static_assert(offsetof(BPI_VertexPaint_C_Box_Vertex_Paint, Hit_Bone) == 0x000008, "Member 'BPI_VertexPaint_C_Box_Vertex_Paint::Hit_Bone' has a wrong offset!");
static_assert(offsetof(BPI_VertexPaint_C_Box_Vertex_Paint, Hit_Body_Part) == 0x000010, "Member 'BPI_VertexPaint_C_Box_Vertex_Paint::Hit_Body_Part' has a wrong offset!");
static_assert(offsetof(BPI_VertexPaint_C_Box_Vertex_Paint, Nul) == 0x000011, "Member 'BPI_VertexPaint_C_Box_Vertex_Paint::Nul' has a wrong offset!");

}

