#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shield_BossGrip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModularWeaponBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Shield_BossGrip.Shield_BossGrip_C
// 0x0020 (0x0B50 - 0x0B30)
class AShield_BossGrip_C final : public AModularWeaponBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Shield_BossGrip_C;                  // 0x0B30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Base1_0;                                           // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1;                                              // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Buckler;                                           // 0x0B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Buckler_Buckler_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_Shield_BossGrip(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shield_BossGrip_C">();
	}
	static class AShield_BossGrip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AShield_BossGrip_C>();
	}
};
static_assert(alignof(AShield_BossGrip_C) == 0x000008, "Wrong alignment on AShield_BossGrip_C");
static_assert(sizeof(AShield_BossGrip_C) == 0x000B50, "Wrong size on AShield_BossGrip_C");
static_assert(offsetof(AShield_BossGrip_C, UberGraphFrame_Shield_BossGrip_C) == 0x000B30, "Member 'AShield_BossGrip_C::UberGraphFrame_Shield_BossGrip_C' has a wrong offset!");
static_assert(offsetof(AShield_BossGrip_C, Base1_0) == 0x000B38, "Member 'AShield_BossGrip_C::Base1_0' has a wrong offset!");
static_assert(offsetof(AShield_BossGrip_C, Tip1) == 0x000B40, "Member 'AShield_BossGrip_C::Tip1' has a wrong offset!");
static_assert(offsetof(AShield_BossGrip_C, Buckler) == 0x000B48, "Member 'AShield_BossGrip_C::Buckler' has a wrong offset!");

}

