#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Attention_NoGore1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Attention_NoGore1.UI_Attention_NoGore1_C
// 0x0068 (0x0348 - 0x02E0)
class UUI_Attention_NoGore1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_Opened;                                         // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewVar;                                            // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USG_Settings_C*                         SG_Settings;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         GI_Settings;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewVar_1;                                          // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Attention_NoGore1_Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Attention_NoGore1_Button_0_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Attention_NoGore1_Button_1_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Attention_NoGore1_Button_1_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Attention_NoGore1_Button_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Attention_NoGore1_Button_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Attention_NoGore1_Button_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Attention_NoGore1_Button_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Attention_NoGore_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Attention_NoGore1(int32 EntryPoint);
	class FText GetText();
	class FText GetText_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Attention_NoGore1_C">();
	}
	static class UUI_Attention_NoGore1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Attention_NoGore1_C>();
	}
};
static_assert(alignof(UUI_Attention_NoGore1_C) == 0x000008, "Wrong alignment on UUI_Attention_NoGore1_C");
static_assert(sizeof(UUI_Attention_NoGore1_C) == 0x000348, "Wrong size on UUI_Attention_NoGore1_C");
static_assert(offsetof(UUI_Attention_NoGore1_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_Attention_NoGore1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, Fade) == 0x0002E8, "Member 'UUI_Attention_NoGore1_C::Fade' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, Button) == 0x0002F0, "Member 'UUI_Attention_NoGore1_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, Button_0) == 0x0002F8, "Member 'UUI_Attention_NoGore1_C::Button_0' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, Button_1) == 0x000300, "Member 'UUI_Attention_NoGore1_C::Button_1' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, Image_1) == 0x000308, "Member 'UUI_Attention_NoGore1_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, Image_2) == 0x000310, "Member 'UUI_Attention_NoGore1_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, TextBlock_1) == 0x000318, "Member 'UUI_Attention_NoGore1_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, TextBlock_2) == 0x000320, "Member 'UUI_Attention_NoGore1_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, Is_Opened) == 0x000328, "Member 'UUI_Attention_NoGore1_C::Is_Opened' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, NewVar) == 0x00032C, "Member 'UUI_Attention_NoGore1_C::NewVar' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, SG_Settings) == 0x000330, "Member 'UUI_Attention_NoGore1_C::SG_Settings' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, GI_Settings) == 0x000338, "Member 'UUI_Attention_NoGore1_C::GI_Settings' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, NewVar_0) == 0x000340, "Member 'UUI_Attention_NoGore1_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UUI_Attention_NoGore1_C, NewVar_1) == 0x000344, "Member 'UUI_Attention_NoGore1_C::NewVar_1' has a wrong offset!");

}

