#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Controls

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Controls.UI_Controls_C.BndEvt__UI_Controls_CheckBox_0_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_Controls_C_BndEvt__UI_Controls_CheckBox_0_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Controls_C_BndEvt__UI_Controls_CheckBox_0_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on UI_Controls_C_BndEvt__UI_Controls_CheckBox_0_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(UI_Controls_C_BndEvt__UI_Controls_CheckBox_0_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on UI_Controls_C_BndEvt__UI_Controls_CheckBox_0_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(UI_Controls_C_BndEvt__UI_Controls_CheckBox_0_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'UI_Controls_C_BndEvt__UI_Controls_CheckBox_0_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function UI_Controls.UI_Controls_C.BndEvt__UI_Controls_CheckBox_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_Controls_C_BndEvt__UI_Controls_CheckBox_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Controls_C_BndEvt__UI_Controls_CheckBox_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on UI_Controls_C_BndEvt__UI_Controls_CheckBox_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(UI_Controls_C_BndEvt__UI_Controls_CheckBox_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on UI_Controls_C_BndEvt__UI_Controls_CheckBox_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(UI_Controls_C_BndEvt__UI_Controls_CheckBox_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'UI_Controls_C_BndEvt__UI_Controls_CheckBox_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function UI_Controls.UI_Controls_C.BndEvt__UI_Controls_Slider_Sensitivity_K2Node_ComponentBoundEvent_17_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_Controls_C_BndEvt__UI_Controls_Slider_Sensitivity_K2Node_ComponentBoundEvent_17_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Controls_C_BndEvt__UI_Controls_Slider_Sensitivity_K2Node_ComponentBoundEvent_17_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_Controls_C_BndEvt__UI_Controls_Slider_Sensitivity_K2Node_ComponentBoundEvent_17_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_Controls_C_BndEvt__UI_Controls_Slider_Sensitivity_K2Node_ComponentBoundEvent_17_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_Controls_C_BndEvt__UI_Controls_Slider_Sensitivity_K2Node_ComponentBoundEvent_17_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_Controls_C_BndEvt__UI_Controls_Slider_Sensitivity_K2Node_ComponentBoundEvent_17_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UI_Controls_C_BndEvt__UI_Controls_Slider_Sensitivity_K2Node_ComponentBoundEvent_17_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UI_Controls.UI_Controls_C.ExecuteUbergraph_UI_Controls
// 0x0148 (0x0148 - 0x0000)
struct UI_Controls_C_ExecuteUbergraph_UI_Controls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_KeyBinds_C*                         CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_AudioSettings_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_2;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_GameSettings_C*                     CallFunc_Create_ReturnValue_2;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_DisplaySettings_C*                  CallFunc_Create_ReturnValue_3;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x009C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_4;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_5;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USG_Settings_C*                         K2Node_DynamicCast_AsSG_Settings;                  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast_1; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast_2; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast_3; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Controls_C_ExecuteUbergraph_UI_Controls) == 0x000008, "Wrong alignment on UI_Controls_C_ExecuteUbergraph_UI_Controls");
static_assert(sizeof(UI_Controls_C_ExecuteUbergraph_UI_Controls) == 0x000148, "Wrong size on UI_Controls_C_ExecuteUbergraph_UI_Controls");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, EntryPoint) == 0x000000, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_IsInputKeyDown_ReturnValue) == 0x000028, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_IsInputKeyDown_ReturnValue_1) == 0x000029, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_IsInputKeyDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_GetPlayerController_ReturnValue_2) == 0x000030, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_BooleanOR_ReturnValue) == 0x000038, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_IsInputKeyDown_ReturnValue_2) == 0x000039, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_IsInputKeyDown_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_BooleanOR_ReturnValue_1) == 0x00003A, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_Create_ReturnValue_2) == 0x000040, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_Create_ReturnValue_3) == 0x000048, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_PlayAnimation_ReturnValue_2) == 0x000060, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_PlayAnimation_ReturnValue_3) == 0x000068, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_PlayAnimation_ReturnValue_4) == 0x000070, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_PlayAnimation_ReturnValue_5) == 0x000078, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_ComponentBoundEvent_Value) == 0x000080, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_PlayAnimation_ReturnValue_6) == 0x000088, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_PlayAnimation_ReturnValue_7) == 0x000090, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x000098, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_Event_MyGeometry) == 0x00009C, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_Event_InDeltaTime) == 0x0000D4, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_Create_ReturnValue_4) == 0x0000D8, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_Create_ReturnValue_5) == 0x0000E0, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_GetGameInstance_ReturnValue) == 0x0000E8, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_DynamicCast_AsGI_Settings) == 0x0000F0, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000100, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_DynamicCast_AsSG_Settings) == 0x000108, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_DynamicCast_AsSG_Settings' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000111, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000118, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_ComponentBoundEvent_bIsChecked) == 0x000120, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast) == 0x000128, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast_1) == 0x000130, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast_2) == 0x000138, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_ExecuteUbergraph_UI_Controls, K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast_3) == 0x000140, "Member 'UI_Controls_C_ExecuteUbergraph_UI_Controls::K2Node_VariableSet_Mouse_Sensitivity_ImplicitCast_3' has a wrong offset!");

// Function UI_Controls.UI_Controls_C.Get_Slider_Sensitivity_Value
// 0x0004 (0x0004 - 0x0000)
struct UI_Controls_C_Get_Slider_Sensitivity_Value final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Controls_C_Get_Slider_Sensitivity_Value) == 0x000004, "Wrong alignment on UI_Controls_C_Get_Slider_Sensitivity_Value");
static_assert(sizeof(UI_Controls_C_Get_Slider_Sensitivity_Value) == 0x000004, "Wrong size on UI_Controls_C_Get_Slider_Sensitivity_Value");
static_assert(offsetof(UI_Controls_C_Get_Slider_Sensitivity_Value, ReturnValue) == 0x000000, "Member 'UI_Controls_C_Get_Slider_Sensitivity_Value::ReturnValue' has a wrong offset!");

// Function UI_Controls.UI_Controls_C.GetCheckedState
// 0x0001 (0x0001 - 0x0000)
struct UI_Controls_C_GetCheckedState final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Controls_C_GetCheckedState) == 0x000001, "Wrong alignment on UI_Controls_C_GetCheckedState");
static_assert(sizeof(UI_Controls_C_GetCheckedState) == 0x000001, "Wrong size on UI_Controls_C_GetCheckedState");
static_assert(offsetof(UI_Controls_C_GetCheckedState, ReturnValue) == 0x000000, "Member 'UI_Controls_C_GetCheckedState::ReturnValue' has a wrong offset!");

// Function UI_Controls.UI_Controls_C.GetCheckedState_0
// 0x0005 (0x0005 - 0x0000)
struct UI_Controls_C_GetCheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Controls_C_GetCheckedState_0) == 0x000001, "Wrong alignment on UI_Controls_C_GetCheckedState_0");
static_assert(sizeof(UI_Controls_C_GetCheckedState_0) == 0x000005, "Wrong size on UI_Controls_C_GetCheckedState_0");
static_assert(offsetof(UI_Controls_C_GetCheckedState_0, ReturnValue) == 0x000000, "Member 'UI_Controls_C_GetCheckedState_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_GetCheckedState_0, Temp_bool_Variable) == 0x000001, "Member 'UI_Controls_C_GetCheckedState_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_GetCheckedState_0, Temp_byte_Variable) == 0x000002, "Member 'UI_Controls_C_GetCheckedState_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_GetCheckedState_0, Temp_byte_Variable_1) == 0x000003, "Member 'UI_Controls_C_GetCheckedState_0::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_GetCheckedState_0, K2Node_Select_Default) == 0x000004, "Member 'UI_Controls_C_GetCheckedState_0::K2Node_Select_Default' has a wrong offset!");

// Function UI_Controls.UI_Controls_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Controls_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Controls_C_Tick) == 0x000004, "Wrong alignment on UI_Controls_C_Tick");
static_assert(sizeof(UI_Controls_C_Tick) == 0x00003C, "Wrong size on UI_Controls_C_Tick");
static_assert(offsetof(UI_Controls_C_Tick, MyGeometry) == 0x000000, "Member 'UI_Controls_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Controls_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_Controls_C_Tick::InDeltaTime' has a wrong offset!");

}

