#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_DisplaySettings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "EngineUserSettings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_DisplaySettings.UI_DisplaySettings_C.BndEvt__UI_Settings_AuVi_Slider_FOV_1_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_1_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_1_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_1_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_1_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_1_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_1_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature, Value_0) == 0x000000, "Member 'UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_1_K2Node_ComponentBoundEvent_10_OnFloatValueChangedEvent__DelegateSignature::Value_0' has a wrong offset!");

// Function UI_DisplaySettings.UI_DisplaySettings_C.BndEvt__UI_Settings_AuVi_Slider_FOV_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature, Value_0) == 0x000000, "Member 'UI_DisplaySettings_C_BndEvt__UI_Settings_AuVi_Slider_FOV_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature::Value_0' has a wrong offset!");

// Function UI_DisplaySettings.UI_DisplaySettings_C.ExecuteUbergraph_UI_DisplaySettings
// 0x0288 (0x0288 - 0x0000)
struct UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGraphicsRHI                                  Temp_byte_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFrameRateLimit_ReturnValue;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetScreenResolution_ReturnValue;          // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOverallScalabilityLevel_ReturnValue;   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetFullscreenMode_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVSyncEnabled_ReturnValue;               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_2;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Controls_C*                         CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GridSnap_Float_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGraphicsRHI                                  Temp_byte_Variable_1;                              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGraphicsRHI                                  Temp_byte_Variable_2;                              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_8;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_9;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_GameSettings_C*                     CallFunc_Create_ReturnValue_1;                     // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_10;             // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_11;             // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGraphicsRHI                                  Temp_byte_Variable_3;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGraphicsRHI                                  Temp_byte_Variable_4;                              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_1;                      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_2;                      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_3;                      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_4;                      // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_5;                      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_2;                      // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_3;                      // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_AdvGraphics_C*                      CallFunc_Create_ReturnValue_2;                     // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_3;                     // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_4;                      // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue_5;                      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_4;                     // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ApplySettings_C>  K2Node_DynamicCast_AsBPI_Apply_Settings;           // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGraphicsRHI                                  CallFunc_GetPreferredRHI_ReturnValue;              // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGraphicsRHI                                  CallFunc_GetPreferredRHI_ReturnValue_1;            // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGraphicsRHI                                  K2Node_Select_Default;                             // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGraphicsRHI                                  K2Node_Select_Default_1;                           // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_AudioSettings_C*                    CallFunc_Create_ReturnValue_5;                     // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         K2Node_DynamicCast_AsSG_Settings;                  // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GridSnap_Float_Location_ImplicitCast;     // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_HUD_Opacity_ImplicitCast;       // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_FrameRate_ImplicitCast;         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_FrameRate_ImplicitCast_1;       // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings) == 0x000008, "Wrong alignment on UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings");
static_assert(sizeof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings) == 0x000288, "Wrong size on UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, EntryPoint) == 0x000000, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000008, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_MakeStruct_IntPoint) == 0x000010, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_Event_MyGeometry) == 0x000018, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_Event_InDeltaTime) == 0x000050, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, Temp_byte_Variable) == 0x000060, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_IsInputKeyDown_ReturnValue) == 0x000061, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetPlayerController_ReturnValue_1) == 0x000068, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetGameUserSettings_ReturnValue) == 0x000070, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_IsInputKeyDown_ReturnValue_1) == 0x000078, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_IsInputKeyDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetFrameRateLimit_ReturnValue) == 0x00007C, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetFrameRateLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_BooleanOR_ReturnValue) == 0x000080, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetScreenResolution_ReturnValue) == 0x000084, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetScreenResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetOverallScalabilityLevel_ReturnValue) == 0x00008C, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetOverallScalabilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetFullscreenMode_ReturnValue) == 0x000090, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetFullscreenMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_IsVSyncEnabled_ReturnValue) == 0x000091, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_IsVSyncEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, Temp_int_Variable) == 0x000094, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, Temp_bool_Variable) == 0x000098, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000A0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_IsInputKeyDown_ReturnValue_2) == 0x0000A8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_IsInputKeyDown_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_BooleanOR_ReturnValue_1) == 0x0000B8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_ComponentBoundEvent_Value_1) == 0x0000BC, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GridSnap_Float_ReturnValue) == 0x0000C0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GridSnap_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_ComponentBoundEvent_Value) == 0x0000C8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, Temp_byte_Variable_1) == 0x0000CC, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, Temp_byte_Variable_2) == 0x0000CD, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue) == 0x0000D0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000D8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000E0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000E8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000F0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_5) == 0x0000F8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_6) == 0x000100, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_7) == 0x000108, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, Temp_int_Variable_1) == 0x000110, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_8) == 0x000118, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_9) == 0x000120, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Create_ReturnValue_1) == 0x000128, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000130, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_10) == 0x000138, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_PlayAnimation_ReturnValue_11) == 0x000140, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_PlayAnimation_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, Temp_byte_Variable_3) == 0x000148, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, Temp_byte_Variable_4) == 0x000149, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000150, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000158, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_FClamp_ReturnValue) == 0x000160, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_FClamp_ReturnValue_1) == 0x000168, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_MakeStruct_IntPoint_1) == 0x000170, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_MakeStruct_IntPoint_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000178, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000179, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00017A, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00017B, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x00017C, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_MakeStruct_IntPoint_2) == 0x000180, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_MakeStruct_IntPoint_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_MakeStruct_IntPoint_3) == 0x000188, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_MakeStruct_IntPoint_3' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_MakeStruct_IntPoint_4) == 0x000190, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_MakeStruct_IntPoint_4' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_MakeStruct_IntPoint_5) == 0x000198, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_MakeStruct_IntPoint_5' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Add_IntInt_ReturnValue) == 0x0001A0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001A4, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Clamp_ReturnValue) == 0x0001A8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Clamp_ReturnValue_1) == 0x0001AC, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_SwitchInteger_CmpSuccess) == 0x0001B0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001B4, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Clamp_ReturnValue_2) == 0x0001B8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Clamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001BC, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Clamp_ReturnValue_3) == 0x0001C0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Clamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Create_ReturnValue_2) == 0x0001C8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001D0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001D4, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Create_ReturnValue_3) == 0x0001D8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Clamp_ReturnValue_4) == 0x0001E0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Clamp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Conv_IntToByte_ReturnValue) == 0x0001E4, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0001E8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetValidValue_ReturnValue) == 0x0001EC, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Clamp_ReturnValue_5) == 0x0001F0, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Clamp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x0001F4, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetValidValue_ReturnValue_1) == 0x0001F5, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetGameInstance_ReturnValue) == 0x0001F8, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_DynamicCast_AsGI_Settings) == 0x000200, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000210, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Create_ReturnValue_4) == 0x000218, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_DynamicCast_AsBPI_Apply_Settings) == 0x000220, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_DynamicCast_AsBPI_Apply_Settings' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_DynamicCast_bSuccess_1) == 0x000230, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetPreferredRHI_ReturnValue) == 0x000231, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetPreferredRHI_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GetPreferredRHI_ReturnValue_1) == 0x000232, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GetPreferredRHI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000233, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_Select_Default) == 0x000234, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_Select_Default_1) == 0x000235, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Create_ReturnValue_5) == 0x000238, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000240, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000248, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_DynamicCast_AsSG_Settings) == 0x000250, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_DynamicCast_AsSG_Settings' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_DynamicCast_bSuccess_2) == 0x000258, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_GridSnap_Float_Location_ImplicitCast) == 0x000260, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_GridSnap_Float_Location_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_VariableSet_HUD_Opacity_ImplicitCast) == 0x000268, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_VariableSet_HUD_Opacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000270, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000278, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_VariableSet_FrameRate_ImplicitCast) == 0x000280, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_VariableSet_FrameRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings, K2Node_VariableSet_FrameRate_ImplicitCast_1) == 0x000284, "Member 'UI_DisplaySettings_C_ExecuteUbergraph_UI_DisplaySettings::K2Node_VariableSet_FrameRate_ImplicitCast_1' has a wrong offset!");

// Function UI_DisplaySettings.UI_DisplaySettings_C.Get_DisplayMode_2_Text
// 0x0038 (0x0038 - 0x0000)
struct UI_DisplaySettings_C_Get_DisplayMode_2_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	EGraphicsRHI                                  CallFunc_GetPreferredRHI_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
};
static_assert(alignof(UI_DisplaySettings_C_Get_DisplayMode_2_Text) == 0x000008, "Wrong alignment on UI_DisplaySettings_C_Get_DisplayMode_2_Text");
static_assert(sizeof(UI_DisplaySettings_C_Get_DisplayMode_2_Text) == 0x000038, "Wrong size on UI_DisplaySettings_C_Get_DisplayMode_2_Text");
static_assert(offsetof(UI_DisplaySettings_C_Get_DisplayMode_2_Text, ReturnValue) == 0x000000, "Member 'UI_DisplaySettings_C_Get_DisplayMode_2_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_DisplayMode_2_Text, CallFunc_GetPreferredRHI_ReturnValue) == 0x000010, "Member 'UI_DisplaySettings_C_Get_DisplayMode_2_Text::CallFunc_GetPreferredRHI_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_DisplayMode_2_Text, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000018, "Member 'UI_DisplaySettings_C_Get_DisplayMode_2_Text::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_DisplayMode_2_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'UI_DisplaySettings_C_Get_DisplayMode_2_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UI_DisplaySettings.UI_DisplaySettings_C.Get_FOV
// 0x0008 (0x0008 - 0x0000)
struct UI_DisplaySettings_C_Get_FOV final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_DisplaySettings_C_Get_FOV) == 0x000004, "Wrong alignment on UI_DisplaySettings_C_Get_FOV");
static_assert(sizeof(UI_DisplaySettings_C_Get_FOV) == 0x000008, "Wrong size on UI_DisplaySettings_C_Get_FOV");
static_assert(offsetof(UI_DisplaySettings_C_Get_FOV, ReturnValue) == 0x000000, "Member 'UI_DisplaySettings_C_Get_FOV::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_FOV, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_DisplaySettings_C_Get_FOV::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_DisplaySettings.UI_DisplaySettings_C.Get_FPS
// 0x0060 (0x0060 - 0x0000)
struct UI_DisplaySettings_C_Get_FPS final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0030(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0010)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_DisplaySettings_C_Get_FPS) == 0x000008, "Wrong alignment on UI_DisplaySettings_C_Get_FPS");
static_assert(sizeof(UI_DisplaySettings_C_Get_FPS) == 0x000060, "Wrong size on UI_DisplaySettings_C_Get_FPS");
static_assert(offsetof(UI_DisplaySettings_C_Get_FPS, ReturnValue) == 0x000000, "Member 'UI_DisplaySettings_C_Get_FPS::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_FPS, Temp_bool_Variable) == 0x000010, "Member 'UI_DisplaySettings_C_Get_FPS::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_FPS, Temp_text_Variable) == 0x000018, "Member 'UI_DisplaySettings_C_Get_FPS::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_FPS, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000028, "Member 'UI_DisplaySettings_C_Get_FPS::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_FPS, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000030, "Member 'UI_DisplaySettings_C_Get_FPS::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_FPS, K2Node_Select_Default) == 0x000040, "Member 'UI_DisplaySettings_C_Get_FPS::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_FPS, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000050, "Member 'UI_DisplaySettings_C_Get_FPS::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_DisplaySettings_C_Get_FPS, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'UI_DisplaySettings_C_Get_FPS::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function UI_DisplaySettings.UI_DisplaySettings_C.Get_Graphics
// 0x0078 (0x0078 - 0x0000)
struct UI_DisplaySettings_C_Get_Graphics final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0048(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x0058(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0068(0x0010)()
};
