#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_GameSettings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_GameSettings.UI_GameSettings_C.BndEvt__UI_GameSettings_CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_GameSettings_C_BndEvt__UI_GameSettings_CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_BndEvt__UI_GameSettings_CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on UI_GameSettings_C_BndEvt__UI_GameSettings_CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(UI_GameSettings_C_BndEvt__UI_GameSettings_CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on UI_GameSettings_C_BndEvt__UI_GameSettings_CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(UI_GameSettings_C_BndEvt__UI_GameSettings_CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'UI_GameSettings_C_BndEvt__UI_GameSettings_CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.BndEvt__UI_Settings_Game_Slider_LockOnSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_GameSettings_C_BndEvt__UI_Settings_Game_Slider_LockOnSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_BndEvt__UI_Settings_Game_Slider_LockOnSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_GameSettings_C_BndEvt__UI_Settings_Game_Slider_LockOnSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_GameSettings_C_BndEvt__UI_Settings_Game_Slider_LockOnSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_GameSettings_C_BndEvt__UI_Settings_Game_Slider_LockOnSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_GameSettings_C_BndEvt__UI_Settings_Game_Slider_LockOnSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UI_GameSettings_C_BndEvt__UI_Settings_Game_Slider_LockOnSlider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_GameSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_GameSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_GameSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_GameSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_GameSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UI_GameSettings_C_BndEvt__UI_Settings_Slider_0_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_GameSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UI_GameSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UI_GameSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UI_GameSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UI_GameSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UI_GameSettings_C_BndEvt__UI_Settings_Slider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.ExecuteUbergraph_UI_GameSettings
// 0x0168 (0x0168 - 0x0000)
struct UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_GoreSettings_C*                     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Controls_C*                         CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0034(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWillie_BP_C*                           K2Node_DynamicCast_AsWillie_BP;                    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_2;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_DisplaySettings_C*                  CallFunc_Create_ReturnValue_2;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_3;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_4;                     // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         K2Node_DynamicCast_AsSG_Settings;                  // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_Settings_C*                         CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_AudioSettings_C*                    CallFunc_Create_ReturnValue_5;                     // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Player_Damage_Rate_ImplicitCast; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_NPC_Damage_Rate_ImplicitCast;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Lock_On_Strength_ImplicitCast;  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings) == 0x000008, "Wrong alignment on UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings");
static_assert(sizeof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings) == 0x000168, "Wrong size on UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, EntryPoint) == 0x000000, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_IsInputKeyDown_ReturnValue) == 0x000018, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_IsInputKeyDown_ReturnValue_1) == 0x000030, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_IsInputKeyDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_BooleanOR_ReturnValue) == 0x000031, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_Event_MyGeometry) == 0x000034, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_Event_InDeltaTime) == 0x00006C, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_Event_IsDesignTime) == 0x000070, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_GetGameInstance_ReturnValue) == 0x000078, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000080, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_DynamicCast_AsGI_Settings) == 0x000088, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_DynamicCast_AsGI_Settings' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_DynamicCast_AsWillie_BP) == 0x000098, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_DynamicCast_AsWillie_BP' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_ComponentBoundEvent_Value_2) == 0x0000A4, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_ComponentBoundEvent_Value_1) == 0x0000A8, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000B0, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_IsInputKeyDown_ReturnValue_2) == 0x0000B8, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_IsInputKeyDown_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_BooleanOR_ReturnValue_1) == 0x0000B9, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_ComponentBoundEvent_Value) == 0x0000BC, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_Create_ReturnValue_2) == 0x0000C0, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_PlayAnimation_ReturnValue) == 0x0000C8, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000D0, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000D8, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000E0, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000E8, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_PlayAnimation_ReturnValue_5) == 0x0000F0, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_PlayAnimation_ReturnValue_6) == 0x0000F8, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_Create_ReturnValue_3) == 0x000100, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_PlayAnimation_ReturnValue_7) == 0x000108, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_Create_ReturnValue_4) == 0x000110, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000118, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000120, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_DynamicCast_AsSG_Settings) == 0x000128, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_DynamicCast_AsSG_Settings' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000138, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, CallFunc_Create_ReturnValue_5) == 0x000140, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_ComponentBoundEvent_bIsChecked) == 0x000148, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_VariableSet_Player_Damage_Rate_ImplicitCast) == 0x000150, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_VariableSet_Player_Damage_Rate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_VariableSet_NPC_Damage_Rate_ImplicitCast) == 0x000158, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_VariableSet_NPC_Damage_Rate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings, K2Node_VariableSet_Lock_On_Strength_ImplicitCast) == 0x000160, "Member 'UI_GameSettings_C_ExecuteUbergraph_UI_GameSettings::K2Node_VariableSet_Lock_On_Strength_ImplicitCast' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.Get_BoneSnappingSlid_Value
// 0x0008 (0x0008 - 0x0000)
struct UI_GameSettings_C_Get_BoneSnappingSlid_Value final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_Get_BoneSnappingSlid_Value) == 0x000004, "Wrong alignment on UI_GameSettings_C_Get_BoneSnappingSlid_Value");
static_assert(sizeof(UI_GameSettings_C_Get_BoneSnappingSlid_Value) == 0x000008, "Wrong size on UI_GameSettings_C_Get_BoneSnappingSlid_Value");
static_assert(offsetof(UI_GameSettings_C_Get_BoneSnappingSlid_Value, ReturnValue) == 0x000000, "Member 'UI_GameSettings_C_Get_BoneSnappingSlid_Value::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_Get_BoneSnappingSlid_Value, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GameSettings_C_Get_BoneSnappingSlid_Value::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.Get_Slider_DamagePlayer_Value
// 0x0008 (0x0008 - 0x0000)
struct UI_GameSettings_C_Get_Slider_DamagePlayer_Value final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_Get_Slider_DamagePlayer_Value) == 0x000004, "Wrong alignment on UI_GameSettings_C_Get_Slider_DamagePlayer_Value");
static_assert(sizeof(UI_GameSettings_C_Get_Slider_DamagePlayer_Value) == 0x000008, "Wrong size on UI_GameSettings_C_Get_Slider_DamagePlayer_Value");
static_assert(offsetof(UI_GameSettings_C_Get_Slider_DamagePlayer_Value, ReturnValue) == 0x000000, "Member 'UI_GameSettings_C_Get_Slider_DamagePlayer_Value::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_Get_Slider_DamagePlayer_Value, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GameSettings_C_Get_Slider_DamagePlayer_Value::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.Get_Slider_LockOnSlider_Value
// 0x0008 (0x0008 - 0x0000)
struct UI_GameSettings_C_Get_Slider_LockOnSlider_Value final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_Get_Slider_LockOnSlider_Value) == 0x000004, "Wrong alignment on UI_GameSettings_C_Get_Slider_LockOnSlider_Value");
static_assert(sizeof(UI_GameSettings_C_Get_Slider_LockOnSlider_Value) == 0x000008, "Wrong size on UI_GameSettings_C_Get_Slider_LockOnSlider_Value");
static_assert(offsetof(UI_GameSettings_C_Get_Slider_LockOnSlider_Value, ReturnValue) == 0x000000, "Member 'UI_GameSettings_C_Get_Slider_LockOnSlider_Value::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_Get_Slider_LockOnSlider_Value, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GameSettings_C_Get_Slider_LockOnSlider_Value::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.GetCheckedState
// 0x0005 (0x0005 - 0x0000)
struct UI_GameSettings_C_GetCheckedState final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_GetCheckedState) == 0x000001, "Wrong alignment on UI_GameSettings_C_GetCheckedState");
static_assert(sizeof(UI_GameSettings_C_GetCheckedState) == 0x000005, "Wrong size on UI_GameSettings_C_GetCheckedState");
static_assert(offsetof(UI_GameSettings_C_GetCheckedState, ReturnValue) == 0x000000, "Member 'UI_GameSettings_C_GetCheckedState::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_GetCheckedState, Temp_bool_Variable) == 0x000001, "Member 'UI_GameSettings_C_GetCheckedState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_GetCheckedState, Temp_byte_Variable) == 0x000002, "Member 'UI_GameSettings_C_GetCheckedState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_GetCheckedState, Temp_byte_Variable_1) == 0x000003, "Member 'UI_GameSettings_C_GetCheckedState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_GetCheckedState, K2Node_Select_Default) == 0x000004, "Member 'UI_GameSettings_C_GetCheckedState::K2Node_Select_Default' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.GetValue
// 0x0008 (0x0008 - 0x0000)
struct UI_GameSettings_C_GetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_GetValue) == 0x000004, "Wrong alignment on UI_GameSettings_C_GetValue");
static_assert(sizeof(UI_GameSettings_C_GetValue) == 0x000008, "Wrong size on UI_GameSettings_C_GetValue");
static_assert(offsetof(UI_GameSettings_C_GetValue, ReturnValue) == 0x000000, "Member 'UI_GameSettings_C_GetValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_GetValue, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GameSettings_C_GetValue::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.GetValue_0
// 0x0008 (0x0008 - 0x0000)
struct UI_GameSettings_C_GetValue_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_GetValue_0) == 0x000004, "Wrong alignment on UI_GameSettings_C_GetValue_0");
static_assert(sizeof(UI_GameSettings_C_GetValue_0) == 0x000008, "Wrong size on UI_GameSettings_C_GetValue_0");
static_assert(offsetof(UI_GameSettings_C_GetValue_0, ReturnValue) == 0x000000, "Member 'UI_GameSettings_C_GetValue_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_GetValue_0, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GameSettings_C_GetValue_0::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.GetValue_1
// 0x0008 (0x0008 - 0x0000)
struct UI_GameSettings_C_GetValue_1 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_GetValue_1) == 0x000004, "Wrong alignment on UI_GameSettings_C_GetValue_1");
static_assert(sizeof(UI_GameSettings_C_GetValue_1) == 0x000008, "Wrong size on UI_GameSettings_C_GetValue_1");
static_assert(offsetof(UI_GameSettings_C_GetValue_1, ReturnValue) == 0x000000, "Member 'UI_GameSettings_C_GetValue_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_GetValue_1, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GameSettings_C_GetValue_1::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.GetValue_2
// 0x0004 (0x0004 - 0x0000)
struct UI_GameSettings_C_GetValue_2 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_GetValue_2) == 0x000004, "Wrong alignment on UI_GameSettings_C_GetValue_2");
static_assert(sizeof(UI_GameSettings_C_GetValue_2) == 0x000004, "Wrong size on UI_GameSettings_C_GetValue_2");
static_assert(offsetof(UI_GameSettings_C_GetValue_2, ReturnValue) == 0x000000, "Member 'UI_GameSettings_C_GetValue_2::ReturnValue' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.GetValue_3
// 0x0008 (0x0008 - 0x0000)
struct UI_GameSettings_C_GetValue_3 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_GetValue_3) == 0x000004, "Wrong alignment on UI_GameSettings_C_GetValue_3");
static_assert(sizeof(UI_GameSettings_C_GetValue_3) == 0x000008, "Wrong size on UI_GameSettings_C_GetValue_3");
static_assert(offsetof(UI_GameSettings_C_GetValue_3, ReturnValue) == 0x000000, "Member 'UI_GameSettings_C_GetValue_3::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_GetValue_3, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'UI_GameSettings_C_GetValue_3::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_GameSettings_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_PreConstruct) == 0x000001, "Wrong alignment on UI_GameSettings_C_PreConstruct");
static_assert(sizeof(UI_GameSettings_C_PreConstruct) == 0x000001, "Wrong size on UI_GameSettings_C_PreConstruct");
static_assert(offsetof(UI_GameSettings_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_GameSettings_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_GameSettings.UI_GameSettings_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_GameSettings_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GameSettings_C_Tick) == 0x000004, "Wrong alignment on UI_GameSettings_C_Tick");
static_assert(sizeof(UI_GameSettings_C_Tick) == 0x00003C, "Wrong size on UI_GameSettings_C_Tick");
static_assert(offsetof(UI_GameSettings_C_Tick, MyGeometry) == 0x000000, "Member 'UI_GameSettings_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_GameSettings_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_GameSettings_C_Tick::InDeltaTime' has a wrong offset!");

}

