#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PhotoPage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_PhotoPage.UI_PhotoPage_C.ExecuteUbergraph_UI_PhotoPage
// 0x00E0 (0x00E0 - 0x0000)
struct UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_PhotoThumbnail_C*                   CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Gallery_C*                          K2Node_CustomEvent_GalleryReference;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PageIndex;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0098(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_PhotoThumbnail_C*                   CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage) == 0x000008, "Wrong alignment on UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage");
static_assert(sizeof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage) == 0x0000E0, "Wrong size on UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, EntryPoint) == 0x000000, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, Temp_int_Variable) == 0x000004, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Add_IntInt_ReturnValue_2) == 0x00001C, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Create_ReturnValue) == 0x000020, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, Temp_int_Loop_Counter_Variable_2) == 0x000028, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Add_IntInt_ReturnValue_3) == 0x00002C, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, K2Node_Event_IsDesignTime) == 0x000034, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00003C, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, K2Node_CustomEvent_GalleryReference) == 0x000048, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::K2Node_CustomEvent_GalleryReference' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, K2Node_CustomEvent_PageIndex) == 0x000050, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::K2Node_CustomEvent_PageIndex' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Array_Get_Item) == 0x000060, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, Temp_int_Variable_1) == 0x00006C, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000078, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000080, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Add_IntInt_ReturnValue_4) == 0x000084, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Array_Length_ReturnValue_2) == 0x000090, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Less_IntInt_ReturnValue_2) == 0x000094, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, K2Node_Event_MyGeometry) == 0x000098, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, K2Node_Event_InDeltaTime) == 0x0000D0, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, Temp_int_Array_Index_Variable_2) == 0x0000D4, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage, CallFunc_Array_Get_Item_2) == 0x0000D8, "Member 'UI_PhotoPage_C_ExecuteUbergraph_UI_PhotoPage::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function UI_PhotoPage.UI_PhotoPage_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoPage_C_Initialize final
{
public:
	class UUI_Gallery_C*                          GalleryReference_0;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PageIndex_0;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoPage_C_Initialize) == 0x000008, "Wrong alignment on UI_PhotoPage_C_Initialize");
static_assert(sizeof(UI_PhotoPage_C_Initialize) == 0x000010, "Wrong size on UI_PhotoPage_C_Initialize");
static_assert(offsetof(UI_PhotoPage_C_Initialize, GalleryReference_0) == 0x000000, "Member 'UI_PhotoPage_C_Initialize::GalleryReference_0' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_Initialize, PageIndex_0) == 0x000008, "Member 'UI_PhotoPage_C_Initialize::PageIndex_0' has a wrong offset!");

// Function UI_PhotoPage.UI_PhotoPage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_PhotoPage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoPage_C_PreConstruct) == 0x000001, "Wrong alignment on UI_PhotoPage_C_PreConstruct");
static_assert(sizeof(UI_PhotoPage_C_PreConstruct) == 0x000001, "Wrong size on UI_PhotoPage_C_PreConstruct");
static_assert(offsetof(UI_PhotoPage_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_PhotoPage_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_PhotoPage.UI_PhotoPage_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_PhotoPage_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PhotoPage_C_Tick) == 0x000004, "Wrong alignment on UI_PhotoPage_C_Tick");
static_assert(sizeof(UI_PhotoPage_C_Tick) == 0x00003C, "Wrong size on UI_PhotoPage_C_Tick");
static_assert(offsetof(UI_PhotoPage_C_Tick, MyGeometry) == 0x000000, "Member 'UI_PhotoPage_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_PhotoPage_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_PhotoPage_C_Tick::InDeltaTime' has a wrong offset!");

}

