#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Pause

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Pause.UI_Pause_C
// 0x00C8 (0x03A8 - 0x02E0)
class UUI_Pause_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverRestart;                                      // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverToMenu;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverToDesktop;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverQuit;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverSettings;                                     // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverContinue;                                     // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonContinue;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonContinue_1;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonQit;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonQit_1;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonRestart;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonRestart_1;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonSettings;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonSettings_1;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Desktop;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Desktop_1;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Menu;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Menu_1;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         QuitBox;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         QuitBox_Japanese;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 LastOpenedWidget;                                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Pause_UI_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Pause_UI_ButtonSettings_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Pause_ButtonContinue_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_ButtonContinue_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_ButtonQit_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Pause_ButtonQit_1_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_ButtonQit_1_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_ButtonQit_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Pause_ButtonQit_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_ButtonQit_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_ButtonSettings_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_ButtonSettings_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_Desktop_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_Desktop_K2Node_ComponentBoundEvent_17_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_Desktop_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Pause_Menu_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_Menu_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Pause_Menu_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Pause(int32 EntryPoint);
	void GetLastOpenedWidget();
	void SetLastOpenedWidget(class UClass* UW);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Pause_C">();
	}
	static class UUI_Pause_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Pause_C>();
	}
};
static_assert(alignof(UUI_Pause_C) == 0x000008, "Wrong alignment on UUI_Pause_C");
static_assert(sizeof(UUI_Pause_C) == 0x0003A8, "Wrong size on UUI_Pause_C");
static_assert(offsetof(UUI_Pause_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_Pause_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, HoverRestart) == 0x0002E8, "Member 'UUI_Pause_C::HoverRestart' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, HoverToMenu) == 0x0002F0, "Member 'UUI_Pause_C::HoverToMenu' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, HoverToDesktop) == 0x0002F8, "Member 'UUI_Pause_C::HoverToDesktop' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, HoverQuit) == 0x000300, "Member 'UUI_Pause_C::HoverQuit' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, HoverSettings) == 0x000308, "Member 'UUI_Pause_C::HoverSettings' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, HoverContinue) == 0x000310, "Member 'UUI_Pause_C::HoverContinue' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, ButtonContinue) == 0x000318, "Member 'UUI_Pause_C::ButtonContinue' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, ButtonContinue_1) == 0x000320, "Member 'UUI_Pause_C::ButtonContinue_1' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, ButtonQit) == 0x000328, "Member 'UUI_Pause_C::ButtonQit' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, ButtonQit_1) == 0x000330, "Member 'UUI_Pause_C::ButtonQit_1' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, ButtonRestart) == 0x000338, "Member 'UUI_Pause_C::ButtonRestart' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, ButtonRestart_1) == 0x000340, "Member 'UUI_Pause_C::ButtonRestart_1' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, ButtonSettings) == 0x000348, "Member 'UUI_Pause_C::ButtonSettings' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, ButtonSettings_1) == 0x000350, "Member 'UUI_Pause_C::ButtonSettings_1' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, Desktop) == 0x000358, "Member 'UUI_Pause_C::Desktop' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, Desktop_1) == 0x000360, "Member 'UUI_Pause_C::Desktop_1' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, Image_0) == 0x000368, "Member 'UUI_Pause_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, Image_3) == 0x000370, "Member 'UUI_Pause_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, Menu) == 0x000378, "Member 'UUI_Pause_C::Menu' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, Menu_1) == 0x000380, "Member 'UUI_Pause_C::Menu_1' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, QuitBox) == 0x000388, "Member 'UUI_Pause_C::QuitBox' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, QuitBox_Japanese) == 0x000390, "Member 'UUI_Pause_C::QuitBox_Japanese' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, TextBlock_0) == 0x000398, "Member 'UUI_Pause_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UUI_Pause_C, LastOpenedWidget) == 0x0003A0, "Member 'UUI_Pause_C::LastOpenedWidget' has a wrong offset!");

}

