#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Part_MaceHead_F

#include "Basic.hpp"

#include "Modular_MaceHead_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_Part_MaceHead_F.Weapon_Part_MaceHead_F_C
// 0x00C0 (0x05C8 - 0x0508)
class AWeapon_Part_MaceHead_F_C final : public AModular_MaceHead_Master_C
{
public:
	class UArrowComponent*                        ArrowTip12;                                        // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip12;                                             // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip11;                                        // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip11;                                             // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip10;                                        // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip10;                                             // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip9;                                         // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip9;                                              // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip8;                                         // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip8;                                              // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip7;                                         // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip7;                                              // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip6;                                         // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip6;                                              // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip5;                                         // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip5;                                              // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip4;                                         // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip4;                                              // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip3;                                         // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip3;                                              // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip2;                                         // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ArrowTip1;                                         // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip2;                                              // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1_0;                                            // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Weapon_Part_MaceHead_F_C">();
	}
	static class AWeapon_Part_MaceHead_F_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapon_Part_MaceHead_F_C>();
	}
};
static_assert(alignof(AWeapon_Part_MaceHead_F_C) == 0x000008, "Wrong alignment on AWeapon_Part_MaceHead_F_C");
static_assert(sizeof(AWeapon_Part_MaceHead_F_C) == 0x0005C8, "Wrong size on AWeapon_Part_MaceHead_F_C");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip12) == 0x000508, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip12' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip12) == 0x000510, "Member 'AWeapon_Part_MaceHead_F_C::Tip12' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip11) == 0x000518, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip11' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip11) == 0x000520, "Member 'AWeapon_Part_MaceHead_F_C::Tip11' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip10) == 0x000528, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip10' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip10) == 0x000530, "Member 'AWeapon_Part_MaceHead_F_C::Tip10' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip9) == 0x000538, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip9' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip9) == 0x000540, "Member 'AWeapon_Part_MaceHead_F_C::Tip9' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip8) == 0x000548, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip8' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip8) == 0x000550, "Member 'AWeapon_Part_MaceHead_F_C::Tip8' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip7) == 0x000558, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip7' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip7) == 0x000560, "Member 'AWeapon_Part_MaceHead_F_C::Tip7' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip6) == 0x000568, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip6' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip6) == 0x000570, "Member 'AWeapon_Part_MaceHead_F_C::Tip6' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip5) == 0x000578, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip5' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip5) == 0x000580, "Member 'AWeapon_Part_MaceHead_F_C::Tip5' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip4) == 0x000588, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip4' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip4) == 0x000590, "Member 'AWeapon_Part_MaceHead_F_C::Tip4' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip3) == 0x000598, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip3' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip3) == 0x0005A0, "Member 'AWeapon_Part_MaceHead_F_C::Tip3' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip2) == 0x0005A8, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip2' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, ArrowTip1) == 0x0005B0, "Member 'AWeapon_Part_MaceHead_F_C::ArrowTip1' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip2) == 0x0005B8, "Member 'AWeapon_Part_MaceHead_F_C::Tip2' has a wrong offset!");
static_assert(offsetof(AWeapon_Part_MaceHead_F_C, Tip1_0) == 0x0005C0, "Member 'AWeapon_Part_MaceHead_F_C::Tip1_0' has a wrong offset!");

}

