#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Part_Hafted_Head_BA

#include "Basic.hpp"

#include "Enum_MaterialQuality_structs.hpp"
#include "Enum_MaterialLayer_structs.hpp"


namespace SDK::Params
{

// Function Weapon_Part_Hafted_Head_BA.Weapon_Part_Hafted_Head_BA_C.UserConstructionScript
// 0x0005 (0x0005 - 0x0000)
struct Weapon_Part_Hafted_Head_BA_C_UserConstructionScript final
{
public:
	Enum_MaterialQuality                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Temp_byte_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weapon_Part_Hafted_Head_BA_C_UserConstructionScript) == 0x000001, "Wrong alignment on Weapon_Part_Hafted_Head_BA_C_UserConstructionScript");
static_assert(sizeof(Weapon_Part_Hafted_Head_BA_C_UserConstructionScript) == 0x000005, "Wrong size on Weapon_Part_Hafted_Head_BA_C_UserConstructionScript");
static_assert(offsetof(Weapon_Part_Hafted_Head_BA_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'Weapon_Part_Hafted_Head_BA_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Hafted_Head_BA_C_UserConstructionScript, Temp_byte_Variable_1) == 0x000001, "Member 'Weapon_Part_Hafted_Head_BA_C_UserConstructionScript::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Hafted_Head_BA_C_UserConstructionScript, Temp_byte_Variable_2) == 0x000002, "Member 'Weapon_Part_Hafted_Head_BA_C_UserConstructionScript::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Hafted_Head_BA_C_UserConstructionScript, Temp_byte_Variable_3) == 0x000003, "Member 'Weapon_Part_Hafted_Head_BA_C_UserConstructionScript::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Weapon_Part_Hafted_Head_BA_C_UserConstructionScript, K2Node_Select_Default) == 0x000004, "Member 'Weapon_Part_Hafted_Head_BA_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");

}

